[{"title": "How to Eat a Banana", "id": "evI3DEP1FMM", "url": "https://www.youtube.com/embed/evI3DEP1FMM?showinfo=0", "uploader": "wikiHow", "views": 17876, "duration": 58, "description": "Learn How to Eat a Banana with this guide from wikiHow: https://www.wikihow.com/Eat-a-Banana\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "evI3DEP1FMM.mp4", "subtitles": "to eat a banana first find one that's ripe so it's sweet and easy to digest if it's still green it's not ripe enough yet when it turns yellow the banana is ripe enough to eat it will be sweetest when there are few light brown spots on the peel to peel the banana snap back the stock at the top of the fruit then pull it downwards pull the rest of the skin off in similar strips you can also peel the banana from the blossom end which is the flat Brown stub at the end of the banana pinch just behind the blossom end to break it apart then peel the skin off of the banana eat the fruit or cut it into pieces for a healthy breakfast add banana pieces to a smoothie cereal yogurt or oatmeal for something sweeter dip whole or sliced bananas into melted chocolateto eat a banana first find one that's ripe so it's sweet and easy to digest if it's still green it's not ripe enough yet when it turns yellow the banana is ripe enough to eat it will be sweetest when there are few light brown spots on the peel to peel the banana snap back the stock at the top of the fruit then pull it downwards pull the rest of the skin off in similar strips you can also peel the banana from the blossom end which is the flat Brown stub at the end of the banana pinch just behind the blossom end to break it apart then peel the skin off of the banana eat the fruit or cut it into pieces for a healthy breakfast add banana pieces to a smoothie cereal yogurt or oatmeal for something sweeter dip whole or sliced bananas into melted chocolate"}, {"title": "A Ki-what-o?", "id": "CoqOdVbVE6I", "url": "https://www.youtube.com/embed/CoqOdVbVE6I", "uploader": "Jason Covert", "views": 80614, "duration": 45, "description": "The slicing of a kiwano melon, otherwise known as the African Horned Cucumber.", "hosted_mp4": "CoqOdVbVE6I.mp4", "subtitles": ""}, {"title": "How to Eat a Rambutan", "id": "zfo-MnjW7Ng", "url": "https://www.youtube.com/embed/zfo-MnjW7Ng", "uploader": "Guidecentral English", "views": 2205, "duration": 18, "description": "Learn how to eat a rambutan with this guide from wikiHow: https://www.wikihow.com/Eat-a-Rambutan\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "zfo-MnjW7Ng.mp4", "subtitles": "cut the outer skin with a sharp knife squeeze the outer skin gently until the milky white edible Center pops out cut into the flesh and remove the seed inside pop the deseeded flesh into your mouth and enjoy [Music]cut the outer skin with a sharp knife squeeze the outer skin gently until the milky white edible Center pops out cut into the flesh and remove the seed inside pop the deseeded flesh into your mouth and enjoy [Music]"}, {"title": "How to Eat Crabs", "id": "YG5gj49AhAY", "url": "https://www.youtube.com/embed/YG5gj49AhAY", "uploader": "Guidecentral English", "views": 2438, "duration": 30, "description": "Learn how to eat crabs with this guide from wikiHow: https://www.wikihow.com/Eat-Crabs\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "YG5gj49AhAY.mp4", "subtitles": "to eat crabs start by pulling off all the legs and claws in a twisting motion next take the top half and the bottom half in each hand as if you're opening a book and pull off the top shell then break the bottom part in half to expose the meat which you can pull out with your fingers or a knife you can also crack the claws with the hinge cracker or hit them with the crab mallet to get the meatto eat crabs start by pulling off all the legs and claws in a twisting motion next take the top half and the bottom half in each hand as if you're opening a book and pull off the top shell then break the bottom part in half to expose the meat which you can pull out with your fingers or a knife you can also crack the claws with the hinge cracker or hit them with the crab mallet to get the meat"}, {"title": "How to Eat Papaya Seeds", "id": "ZKyb1xDhK_A", "url": "https://www.youtube.com/embed/ZKyb1xDhK_A?showinfo=0", "uploader": "wikiHow", "views": 32168, "duration": 69, "description": "Learn how to eat papaya seeds with this guide from wikiHow: https://www.wikihow.com/Eat-Papaya-Seeds\n\n0:00 Eating Raw Papaya Seeds\n0:30 Drying and Grinding\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "ZKyb1xDhK_A.mp4", "subtitles": ""}, {"title": "How to Eat Sunflower Seeds", "id": "eAKVAwA722Q", "url": "https://www.youtube.com/embed/eAKVAwA722Q", "uploader": "Guidecentral English", "views": 7067, "duration": 23, "description": "Learn how to eat sunflower seeds with this guide from wikiHow: https://www.wikihow.com/Eat-Sunflower-Seeds\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "eAKVAwA722Q.mp4", "subtitles": "i mean sollecito pleistocene negative arctici mean sollecito pleistocene negative arctic i mean sollecito pleistocene negative arcticCombat mossCombat moss Combat mossbanderas integrates with shirts Yoochunbanderas integrates with shirts Yoochun banderas integrates with shirts YoochunTakeshi formulas and status out to theTakeshi formulas and status out to the Takeshi formulas and status out to thescene blood type elf And I"}, {"title": "What's the most common mistake beginner gardeners make? | wikiHow Asks a Plant Specialist", "id": "oilGO8tjyBo", "url": "https://www.youtube.com/embed/oilGO8tjyBo?showinfo=0", "uploader": "wikiHow", "views": 145, "duration": 92, "description": "Learn how to avoid the most common mistake beginner gardeners make with Plant Specialist Monique Capanelli. \n\n--- \nMonique Capanelli is a Plant Specialist and the Owner and Designer for Articulture Designs, an innovative design firm and boutique in Austin, Texas. With over 15 years of experience, Monique specializes in interior botanical design, living walls, event decor, and sustainable landscape design. She attended the University of Texas at Austin. Monique is a Certified Permaculture Designer. She provides plant and botanical design experiences, from small gifts to entire transformations, to shoppers as well as commercial clients including Whole Foods Market and The Four Seasons.\nLearn more: https://www.articulturedesigns.com/\n\n----\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "oilGO8tjyBo.mp4", "subtitles": ""}, {"title": "How to Add Fruit to Jello", "id": "LdaRCHEXM2U", "url": "https://www.youtube.com/embed/LdaRCHEXM2U?showinfo=0", "uploader": "wikiHow", "views": 9595, "duration": 132, "description": "Learn how to add fruit to jello with this guide from wikiHow: https://www.wikihow.com/Add-Fruit-to-Jello\n\n0:00 Preparing Store-Bought Jello\n0:23 Choosing and Layering the Fruit\n1:03 Pouring and Setting the Jello Dessert\n1:28 Making Homemade Vegan Jello\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "LdaRCHEXM2U.mp4", "subtitles": ""}, {"title": "How to Bake In High-Altitudes | MyRecipes", "id": "dB1EzkEWjso", "url": "https://www.youtube.com/embed/dB1EzkEWjso", "uploader": "MyRecipes", "views": 4385, "duration": 53, "description": "When you're cooking at altitudes over 2-3000 feet above sea level, the air is thinner and drier so foods may react differently when they're cooked. \n\nFoods, like bread and cake, dry out more quickly and bake differently so you may need to make some adjustments. A good trick is to let cake batters stand for about 15 minutes before baking so some of the leavening gases can be released. Also, if you fill the pans just halfway full, it will give the food more room to rise. \n\nWe have a great high-altitude baking chart on MyRecipes that you can follow based on your distance above sea level. Depending on where you live, you'll need reduce the baking powder and sugar and increase the liquid in baked goods. Unfortunately, a lot of it is trial and error so it may take a few times to figure out which proportions work best for you.\n\nBaking chart: http://cookingquestions.myrecipes.com/2011/02/how-do-i-adjust-a-recipe-for-high-altitude-cooking-.html\n\nFor more videos like this subscribe to our channel on YouTube: http://www.youtube.com/subscription_center?add_user=myrecipestv\n\nVisit MyRecipes: http://www.myrecipes.com/\nGet exclusive newsletters: http://www.myrecipes.com/newsletter/\nLike MyRecipes on Facebook:https://www.facebook.com/myrecipes\nFollow MyRecipes on Instagram: http://instagram.com/myrecipes#\nFollow MyRecipes on Twitter: https://twitter.com/my_recipes\nFollow MyRecipes on G+:https://plus.google.com/+myrecipes/posts\nFollow MyRecipes on Pinterest:http://www.pinterest.com/myrecipes/\n\nRecipe: Moist Chocolate Cupcake, Southern Living\nPhoto: Beth Dreiling\nhttp://find.myrecipes.com/recipes/recipefinder.dyn?action=displayRecipe&recipe_id=10000001589404", "hosted_mp4": "dB1EzkEWjso.mp4", "subtitles": "hi Amy and Amy thank you for your questions I'm Holly the nutrition editor at my recipes calm you both asked about high altitude baking now when you're baking at a high altitude it really does depend on your sea level as far as the proportion of ingredients that you use so whether it's the baking powder sugar or liquid depending on your sea level you need to check to see if you need to reduce or increase those a lot of it's trial and error but if you look at our chart on my recipes calm you can find just the amount that you need another trick when you've made your batter let it sit for about 15 minutes before you bake it this lets any of the leavening gases release so they don't overflow one more quick tip for you only fill your pans about half way full this gives the food plenty of room to rise and Amy that may help you with those dumb cupcakes you're talking about good luck baking and will talk to you soonhi Amy and Amy thank you for your questions I'm Holly the nutrition editor at my recipes calm you both asked about high altitude baking now when you're baking at a high altitude it really does depend on your sea level as far as the proportion of ingredients that you use so whether it's the baking powder sugar or liquid depending on your sea level you need to check to see if you need to reduce or increase those a lot of it's trial and error but if you look at our chart on my recipes calm you can find just the amount that you need another trick when you've made your batter let it sit for about 15 minutes before you bake it this lets any of the leavening gases release so they don't overflow one more quick tip for you only fill your pans about half way full this gives the food plenty of room to rise and Amy that may help you with those dumb cupcakes you're talking about good luck baking and will talk to you soon"}, {"title": "How to Bake a Cake", "id": "COsx-otwRDM", "url": "https://www.youtube.com/embed/COsx-otwRDM?showinfo=0", "uploader": "wikiHow", "views": 4294, "duration": 119, "description": "Learn How to Bake a Cake with this guide from wikiHow: https://www.wikihow.com/Bake-a-Cake\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "COsx-otwRDM.mp4", "subtitles": ""}, {"title": "How to Bake Boneless Skinless Chicken", "id": "T4mWDPyxbfA", "url": "https://www.youtube.com/embed/T4mWDPyxbfA?showinfo=0", "uploader": "wikiHow", "views": 1560, "duration": 41, "description": "This quick video will give you some tips on how to bake boneless skinless chicken!\n\nRead more: https://www.wikihow.com/Bake-Boneless-Skinless-Chicken\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "T4mWDPyxbfA.mp4", "subtitles": ""}, {"title": "How to Bake Salmon", "id": "wIFgme2w6Lw", "url": "https://www.youtube.com/embed/wIFgme2w6Lw?showinfo=0", "uploader": "wikiHow", "views": 193, "duration": 70, "description": "Learn How to Bake Salmon with this guide from wikiHow: https://www.wikihow.com/Bake-Salmon\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "wIFgme2w6Lw.mp4", "subtitles": "tex men prefer ittex men prefer it tex men prefer it2 wounded king c duty pooyo on the route to2 wounded king c duty pooyo on the route to 2 wounded king c duty pooyo on the route toto peter okto peter ok  I can't put it off I can't put it off as i woke up Gangnam n to thoseI can't put it off I can't put it off as i woke up Gangnam n to those I can't put it off I can't put it off as i woke up Gangnam n to thosefrom n ffrom n f from n fcoro ka What can John do today? order to town to socoro ka What can John do today? order to town to so coro ka What can John do today? order to town to solen len without jake so enters sex crimeslen len without jake so enters sex crimes len len without jake so enters sex crimesoq sickoq sick oq sickstall fet adol nen ford's mexican love amenstall fet adol nen ford's mexican love amen stall fet adol nen ford's mexican love amenagain may background"}, {"title": "How to Blanch Almonds", "id": "UH7duEWNREQ", "url": "https://www.youtube.com/embed/UH7duEWNREQ?showinfo=0", "uploader": "wikiHow", "views": 227, "duration": 40, "description": "Learn how to blanch almonds with this guide from wikiHow: https://www.wikihow.com/Blanch-Almonds\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "UH7duEWNREQ.mp4", "subtitles": "to blanch almonds first bring a pot of water to a boil put the almonds in a heat safe Bowl while the water is heating up then pour the boiling water into the bowl so the almonds are covered and let the almonds sit for one minute the hot water will soften the almonds outer skin strain the almonds and rinse them with cold water finally use your fingers to pinch the almonds one at a time so they slip out of their papery skinsto blanch almonds first bring a pot of water to a boil put the almonds in a heat safe Bowl while the water is heating up then pour the boiling water into the bowl so the almonds are covered and let the almonds sit for one minute the hot water will soften the almonds outer skin strain the almonds and rinse them with cold water finally use your fingers to pinch the almonds one at a time so they slip out of their papery skins"}, {"title": "How to Blanch Green Beans", "id": "h5Ld-J0snYM", "url": "https://www.youtube.com/embed/h5Ld-J0snYM?showinfo=0", "uploader": "wikiHow", "views": 575, "duration": 40, "description": "This quick video will teach you #howto blanch green beans!\n\nRead more: https://www.wikihow.com/Blanch-Green-Beans\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "h5Ld-J0snYM.mp4", "subtitles": "before you blanch green beans rinse them thoroughly and snap the ends off of each bean bring a pot of heavily salted water to a rolling boil fill a bowl full of ice water place your green beans into the boiling water a few at a time letting each batch sit for about two minutes use tongs to carefully scoop the beans out of the boiling water immediately immerse them in the bowl of ice water leave the beans in the ice water until they have completely cooled then wrap them in a paper towel until you are ready to serve thembefore you blanch green beans rinse them thoroughly and snap the ends off of each bean bring a pot of heavily salted water to a rolling boil fill a bowl full of ice water place your green beans into the boiling water a few at a time letting each batch sit for about two minutes use tongs to carefully scoop the beans out of the boiling water immediately immerse them in the bowl of ice water leave the beans in the ice water until they have completely cooled then wrap them in a paper towel until you are ready to serve them"}, {"title": "How to Blanch Potatoes", "id": "kVieMSQ4pRY", "url": "https://www.youtube.com/embed/kVieMSQ4pRY?showinfo=0", "uploader": "wikiHow", "views": 8235, "duration": 55, "description": "Learn how to blanch potatoes with this guide from wikiHow: https://www.wikihow.com/Blanch-Potatoes\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "kVieMSQ4pRY.mp4", "subtitles": "to blanch potatoes first peel the potatoes if you prefer them skinless then cut the potatoes into equal sized pieces and wash them under running water to remove the starch fill a pot with room temperature water and add the potatoes bring the water to a simmer over high heat then lower the heat so the water is barely simmering blanch the potatoes for around 12 minutes or until they're soft on the outside but still hard on the inside next transfer the potatoes to a bowl of ice water and let them sit until they're cool to the touch finally strain the potatoes in a colander and pat them dry with a dish towel you can store your blanched potatoes in an airtight container or bag in the freezer for up to three monthsto blanch potatoes first peel the potatoes if you prefer them skinless then cut the potatoes into equal sized pieces and wash them under running water to remove the starch fill a pot with room temperature water and add the potatoes bring the water to a simmer over high heat then lower the heat so the water is barely simmering blanch the potatoes for around 12 minutes or until they're soft on the outside but still hard on the inside next transfer the potatoes to a bowl of ice water and let them sit until they're cool to the touch finally strain the potatoes in a colander and pat them dry with a dish towel you can store your blanched potatoes in an airtight container or bag in the freezer for up to three months to blanch potatoes first peel the potatoes if you prefer them skinless then cut the potatoes into equal sized pieces and wash them under running water to remove the starch fill a pot with room temperature water and add the potatoes bring the water to a simmer over high heat then lower the heat so the water is barely simmering blanch the potatoes for around 12 minutes or until they're soft on the outside but still hard on the inside next transfer the potatoes to a bowl of ice water and let them sit until they're cool to the touch finally strain the potatoes in a colander and pat them dry with a dish towel you can store your blanched potatoes in an airtight container or bag in the freezer for up to three months"}, {"title": "How to Blanch Tomatoes", "id": "z089_JuMY20", "url": "https://www.youtube.com/embed/z089_JuMY20", "uploader": "Guidecentral English", "views": 113, "duration": 27, "description": "Learn how to blanch tomatoes with this guide from wikiHow: https://www.wikihow.com/Blanch-Tomatoes\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "z089_JuMY20.mp4", "subtitles": "to blanch Tomatoes start by trimming off the stems and cutting a small X into the bottom of each tomato then put the tomatoes in a pot of boiling water and let them cook for 30 seconds after 30 seconds use tongs to transfer the tomatoes into a bowl of ice water so they stop cooking once the tomatoes are cool peel them using a knife or your fingers and then you're finishedto blanch Tomatoes start by trimming off the stems and cutting a small X into the bottom of each tomato then put the tomatoes in a pot of boiling water and let them cook for 30 seconds after 30 seconds use tongs to transfer the tomatoes into a bowl of ice water so they stop cooking once the tomatoes are cool peel them using a knife or your fingers and then you're finished"}, {"title": "How to Blend Oil Pastels", "id": "j-l_Ai4-hWc", "url": "https://www.youtube.com/embed/j-l_Ai4-hWc?showinfo=0", "uploader": "wikiHow", "views": 730, "duration": 52, "description": "Learn how to blend oil pastels with this guide from wikiHow: https://www.wikihow.com/Blend-Oil-Pastels\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "j-l_Ai4-hWc.mp4", "subtitles": "to blend oil pastels start by applying the first color you want to blend to your piece of paper then apply the second color you want to blend next to it use the pad of your finger to rub the colors into each other alternatively you can use a tortilla on or color shaper to blend oil pastels for a more advanced technique try cross hatching by drawing parallel lines with your first color then layering another set of parallel lines on top that are perpendicular to the first set you can also use the scumbling method where you scribble multiple colors on top of each other to blend them togetherto blend oil pastels start by applying the first color you want to blend to your piece of paper then apply the second color you want to blend next to it use the pad of your finger to rub the colors into each other alternatively you can use a tortilla on or color shaper to blend oil pastels for a more advanced technique try cross hatching by drawing parallel lines with your first color then layering another set of parallel lines on top that are perpendicular to the first set you can also use the scumbling method where you scribble multiple colors on top of each other to blend them together"}, {"title": "How to Bloom Gelatin - Tutorial Video", "id": "xNnOSy2V31o", "url": "https://www.youtube.com/embed/xNnOSy2V31o", "uploader": "Marx Foods", "views": 107899, "duration": 34, "description": "How to bloom gelatin for use in all sorts of pastry applications - this technique is suitable for granulated gelatin or gelatin sheets.\n\nMore info about blooming gelatin: http://www.askmarxfoods.com/what-is-blooming-gelatin/\n\nSteps:\n1. Sprinkle or submerge gelatin in cold water.\n2. Stir until the gelatin is completely covered.\n3. Let sit until the gelatin has swelled.\n4. Optional: (depending on recipe) - strain or press out residual water.", "hosted_mp4": "xNnOSy2V31o.mp4", "subtitles": ""}, {"title": "How to Boil a Hot Dog", "id": "1SQP7fltbG4", "url": "https://www.youtube.com/embed/1SQP7fltbG4?showinfo=0", "uploader": "wikiHow", "views": 575, "duration": 56, "description": "Learn how to boil a hot dog with this guide from wikiHow: https://www.wikihow.com/Boil-a-Hot-Dog\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "1SQP7fltbG4.mp4", "subtitles": ""}, {"title": "How to Boil Beets", "id": "GANHpP3PM2I", "url": "https://www.youtube.com/embed/GANHpP3PM2I", "uploader": "wikiHow", "views": 55219, "duration": 60, "description": "Learn how to boil beets with this guide from wikiHow: https://www.wikihow.com/Boil-Beets\n\n0:00 Cleaning and Trimming\n0:20 Cooking\n0:40 Peeling\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "GANHpP3PM2I.mp4", "subtitles": ""}]