[{"title": "How to Rinse Rice", "id": "vTpy9SGgbSM", "url": "https://www.youtube.com/embed/vTpy9SGgbSM", "uploader": "Guidecentral English", "views": 615, "duration": 25, "description": "Learn how to rinse rice with this guide from wikiHow: https://www.wikihow.com/Rinse-Rice\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "vTpy9SGgbSM.mp4", "subtitles": "to rinse rice start by pouring it into a large bowl then fill the bowl with enough water to completely cover the rice once you've added the water stir the rice around with your hands to help get the starch off pour the cloudy water down a drain while holding the rice back with your hand so it doesn't pour out of the bowl repeat the process until the water no longer gets cloudy when you stir the rice around in itto rinse rice start by pouring it into a large bowl then fill the bowl with enough water to completely cover the rice once you've added the water stir the rice around with your hands to help get the starch off pour the cloudy water down a drain while holding the rice back with your hand so it doesn't pour out of the bowl repeat the process until the water no longer gets cloudy when you stir the rice around in it"}, {"title": "How to Ripen an Avocado", "id": "qBXyJxVPZXI", "url": "https://www.youtube.com/embed/qBXyJxVPZXI?showinfo=0", "uploader": "wikiHow", "views": 315, "duration": 35, "description": "This quick video will give you some tips on how to ripen an avocado!\n\nRead more: https://www.wikihow.com/Ripen-an-Avocado\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "qBXyJxVPZXI.mp4", "subtitles": ""}, {"title": "How to Ripen Peaches", "id": "41Lf94AyhzE", "url": "https://www.youtube.com/embed/41Lf94AyhzE", "uploader": "Guidecentral English", "views": 1884, "duration": 23, "description": "Learn how to ripen peaches with this guide from wikiHow: https://www.wikihow.com/Ripen-Peaches\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "41Lf94AyhzE.mp4", "subtitles": "to ripen peaches quickly store them in a brown paper bag which will trap the ethylene gas that causes the fruit to ripen to ripen the peaches even faster put a banana or apple in the bag with them so there's more ethylene gas being emitted if you don't have a brown paper bag try wrapping the peaches in a linen napkin or dishcloth which will also speed up the ripening processto ripen peaches quickly store them in a brown paper bag which will trap the ethylene gas that causes the fruit to ripen to ripen the peaches even faster put a banana or apple in the bag with them so there's more ethylene gas being emitted if you don't have a brown paper bag try wrapping the peaches in a linen napkin or dishcloth which will also speed up the ripening process"}, {"title": "How to Roast Asparagus", "id": "qzt9HNqSj9Q", "url": "https://www.youtube.com/embed/qzt9HNqSj9Q", "uploader": "Guidecentral English", "views": 40, "duration": 34, "description": "Learn how to roast asparagus with this guide from wikiHow: https://www.wikihow.com/Roast-Asparagus\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "qzt9HNqSj9Q.mp4", "subtitles": "to roast asparagus start by cutting off the woody ends of the asparagus with a knife then spread the asparagus in an even layer on a baking sheet lined with aluminum foil once you've done that drizzle some olive oil over the asparagus and season them with salt and pepper finally roast the asparagus in the oven for 8 to 10 minutes at 450 degrees fahrenheit flipping them over with a fork halfway through so they roast evenly for more tips including how to garnish your roasted asparagus read onto roast asparagus start by cutting off the woody ends of the asparagus with a knife then spread the asparagus in an even layer on a baking sheet lined with aluminum foil once you've done that drizzle some olive oil over the asparagus and season them with salt and pepper finally roast the asparagus in the oven for 8 to 10 minutes at 450 degrees fahrenheit flipping them over with a fork halfway through so they roast evenly for more tips including how to garnish your roasted asparagus read on"}, {"title": "How to Roast Garlic", "id": "M7G2djLMsU0", "url": "https://www.youtube.com/embed/M7G2djLMsU0?showinfo=0", "uploader": "wikiHow", "views": 253, "duration": 63, "description": "Learn how to roast garlic  with this guide from wikiHow: https://www.wikihow.com/Roast-Garlic \n\n0:00 Making Roasted Garlic in the Oven\n0:40 Making Roasted Garlic on the Stove\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "M7G2djLMsU0.mp4", "subtitles": "[Music]"}, {"title": "How to Roast Parsnips", "id": "ycANlnsl2QE", "url": "https://www.youtube.com/embed/ycANlnsl2QE?showinfo=0", "uploader": "wikiHow", "views": 664, "duration": 67, "description": "Learn how to roast parsnips with this guide from wikiHow: https://www.wikihow.com/Roast-Parsnips\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "ycANlnsl2QE.mp4", "subtitles": "to roast parsnips first pre-heat your oven to 425 degrees Fahrenheit 220 degrees Celsius then peel 2 pounds one kilogram of parsnips and cut them into 2-inch 5 centimeter pieces spread the pieces out in a single layer on two baking sheets and drizzle 2 tablespoons 30 milliliters of olive oil over them season with salt pepper and your favorite seasonings like oregano thyme and red pepper flakes finally toss the parsnips so they're evenly coated then cook them in the oven for 30 minutes you'll know they're done when a knife easily pierces themto roast parsnips first pre-heat your oven to 425 degrees Fahrenheit 220 degrees Celsius then peel 2 pounds one kilogram of parsnips and cut them into 2-inch 5 centimeter pieces spread the pieces out in a single layer on two baking sheets and drizzle 2 tablespoons 30 milliliters of olive oil over them season with salt pepper and your favorite seasonings like oregano thyme and red pepper flakes finally toss the parsnips so they're evenly coated then cook them in the oven for 30 minutes you'll know they're done when a knife easily pierces them"}, {"title": "How to Roast Vegetables", "id": "6eKErP8bVls", "url": "https://www.youtube.com/embed/6eKErP8bVls", "uploader": "Guidecentral English", "views": 100, "duration": 39, "description": "Learn how to roast vegetables with this guide from wikiHow: https://www.wikihow.com/Roast-Vegetables\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "6eKErP8bVls.mp4", "subtitles": "to roast vegetables start by cutting them into evenly sized pieces then toss the vegetables with oil and spread them out on a pan lined with aluminum foil once the vegetables are spread out in an even layer roast them in the oven at 400 degrees fahrenheit for 15 to 60 minutes depending on the kind of vegetables you're roasting tough vegetables like carrots and parsnips generally take longer to roast than softer vegetables like zucchini and eggplant after they're done roasting take the vegetables out of the oven and serve for more tips including how to season your veggies for the best flavor read onto roast vegetables start by cutting them into evenly sized pieces then toss the vegetables with oil and spread them out on a pan lined with aluminum foil once the vegetables are spread out in an even layer roast them in the oven at 400 degrees fahrenheit for 15 to 60 minutes depending on the kind of vegetables you're roasting tough vegetables like carrots and parsnips generally take longer to roast than softer vegetables like zucchini and eggplant after they're done roasting take the vegetables out of the oven and serve for more tips including how to season your veggies for the best flavor read on"}, {"title": "How to Roll Out Pasta Dough by Hand", "id": "9_05wYW7eUg", "url": "https://www.youtube.com/embed/9_05wYW7eUg?showinfo=0", "uploader": "wikiHow", "views": 357, "duration": 80, "description": "Learn how to roll out pasta dough by hand with this guide from wikiHow: https://www.wikihow.com/Roll-Out-Pasta-Dough-by-Hand\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "9_05wYW7eUg.mp4", "subtitles": ""}, {"title": "How to Serve Champagne", "id": "4AbAhiQlGmE", "url": "https://www.youtube.com/embed/4AbAhiQlGmE", "uploader": "Guidecentral English", "views": 106, "duration": 40, "description": "Learn how to serve champagne with this guide from wikiHow: https://www.wikihow.com/Serve-Champagne\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "4AbAhiQlGmE.mp4", "subtitles": "to serve champagne first chill it in an ice bucket for 15 to 20 minutes or in a refrigerator for 4 hours you can gently pop the cork by loosening the wire cage holding the cork firmly and slowly rotating the bottle to pour pull the bottle at the base with your fingers around the body and pour down the side of the champagne flute drop a strawberry inside to add a settled fruity flavour to store your champagne when you're not drinking it place it in a cool place like a basement to keep it between 40 and 60 degrees Fahrenheitto serve champagne first chill it in an ice bucket for 15 to 20 minutes or in a refrigerator for 4 hours you can gently pop the cork by loosening the wire cage holding the cork firmly and slowly rotating the bottle to pour pull the bottle at the base with your fingers around the body and pour down the side of the champagne flute drop a strawberry inside to add a settled fruity flavour to store your champagne when you're not drinking it place it in a cool place like a basement to keep it between 40 and 60 degrees Fahrenheit"}, {"title": "How to Sharpen a Knife", "id": "sd5V58-454k", "url": "https://www.youtube.com/embed/sd5V58-454k?showinfo=0", "uploader": "wikiHow", "views": 1082, "duration": 37, "description": "This quick video will give you some tips on how to sharpen a knife!\n\nRead more: https://www.wikihow.com/Sharpen-a-Knife\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "sd5V58-454k.mp4", "subtitles": ""}, {"title": "How to Shred Lettuce", "id": "z0oJBqAxlDU", "url": "https://www.youtube.com/embed/z0oJBqAxlDU", "uploader": "Guidecentral English", "views": 150, "duration": 31, "description": "Learn how to shred lettuce with this guide from wikiHow: https://www.wikihow.com/Shred-Lettuce\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "z0oJBqAxlDU.mp4", "subtitles": "to easily shred lettuce into thin strips first cut off the tip of the lettuce head with the knife cut the head in half then in quarters place a quarter on the cutting board with its cut edges facing up and cut it with a sawing motion into small fourth inch wide strips to shred with a food processor cut the stock from the lettuce head and tear off the leaves set your food processor speed to slow and feed the leaves into the food processor in small stacks to shred youto easily shred lettuce into thin strips first cut off the tip of the lettuce head with the knife cut the head in half then in quarters place a quarter on the cutting board with its cut edges facing up and cut it with a sawing motion into small fourth inch wide strips to shred with a food processor cut the stock from the lettuce head and tear off the leaves set your food processor speed to slow and feed the leaves into the food processor in small stacks to shred you"}, {"title": "How to Skim Fat Off Soup", "id": "FDxILoJElMo", "url": "https://www.youtube.com/embed/FDxILoJElMo?showinfo=0", "uploader": "wikiHow", "views": 10804, "duration": 77, "description": "Learn how to skim fat off soup with this guide from wikiHow: https://www.wikihow.com/Skim-Fat-Off-Soup\n\n0:00 Skimming Fat from Simmering Soup\n0:30 Straining Warm Broth\n1:00 Removing Fat from Chilled Soup\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "FDxILoJElMo.mp4", "subtitles": ""}, {"title": "How to Smoke a Brisket", "id": "rY6dVix7WkA", "url": "https://www.youtube.com/embed/rY6dVix7WkA", "uploader": "Guidecentral English", "views": 152, "duration": 38, "description": "Learn how to smoke a brisket with this guide from wikiHow: https://www.wikihow.com/Smoke-a-Brisket\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "rY6dVix7WkA.mp4", "subtitles": ""}, {"title": "How to Soften Cream Cheese", "id": "xThP3JE33yI", "url": "https://www.youtube.com/embed/xThP3JE33yI?showinfo=0", "uploader": "wikiHow", "views": 4168, "duration": 23, "description": "This quick video will teach you #howto properly soften cream cheese!\n\nRead more: https://www.wikihow.com/Soften-Cream-Cheese\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "xThP3JE33yI.mp4", "subtitles": "to soften cream cheese put it in a microwave-safe bowl and microwave it for 15 to 20 seconds if you don't have a microwave put the container of cream cheese in a bowl of lukewarm water for 10 minutes to soften it you could also try mixing milk or melted butter into the cream cheese to make it softerto soften cream cheese put it in a microwave-safe bowl and microwave it for 15 to 20 seconds if you don't have a microwave put the container of cream cheese in a bowl of lukewarm water for 10 minutes to soften it you could also try mixing milk or melted butter into the cream cheese to make it softer"}, {"title": "How to Soften Hard Brown Sugar", "id": "R0qkRne1_jQ", "url": "https://www.youtube.com/embed/R0qkRne1_jQ?showinfo=0", "uploader": "wikiHow", "views": 6008, "duration": 29, "description": "This quick video will give you some tips on #howto soften hard brown sugar!\n\nRead more: https://www.wikihow.com/Soften-Hard-Brown-Sugar\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "R0qkRne1_jQ.mp4", "subtitles": "if you need to soften hard brown sugar place it into a resealable plastic bag with a slice of soft bread or an apple slice seal the bag well leave the bag closed for several hours then open the bag and remove the bread or Apple the sugar should be soft if you need a quicker solution place the sugar in a microwave-safe bowl and microwave it for about 10 secondsif you need to soften hard brown sugar place it into a resealable plastic bag with a slice of soft bread or an apple slice seal the bag well leave the bag closed for several hours then open the bag and remove the bread or Apple the sugar should be soft if you need a quicker solution place the sugar in a microwave-safe bowl and microwave it for about 10 seconds"}, {"title": "How to Soften Honey", "id": "16OhVDSWMqM", "url": "https://www.youtube.com/embed/16OhVDSWMqM", "uploader": "Guidecentral English", "views": 247, "duration": 35, "description": "Learn how to soften honey with this guide from wikiHow: https://www.wikihow.com/Soften-Honey\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "16OhVDSWMqM.mp4", "subtitles": "on the slide honey Asli fitness centeron the slide honey Asli fitness center on the slide honey Asli fitness centerand he just whereand he just where and he just wheremaybe you firstmaybe you first maybe you firstfans Indonesia label Empowerfans Indonesia label Empower fans Indonesia label Empower[Musik][Musik] [Musik]NetworkNetwork Networkmake olshop pleasemake olshop please make olshop pleaseIndonesian Edwards  flyingflying flyingget one after another range betweenget one after another range between get one after another range betweenIndonesia"}, {"title": "How to Steam Vegetables", "id": "R-QBlNYpl6c", "url": "https://www.youtube.com/embed/R-QBlNYpl6c?showinfo=0", "uploader": "wikiHow", "views": 619, "duration": 40, "description": "This quick video will give you some tips on #howto steam vegetables!\n\nRead more: https://www.wikihow.com/Steam-Vegetables\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "R-QBlNYpl6c.mp4", "subtitles": "if you want to steam vegetables on the stove first bring two cups of water to a boil in a pot if you have a steamer basket or heat-safe colander then place the vegetables in the basket and close the lid allow the steam to cook the vegetables for a few minutes testing them periodically with a fork for doneness if you don't have a basket or a colander place your vegetables in the pot and add an inch or two of water then put the lid on so the steam can build up and soften the vegetables enjoyif you want to steam vegetables on the stove first bring two cups of water to a boil in a pot if you have a steamer basket or heat-safe colander then place the vegetables in the basket and close the lid allow the steam to cook the vegetables for a few minutes testing them periodically with a fork for doneness if you don't have a basket or a colander place your vegetables in the pot and add an inch or two of water then put the lid on so the steam can build up and soften the vegetables enjoy"}, {"title": "How to Stir Fry", "id": "xgGdfggLihs", "url": "https://www.youtube.com/embed/xgGdfggLihs", "uploader": "Guidecentral English", "views": 221, "duration": 35, "description": "Learn how to stir fry with this guide from wikiHow: https://www.wikihow.com/Stir-Fry\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "xgGdfggLihs.mp4", "subtitles": "to make a stir fry start by heating a wok or pan over a stove top until it sizzles when you splash it with water then add a little oil to the pan and some seasonings like salt pepper and ginger if you want meat in your stir fry add it to the pan and cook it for 5 minutes next add vegetables like broccoli snow peas and carrots and let them cook for a few minutes finish your stir fry by mixing in a sauce like soy sauce and letting it cook for 3-4 minutesto make a stir fry start by heating a wok or pan over a stove top until it sizzles when you splash it with water then add a little oil to the pan and some seasonings like salt pepper and ginger if you want meat in your stir fry add it to the pan and cook it for 5 minutes next add vegetables like broccoli snow peas and carrots and let them cook for a few minutes finish your stir fry by mixing in a sauce like soy sauce and letting it cook for 3-4 minutes"}, {"title": "How to Store Apples", "id": "23yM30uH-Wo", "url": "https://www.youtube.com/embed/23yM30uH-Wo?showinfo=0", "uploader": "wikiHow", "views": 15446, "duration": 42, "description": "This quick video will give you some tips on #howto properly store apples!\n\nRead more: https://www.wikihow.com/Store-Apples\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "23yM30uH-Wo.mp4", "subtitles": "if you want to store apples for a few weeks put them in the fridge in an uncovered plastic container you can also place a damp paper towel over the apples which will help them last longer because of the moisture if you want to store apples for several months start by wrapping each apple individually with newspaper then line a resealable plastic container with more newspapers so it's insulated set the wrapped apples inside store the container in a cold spot like a root cellar or a basementif you want to store apples for a few weeks put them in the fridge in an uncovered plastic container you can also place a damp paper towel over the apples which will help them last longer because of the moisture if you want to store apples for several months start by wrapping each apple individually with newspaper then line a resealable plastic container with more newspapers so it's insulated set the wrapped apples inside store the container in a cold spot like a root cellar or a basement"}, {"title": "How to Store Avocado", "id": "vBzEe9F1aPc", "url": "https://www.youtube.com/embed/vBzEe9F1aPc?showinfo=0", "uploader": "wikiHow", "views": 183, "duration": 38, "description": "Learn How to Store Avocado with this guide from wikiHow: https://www.wikihow.com/Store-Avocado\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "vBzEe9F1aPc.mp4", "subtitles": "if you want to store an unripe avocado place it in a brown paper bag to speed up the ripening process leave the bag at room temperature but out of direct sunlight and check it daily alternatively you can ripen an avocado even faster by placing an apple or banana in the back if you want to store a cut avocado leave the pit in then brush the rest of the avocado with lemon or lime juice to preserve its green color tightly cover the avocado with plastic wrap and place it in the refrigerator for up to three daysif you want to store an unripe avocado place it in a brown paper bag to speed up the ripening process leave the bag at room temperature but out of direct sunlight and check it daily alternatively you can ripen an avocado even faster by placing an apple or banana in the back if you want to store a cut avocado leave the pit in then brush the rest of the avocado with lemon or lime juice to preserve its green color tightly cover the avocado with plastic wrap and place it in the refrigerator for up to three days"}]