[{"title": "How to Freeze Cherries", "id": "TfT3DeTRdOs", "url": "https://www.youtube.com/embed/TfT3DeTRdOs?showinfo=0", "uploader": "wikiHow", "views": 4823, "duration": 79, "description": "Learn how to freeze cherries with this guide from wikiHow: https://www.wikihow.com/Freeze-Cherries\n\n0:00 Storing in Bags \n0:24 Preserving in Syrup\n0:53 Storing with Sugar \n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "TfT3DeTRdOs.mp4", "subtitles": "ah ahah ah ah ahyeah yeahyeah yeah yeah yeah[music]  [music]"}, {"title": "How to Freeze Green Peppers", "id": "ZpEwMR3TTrc", "url": "https://www.youtube.com/embed/ZpEwMR3TTrc", "uploader": "Guidecentral English", "views": 644, "duration": 32, "description": "Learn how to freeze green peppers with this guide from wikiHow: https://www.wikihow.com/Freeze-Green-Peppers\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "ZpEwMR3TTrc.mp4", "subtitles": "to freeze green peppers bring a pot of water to a boil as you rinse and cut the peppers to the desired size then place the peppers in the boiling water for two to three minutes before transferring the slices to an ice bath once the peppers have cooled drain the ice bath and spread the slices out on a baking sheet place the sheet in the freezer until the peppers are frozen solid and transfer them to a freezer bag or airtight plastic container be sure to label the bag with the date before freezing you can use the peppers for 9-14 months before freezing a new batchto freeze green peppers bring a pot of water to a boil as you rinse and cut the peppers to the desired size then place the peppers in the boiling water for two to three minutes before transferring the slices to an ice bath once the peppers have cooled drain the ice bath and spread the slices out on a baking sheet place the sheet in the freezer until the peppers are frozen solid and transfer them to a freezer bag or airtight plastic container be sure to label the bag with the date before freezing you can use the peppers for 9-14 months before freezing a new batch"}, {"title": "How to Freeze Mushrooms", "id": "rzYrMhwmLKM", "url": "https://www.youtube.com/embed/rzYrMhwmLKM?showinfo=0", "uploader": "wikiHow", "views": 6009, "duration": 131, "description": "Learn how to freeze mushrooms with this guide from wikiHow: https://www.wikihow.com/Freeze-Mushrooms\n\n0:00 Blanching Mushrooms for Freezing\n0:35 Steaming Mushrooms for Freezing\n1:24 Sautéing Mushrooms for Freezing\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "rzYrMhwmLKM.mp4", "subtitles": "[Music] you"}, {"title": "How to Freeze Parsley", "id": "dghyZ-oMZwE", "url": "https://www.youtube.com/embed/dghyZ-oMZwE", "uploader": "Guidecentral English", "views": 2024, "duration": 36, "description": "Learn how to freeze parsley with this guide from wikiHow: https://www.wikihow.com/Freeze-Parsley\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "dghyZ-oMZwE.mp4", "subtitles": "before you freeze parsley rinse it in cold water pat it dry with paper towel and take the leaves off the stems then roll the leaves into a ball in your hand and pack them tightly in a plastic freezer bag before you throw the bag in the freezer when you need some parsley just scrape the side of your frozen parsley ball with a knife alternatively stack the leaves in the cubes of an ice cube tray put enough water in the tray to cover the leaves and freeze the tray you can then pop out a cube when you want some parsley to learn how to freeze parsley pesto keep readingbefore you freeze parsley rinse it in cold water pat it dry with paper towel and take the leaves off the stems then roll the leaves into a ball in your hand and pack them tightly in a plastic freezer bag before you throw the bag in the freezer when you need some parsley just scrape the side of your frozen parsley ball with a knife alternatively stack the leaves in the cubes of an ice cube tray put enough water in the tray to cover the leaves and freeze the tray you can then pop out a cube when you want some parsley to learn how to freeze parsley pesto keep reading"}, {"title": "How to Get Rid of Weevils %28Flour Bugs%29", "id": "JV319VsAeMU", "url": "https://www.youtube.com/embed/JV319VsAeMU?showinfo=0", "uploader": "wikiHow", "views": 3157, "duration": 67, "description": "Learn how to get rid of weevils %28flour bugs%29 with this guide from wikiHow: https://www.wikihow.com/Get-Rid-of-Weevils-%28Flour-Bugs%29\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "JV319VsAeMU.mp4", "subtitles": ""}, {"title": "How to Get Cans in the Fridge Faster", "id": "XvVrEo4uE0M", "url": "https://www.youtube.com/embed/XvVrEo4uE0M?showinfo=0", "uploader": "wikiHow", "views": 61, "duration": 30, "description": "Learn how to get cans in the fridge faster with this guide from wikiHow: https://www.wikihow.com/Get-Cans-in-the-Fridge-Faster\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "XvVrEo4uE0M.mp4", "subtitles": ""}, {"title": "How to Get More Juice out of a Lemon", "id": "RYRrEBcTuHs", "url": "https://www.youtube.com/embed/RYRrEBcTuHs?showinfo=0", "uploader": "wikiHow", "views": 279, "duration": 44, "description": "Learn how to get more juice out of a lemon with this guide from wikiHow: https://www.wikihow.com/Get-More-Juice-out-of-a-Lemon\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "RYRrEBcTuHs.mp4", "subtitles": "yeah yeah  [music]"}, {"title": "How to Grill Chicken", "id": "Bnt_bV7ePlU", "url": "https://www.youtube.com/embed/Bnt_bV7ePlU?showinfo=0", "uploader": "wikiHow", "views": 201, "duration": 75, "description": "Learn how to grill chicken with this guide from wikiHow: https://www.wikihow.com/Grill-Chicken\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "Bnt_bV7ePlU.mp4", "subtitles": "to grill chicken breasts first wrap them in plastic wrap and place them on a cutting board pound the chicken with the tenderizer until it's uniformly thick so it cooks evenly then season the chicken with salt pepper and your favorite seasonings like garlic powder cumin or chili powder brush olive oil over the grates on your grill using a paper towel then preheat the grill to medium set the chicken breasts directly on the heat and cook them for 8 to 12 minutes per side or until they're golden brown to grill chicken thighs season them as you would chicken breasts but preheat your grill to high heat place the thighs on the grill and cook them for six to eight minutes on each side or until the thighs are golden brown you can check the temperature of grilled chicken with an instant-read thermometer to see if it's done when the internal temperature is at least 165 degrees fahrenheit 74 degrees celsius it's ready to be servedto grill chicken breasts first wrap them in plastic wrap and place them on a cutting board pound the chicken with the tenderizer until it's uniformly thick so it cooks evenly then season the chicken with salt pepper and your favorite seasonings like garlic powder cumin or chili powder brush olive oil over the grates on your grill using a paper towel then preheat the grill to medium set the chicken breasts directly on the heat and cook them for 8 to 12 minutes per side or until they're golden brown to grill chicken thighs season them as you would chicken breasts but preheat your grill to high heat place the thighs on the grill and cook them for six to eight minutes on each side or until the thighs are golden brown you can check the temperature of grilled chicken with an instant-read thermometer to see if it's done when the internal temperature is at least 165 degrees fahrenheit 74 degrees celsius it's ready to be served"}, {"title": "How to Grill Fish", "id": "NbF9zRUpob4", "url": "https://www.youtube.com/embed/NbF9zRUpob4?showinfo=0", "uploader": "wikiHow", "views": 60, "duration": 87, "description": "Learn how to grill fish with this guide from wikiHow: https://www.wikihow.com/Grill-Fish\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "NbF9zRUpob4.mp4", "subtitles": "[Music] you[Music] you [Music] you"}, {"title": "How to Grow a Sunflower in a Pot", "id": "heSlq1prBzE", "url": "https://www.youtube.com/embed/heSlq1prBzE?showinfo=0", "uploader": "wikiHow", "views": 10081, "duration": 63, "description": "Learn how to grow a sunflower in a pot with this guide from wikiHow: https://www.wikihow.com/Grow-a-Sunflower-in-a-Pot\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "heSlq1prBzE.mp4", "subtitles": "to grow sunflowers in a pot first get some dwarf sunflower seeds dwarf sunflowers grow well in pots since they don't get over four feet 1.2 meters tall fill a 16 by 18 inch 40 by 45 centimeter pot with topsoil that has a ph between six and seven mix a handful of compost into the soil to help your sunflowers grow faster then push the seeds 1 inch 2.5 centimeters beneath the surface of the soil with at least 4 inches 10 centimeters between each seed place the pot in an indoor or outdoor spot that gets at least 6 hours of direct sunlight every day water the seeds every day to keep the soil moist your sunflowers should bloom in about 12 weeksto grow sunflowers in a pot first get some dwarf sunflower seeds dwarf sunflowers grow well in pots since they don't get over four feet 1.2 meters tall fill a 16 by 18 inch 40 by 45 centimeter pot with topsoil that has a ph between six and seven mix a handful of compost into the soil to help your sunflowers grow faster then push the seeds 1 inch 2.5 centimeters beneath the surface of the soil with at least 4 inches 10 centimeters between each seed place the pot in an indoor or outdoor spot that gets at least 6 hours of direct sunlight every day water the seeds every day to keep the soil moist your sunflowers should bloom in about 12 weeks"}, {"title": "How to Grow Garlic", "id": "OIAq_g9maD8", "url": "https://www.youtube.com/embed/OIAq_g9maD8?showinfo=0", "uploader": "wikiHow", "views": 5169, "duration": 76, "description": "Learn How to Grow Garlic with this guide from wikiHow: https://www.wikihow.com/Grow-Garlic\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "OIAq_g9maD8.mp4", "subtitles": ""}, {"title": "How to Grow Onions", "id": "mgoHMyFXBVY", "url": "https://www.youtube.com/embed/mgoHMyFXBVY?showinfo=0", "uploader": "wikiHow", "views": 420, "duration": 77, "description": "Learn how to grow onions with this guide from wikiHow: https://www.wikihow.com/Grow-Onions\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "mgoHMyFXBVY.mp4", "subtitles": ""}, {"title": "How to Hard Boil an Egg", "id": "KFSxL3aKpDw", "url": "https://www.youtube.com/embed/KFSxL3aKpDw?showinfo=0", "uploader": "wikiHow", "views": 1242, "duration": 43, "description": "If you're ending up with cracked eggs and green yolks when you try to make hard boiled eggs, you've come to the right place.\n\nLuckily, there are ways to GUARANTEE perfectly hard boiled eggs every time. Best of all, you can learn these easy processes in just a few minutes!\n\nRead more: https://www.wikihow.com/Hard-Boil-an-Egg\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "KFSxL3aKpDw.mp4", "subtitles": "to hard boil an egg place it in a pot and cover it with at least one inch of water and a pinch of salt fill a bowl with ice water and set it aside heat the pot on medium heat stirring the egg every few minutes when the water reaches a rolling boil use a slotted spoon to remove the egg from the pot and submerge it in the ice bath for a medium boiled egg remove the egg after 5 to 7 minutes for a hard-boiled egg remove it after 10 to 15 minutes to remove the shell roll the egg across a clean counter to crack it then peel the shell with your fingersto hard boil an egg place it in a pot and cover it with at least one inch of water and a pinch of salt fill a bowl with ice water and set it aside heat the pot on medium heat stirring the egg every few minutes when the water reaches a rolling boil use a slotted spoon to remove the egg from the pot and submerge it in the ice bath for a medium boiled egg remove the egg after 5 to 7 minutes for a hard-boiled egg remove it after 10 to 15 minutes to remove the shell roll the egg across a clean counter to crack it then peel the shell with your fingers"}, {"title": "How to Harvest Rhubarb", "id": "fl2cpc5wBn8", "url": "https://www.youtube.com/embed/fl2cpc5wBn8?showinfo=0", "uploader": "wikiHow", "views": 1035, "duration": 52, "description": "Learn how to harvest rhubarb with this guide from wikiHow: https://www.wikihow.com/Harvest-Rhubarb\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "fl2cpc5wBn8.mp4", "subtitles": "to harvest rhubarb wait at least one year after planting your rhubarb before harvesting it so it continues growing after you remove the stalks harvest your rhubarb in the summer or spring when the stalks are at least 10 inches 25 centimeters tall grab a stalk near the base of the plant and pull gently away from the plant while twisting the stalk the stalk will snap out of the base of the plant if you prefer you can also use shears to cut the stalk out then grab the base of the leaves where they meet the stock and pull them out by hand to remove them you can harvest multiple stalks at a time but be careful not to remove more than a third of the plant stalks if you want it to continue growingto harvest rhubarb wait at least one year after planting your rhubarb before harvesting it so it continues growing after you remove the stalks harvest your rhubarb in the summer or spring when the stalks are at least 10 inches 25 centimeters tall grab a stalk near the base of the plant and pull gently away from the plant while twisting the stalk the stalk will snap out of the base of the plant if you prefer you can also use shears to cut the stalk out then grab the base of the leaves where they meet the stock and pull them out by hand to remove them you can harvest multiple stalks at a time but be careful not to remove more than a third of the plant stalks if you want it to continue growing"}, {"title": "How to Harvest Romaine Lettuce", "id": "0LoKk1JGLzo", "url": "https://www.youtube.com/embed/0LoKk1JGLzo?showinfo=0", "uploader": "wikiHow", "views": 14513, "duration": 49, "description": "Learn how to harvest romaine lettuce with this guide from wikiHow: https://www.wikihow.com/Harvest-Romaine-Lettuce\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "0LoKk1JGLzo.mp4", "subtitles": ""}, {"title": "How to Harvest Spinach", "id": "owvImmgmvOw", "url": "https://www.youtube.com/embed/owvImmgmvOw?showinfo=0", "uploader": "wikiHow", "views": 845, "duration": 48, "description": "Learn how to harvest spinach with this guide from wikiHow: https://www.wikihow.com/Harvest-Spinach\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "owvImmgmvOw.mp4", "subtitles": ""}, {"title": "How to Harvest Sunflower Seeds", "id": "kyjVBa9jau8", "url": "https://www.youtube.com/embed/kyjVBa9jau8", "uploader": "Guidecentral English", "views": 2292, "duration": 36, "description": "Learn how to harvest sunflower seeds with this guide from wikiHow: https://www.wikihow.com/Harvest-Sunflower-Seeds\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "kyjVBa9jau8.mp4", "subtitles": "to harvest sunflower seeds let the flower dry on or off the stem until the back of the head turns brown then set the sunflower head on a flat clean surface and grab a bowl to hold the seeds to remove the seeds simply rub your hand over the seated area and pull them off the plant move the seeds to a colander and rinse them under cold running water to remove dirt and bacteria before roasting and eating them place your seeds on a towel and let them dry for a few hours for advice on drying sunflowers both on and off the stem read onto harvest sunflower seeds let the flower dry on or off the stem until the back of the head turns brown then set the sunflower head on a flat clean surface and grab a bowl to hold the seeds to remove the seeds simply rub your hand over the seated area and pull them off the plant move the seeds to a colander and rinse them under cold running water to remove dirt and bacteria before roasting and eating them place your seeds on a towel and let them dry for a few hours for advice on drying sunflowers both on and off the stem read on"}, {"title": "How to Juice a Lemon", "id": "GnBU5ZBtz3w", "url": "https://www.youtube.com/embed/GnBU5ZBtz3w?showinfo=0", "uploader": "wikiHow", "views": 295, "duration": 19, "description": "Learn How to Juice a Lemon with this guide from wikiHow: https://www.wikihow.com/Juice-a-Lemon\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "GnBU5ZBtz3w.mp4", "subtitles": ""}, {"title": "How to Juice a Lime", "id": "RwICm4RIqVI", "url": "https://www.youtube.com/embed/RwICm4RIqVI?showinfo=0", "uploader": "wikiHow", "views": 647, "duration": 48, "description": "Learn how to juice a lime with this guide from wikiHow: https://www.wikihow.com/Juice-a-Lime\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "RwICm4RIqVI.mp4", "subtitles": "to juice a lime first cut the lime into four pieces around the core then squeeze each piece over a bowl with your hands to get the juice out you can roll the lime against the counter before cutting and squeezing it to make it easier to squeeze you can microwave the lime for 20 seconds to loosen up the juice inside as well just make sure to let it cool for a minute before cutting it if you have a citrus squeezer cut the lime in half lengthwise then place the cut side of the lime facing down in the bowl of the squeezer hold the squeezer over a bowl and press the handles together to squeeze out the lime juiceto juice a lime first cut the lime into four pieces around the core then squeeze each piece over a bowl with your hands to get the juice out you can roll the lime against the counter before cutting and squeezing it to make it easier to squeeze you can microwave the lime for 20 seconds to loosen up the juice inside as well just make sure to let it cool for a minute before cutting it if you have a citrus squeezer cut the lime in half lengthwise then place the cut side of the lime facing down in the bowl of the squeezer hold the squeezer over a bowl and press the handles together to squeeze out the lime juice"}, {"title": "How to Julienne Carrots", "id": "htL8BBrf5U0", "url": "https://www.youtube.com/embed/htL8BBrf5U0?showinfo=0", "uploader": "wikiHow", "views": 412, "duration": 44, "description": "Learn How to Julienne Carrots with this guide from wikiHow: https://www.wikihow.com/Julienne-Carrots\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "htL8BBrf5U0.mp4", "subtitles": "to julienne a carrot first peel the carrot with a vegetable peeler or paring knife then cut the carrot crosswise into 2-inch 5 centimeter pieces cut a thin slice off of one side on each piece so they can lie flat repeat three more times on each piece to square them next cut the pieces lengthwise into slices that are 1/8 inch point three centimeters thick stack the slices on top of each other finally cut the stack slices lengthwise into 1/8 inch point three centimeters thick matchsticks be sure to practice knife safetyto julienne a carrot first peel the carrot with a vegetable peeler or paring knife then cut the carrot crosswise into 2-inch 5 centimeter pieces cut a thin slice off of one side on each piece so they can lie flat repeat three more times on each piece to square them next cut the pieces lengthwise into slices that are 1/8 inch point three centimeters thick stack the slices on top of each other finally cut the stack slices lengthwise into 1/8 inch point three centimeters thick matchsticks be sure to practice knife safety"}]