[{"title": "How to Grow Potatoes from Potatoes", "id": "vdXpe1e9E0s", "url": "https://www.youtube.com/embed/vdXpe1e9E0s?showinfo=0", "uploader": "wikiHow", "views": 2029, "duration": 58, "description": "Learn how to grow potatoes from potatoes with this guide from wikiHow: https://www.wikihow.com/Grow-Potatoes-from-Potatoes\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "vdXpe1e9E0s.mp4", "subtitles": ""}, {"title": "How do you grow tomatoes in pots? | wikiHow Asks a Plant Specialist", "id": "H1MWZD1QHdA", "url": "https://www.youtube.com/embed/H1MWZD1QHdA?showinfo=0", "uploader": "wikiHow", "views": 353, "duration": 86, "description": "Plant Specialist Monique Capanelli teaches you how to successfully grow tomatoes in pots. First, buy large pots for planting and cages to offer tender stalks a bit of extra support. Take your time preparing your pots and soil prior to planting and give your tomatoes plenty of sunlight and water.  Read more in this guide from wikiHow: https://www.wikihow.com/Grow-Tomatoes-in-Pots\n--- \nMonique Capanelli is a Plant Specialist and the Owner and Designer for Articulture Designs, an innovative design firm and boutique in Austin, Texas. With over 15 years of experience, Monique specializes in interior botanical design, living walls, event decor, and sustainable landscape design. She attended the University of Texas at Austin. Monique is a Certified Permaculture Designer. She provides plant and botanical design experiences, from small gifts to entire transformations, to shoppers as well as commercial clients including Whole Foods Market and The Four Seasons.\nLearn more: https://www.articulturedesigns.com/\n\n----\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "H1MWZD1QHdA.mp4", "subtitles": ""}, {"title": "How to Grow Truffles", "id": "eZ30YrPOs-4", "url": "https://www.youtube.com/embed/eZ30YrPOs-4?showinfo=0", "uploader": "wikiHow", "views": 20748, "duration": 49, "description": "Learn how to grow truffles with this guide from wikiHow: https://www.wikihow.com/Grow-Truffles\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "eZ30YrPOs-4.mp4", "subtitles": ""}, {"title": "How to Harvest Basil", "id": "KUPaSZKkYH4", "url": "https://www.youtube.com/embed/KUPaSZKkYH4?showinfo=0", "uploader": "wikiHow", "views": 2634, "duration": 61, "description": "Learn how to harvest basil with this guide from wikiHow: https://www.wikihow.com/Harvest-Basil\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "KUPaSZKkYH4.mp4", "subtitles": "contains special with interviews withcontains special with interviews with contains special with interviews withlyrics and she's talking santa meets alyrics and she's talking santa meets a lyrics and she's talking santa meets astorestore storei run for any number for wellness to usei run for any number for wellness to use i run for any number for wellness to usethe streets and recipes ithe streets and recipes i the streets and recipes ile qu duc miscarriage on the bestle qu duc miscarriage on the best le qu duc miscarriage on the bestchocolate content you supposechocolate content you suppose chocolate content you supposeif you can also stand iphone and appearif you can also stand iphone and appear if you can also stand iphone and appearwhen they subtract and solve youtubewhen they subtract and solve youtube when they subtract and solve youtubematemate matewhen missing to eat about master use of staff ofwhen missing to eat about master use of staff of when missing to eat about master use of staff ofthe worldthe world the worldmaster chemical vietnamese money tartrat ethephonmaster chemical vietnamese money tartrat ethephon master chemical vietnamese money tartrat ethephonplease custom westminster jane take overplease custom westminster jane take over please custom westminster jane take overenthalpy of staff to forceenthalpy of staff to force enthalpy of staff to forcei was afraid anymore come off akershusi was afraid anymore come off akershus i was afraid anymore come off akershuspurple out the flash mod pro 3 sviewpurple out the flash mod pro 3 sview purple out the flash mod pro 3 sviewflip ii"}, {"title": "Growing Lavender - Quick Way to Harvest Lavender", "id": "_JxDBSHceAw", "url": "https://www.youtube.com/embed/_JxDBSHceAw", "uploader": "Susan Harrington - Growing Lavender", "views": 884266, "duration": 59, "description": "Susan at https://www.labyrinthhill.com demonstrates a quick, efficient way to harvest lavender bundles. One of the keys to harvesting lavender efficiently is having all your supplies at hand. Susan teaches this and other tips -- like timing your harvest -- in her course, Lavender: From Soil to Sachet.\n\nSusan Harrington began growing lavender at Labyrinth Hill in 2002. Learn to grow lavender for fun and profit, even if you only have a small plot in your backyard. You can start right now with her free mini course: FREE Class— http://bit.ly/YT-free-mini-class\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n💜 💜 💜  Never miss a video about growing and using lavender. 💜 💜 💜 \n👇 SUBSCRIBE NOW 👇\nhttps://www.youtube.com/user/SusanHarrington?sub_confirmation=1\n\n💜 FEATURED IN THIS VIDEO 💜 \n*Harvest Sickle: https://amzn.to/2UbzxDi\n*Gardening Gloves: https://amzn.to/37HKG2O\n*Rubber Bands (size 33 works the best!) https://amzn.to/2UcDqbc\n\n*PLEASE NOTE: These links are affiliate links, where I will earn a small referral fee if you decide to make a purchase. This is at no additional cost to you. Please understand that I have purchased the products or used services from these companies. They are recommended resources because they have provided me with quality products and excellent customer service.\n\n💜 LET'S MEET UP! 💜 \nInstagram: https://www.instagram.com/labyrinthhill/\nFacebook: https://www.facebook.com/labyrinthhill\nTwitter: https://twitter.com/LabyrinthHill\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nLavender is the ancient herb of love and devotion. We've been in love with lavender since 2002!\n\nSusan Harrington, CEO*\n(*Chief Education Officer)\nLabyrinth Hill\nPO Box 448\nHansville WA 98340\nUSA\n\nFounding Member\nUS Lavender Growers Association\n\nExplore growing and using lavender at:\nhttps://www.labyrinthhill.com\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n#growinglavender #harvestlavender #labyrinthhill", "hosted_mp4": "_JxDBSHceAw.mp4", "subtitles": "when I start the fresh lavender harvestI begin by first of all wearinggloves and then counting out the numberof bundles that I want to harvest whileI'm at this plant. This way the rubberbands are easily accessible and theharvest goes very quickly. Begin bycutting in the center of the plant whereyour stems are their straightest. Gathera large group and use your hand to help.In one fell swoop you have a bundleof lavender. Grab the rubber band. Wrap ittwo to three times. And it's ready withabout 75 stems."}, {"title": "How to Heat Milk", "id": "fQvvdz4kWbc", "url": "https://www.youtube.com/embed/fQvvdz4kWbc", "uploader": "Guidecentral English", "views": 664, "duration": 38, "description": "Learn how to heat milk with this guide from wikiHow: https://www.wikihow.com/Heat-Milk\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "fQvvdz4kWbc.mp4", "subtitles": "to heat milk to a boil easily pour it into a microwave-safe container and heat it for about two and a half minutes stirring every 15 seconds so it doesn't scorch you can also pour the milk into a large deep pot and warm it over medium heat until it boils stir the milk every few minutes so it doesn't boil over and lower the heat when the milk starts to boil to avoid scorching it if you're heating milk for a baby pour the milk into a bottle then place the bottle into a pot of warm water until the milk has reached room temperatureto heat milk to a boil easily pour it into a microwave-safe container and heat it for about two and a half minutes stirring every 15 seconds so it doesn't scorch you can also pour the milk into a large deep pot and warm it over medium heat until it boils stir the milk every few minutes so it doesn't boil over and lower the heat when the milk starts to boil to avoid scorching it if you're heating milk for a baby pour the milk into a bottle then place the bottle into a pot of warm water until the milk has reached room temperature"}, {"title": "Hypnotizing a Chicken ~ ben t.", "id": "RF01CTJgAyk", "url": "https://www.youtube.com/embed/RF01CTJgAyk", "uploader": "bensok", "views": 307233, "duration": 34, "description": "How to hypnotize a chicken in Africa.", "hosted_mp4": "RF01CTJgAyk.mp4", "subtitles": ""}, {"title": "How to Keep a Cut Apple from Turning Brown", "id": "sSV6ZwxVR1U", "url": "https://www.youtube.com/embed/sSV6ZwxVR1U?showinfo=0", "uploader": "wikiHow", "views": 40011, "duration": 37, "description": "This quick video will give you some tips for keeping that cut apple from turning brown!\n\nRead more: https://www.wikihow.com/Keep-a-Cut-Apple-from-Turning-Brown\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "sSV6ZwxVR1U.mp4", "subtitles": "to keep a cut Apple from turning brown combine one tablespoon of lemon juice and 1 cup 240 milliliters of water in a large bowl add your apple pieces to the bowl soak the apple pieces in the mixture for three to five minutes drain them and rinse them off with cool water if you aren't serving them right away put the apple pieces in a resealable bag and close it tightly taking care to remove all the air keep the cut apples in your fridge until you're ready to enjoy themto keep a cut Apple from turning brown combine one tablespoon of lemon juice and 1 cup 240 milliliters of water in a large bowl add your apple pieces to the bowl soak the apple pieces in the mixture for three to five minutes drain them and rinse them off with cool water if you aren't serving them right away put the apple pieces in a resealable bag and close it tightly taking care to remove all the air keep the cut apples in your fridge until you're ready to enjoy them"}, {"title": "How to Keep Broccoli Fresh", "id": "M3olYQ8HkIU", "url": "https://www.youtube.com/embed/M3olYQ8HkIU", "uploader": "Guidecentral English", "views": 5641, "duration": 33, "description": "Learn how to keep broccoli fresh with this guide from wikiHow: https://www.wikihow.com/Keep-Broccoli-Fresh\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "M3olYQ8HkIU.mp4", "subtitles": "if you want to keep broccoli fresh for a few days put the head of the broccoli stem down into a bowl with a little water like a bouquet place the bowl in the refrigerator and change the water daily to keep the broccoli fresh for five to seven days you can also wrap your broccoli and damp paper towels or place it into a ventilated plastic bag if you're going to use it within a few days regardless on how you choose to store your broccoli get it into the refrigerator as soon as possible after bringing it home youif you want to keep broccoli fresh for a few days put the head of the broccoli stem down into a bowl with a little water like a bouquet place the bowl in the refrigerator and change the water daily to keep the broccoli fresh for five to seven days you can also wrap your broccoli and damp paper towels or place it into a ventilated plastic bag if you're going to use it within a few days regardless on how you choose to store your broccoli get it into the refrigerator as soon as possible after bringing it home you"}, {"title": "How to Keep Cilantro Fresh", "id": "o0bVM4qV5M8", "url": "https://www.youtube.com/embed/o0bVM4qV5M8?showinfo=0", "uploader": "wikiHow", "views": 553, "duration": 55, "description": "Learn how to keep cilantro fresh with this guide from wikiHow: https://www.wikihow.com/Keep-Cilantro-Fresh\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "o0bVM4qV5M8.mp4", "subtitles": "to keep cilantro fresh first trim off the bottoms of the stems then place the bundle of cilantro in a jar and fill the jar with enough water to submerge the stems cover the jar with a plastic sandwich bag and place it in the fridge your cilantro should stay fresh for about 4 weeks occasionally replace the water in the jar to keep the cilantro fresh hold off on rinsing the cilantro until right before you're ready to use it to freeze cilantro wash and thoroughly dry the cilantro then chop it up and spread the pieces out in an ice cube tray with a little water or olive oil store the cilantro in the freezer for up to six months to use your frozen cilantro just add it to soups sauces and dishes as you cookto keep cilantro fresh first trim off the bottoms of the stems then place the bundle of cilantro in a jar and fill the jar with enough water to submerge the stems cover the jar with a plastic sandwich bag and place it in the fridge your cilantro should stay fresh for about 4 weeks occasionally replace the water in the jar to keep the cilantro fresh hold off on rinsing the cilantro until right before you're ready to use it to freeze cilantro wash and thoroughly dry the cilantro then chop it up and spread the pieces out in an ice cube tray with a little water or olive oil store the cilantro in the freezer for up to six months to use your frozen cilantro just add it to soups sauces and dishes as you cook"}, {"title": "How to Keep Guacamole Fresh", "id": "_d1ys51qKsg", "url": "https://www.youtube.com/embed/_d1ys51qKsg", "uploader": "Guidecentral English", "views": 106, "duration": 28, "description": "Learn how to keep guacamole fresh with this guide from wikiHow: https://www.wikihow.com/Keep-Guacamole-Fresh\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "_d1ys51qKsg.mp4", "subtitles": "to keep guacamole fresh start by transferring it to a small bowl the less extra space the better then pour some lime juice or olive oil over the top of the guacamole to protect it from the air so it doesn't turn brown after that just cover the top of the bowl with plastic wrap and put the guacamole in the fridge until you're ready to eat itto keep guacamole fresh start by transferring it to a small bowl the less extra space the better then pour some lime juice or olive oil over the top of the guacamole to protect it from the air so it doesn't turn brown after that just cover the top of the bowl with plastic wrap and put the guacamole in the fridge until you're ready to eat it"}, {"title": "How to Keep Mint Leaves Fresh", "id": "m7eHbot3fxk", "url": "https://www.youtube.com/embed/m7eHbot3fxk?showinfo=0", "uploader": "wikiHow", "views": 7174, "duration": 60, "description": "Learn how to keep mint leaves fresh with this guide from wikiHow: https://www.wikihow.com/Keep-Mint-Leaves-Fresh\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "m7eHbot3fxk.mp4", "subtitles": "then we wisthen we wis  please do it first r&amp;e senators into Della don't take care of the patronage,please do it first r&amp;e senators into Della don't take care of the patronage, please do it first r&amp;e senators into Della don't take care of the patronage,but I still like jobs wri holdenbut I still like jobs wri holden but I still like jobs wri holdenout to waste on lower it's coldout to waste on lower it's cold out to waste on lower it's coldwhy of tea on severalwhy of tea on several why of tea on severalawc ah ah ahh fable zao again in munich what cybeawc ah ah ahh fable zao again in munich what cybe  to swim write l Car teethto swim write l Car teeth to swim write l Car teeth55km gel n store mask rapper's addition wax"}, {"title": "How to Identify Poisonous Mushrooms", "id": "JobzTvnjitk", "url": "https://www.youtube.com/embed/JobzTvnjitk?showinfo=0", "uploader": "wikiHow", "views": 3980, "duration": 51, "description": "Learn how to identify poisonous mushrooms with this guide from wikiHow: https://www.wikihow.com/Identify-Poisonous-Mushrooms\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "JobzTvnjitk.mp4", "subtitles": ""}, {"title": "How to Improve Store Bought Muffin Mix", "id": "Nm_n5tAIT0c", "url": "https://www.youtube.com/embed/Nm_n5tAIT0c?showinfo=0", "uploader": "wikiHow", "views": 2475, "duration": 111, "description": "Learn how to improve store bought muffin mix with this guide from wikiHow: https://www.wikihow.com/Improve-Store-Bought-Muffin-Mix\n\n0:00 Adding Spices and Other Flavors\n0:45 Adding Ingredients to Change the Texture\n1:20 Adding Fruit to the Batter\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "Nm_n5tAIT0c.mp4", "subtitles": ""}, {"title": "How to Infuse Olive Oil", "id": "oEEd719GXqQ", "url": "https://www.youtube.com/embed/oEEd719GXqQ?showinfo=0", "uploader": "wikiHow", "views": 3783, "duration": 30, "description": "Learn How to Infuse Olive Oil with this guide from wikiHow: https://www.wikihow.com/Infuse-Olive-Oil\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "oEEd719GXqQ.mp4", "subtitles": "to infuse olive oil start by washing your fresh herbs and letting them dry completely overnight which will help prevent the growth of bacteria then place the herbs in a food processor and pulverize them for 30 seconds next add the herbs to a bottle and fill it to the top with olive oil refrigerate the bottle for one to two weeks so the flavors in the herbs infuse with the oil finally strain Andry bottle the oil once you're satisfied with the flavorto infuse olive oil start by washing your fresh herbs and letting them dry completely overnight which will help prevent the growth of bacteria then place the herbs in a food processor and pulverize them for 30 seconds next add the herbs to a bottle and fill it to the top with olive oil refrigerate the bottle for one to two weeks so the flavors in the herbs infuse with the oil finally strain Andry bottle the oil once you're satisfied with the flavor"}, {"title": "How to Infuse a Watermelon with Vodka", "id": "iYSpXDlbo5I", "url": "https://www.youtube.com/embed/iYSpXDlbo5I", "uploader": "tablespoonrecipes", "views": 34754, "duration": 36, "description": "Picnics just got way better with vodka-infused watermelon. \n\nRecipe: http://www.tablespoon.com/recipes/vodka-infused-watermelon/cbc4b24f-2748-4f52-af7b-b804cbf070d7", "hosted_mp4": "iYSpXDlbo5I.mp4", "subtitles": "onon on[Music]  [Music]  [Music]"}, {"title": "How to Make a Baked Apple", "id": "Nh5n3Z2aakQ", "url": "https://www.youtube.com/embed/Nh5n3Z2aakQ?showinfo=0", "uploader": "wikiHow", "views": 85, "duration": 73, "description": "Learn how to make a baked apple with this guide from wikiHow: https://www.wikihow.com/Make-a-Baked-Apple\n\n0:00 Preparing the Apples\n0:38 Baking the Apples\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "Nh5n3Z2aakQ.mp4", "subtitles": ""}, {"title": "How to Make a Baking Soda and Vinegar Rocket", "id": "pquyfOH4iuI", "url": "https://www.youtube.com/embed/pquyfOH4iuI?showinfo=0", "uploader": "wikiHow", "views": 10428, "duration": 57, "description": "Learn how to make a baking soda and vinegar rocket with this guide from wikiHow: https://www.wikihow.com/Make-a-Baking-Soda-and-Vinegar-Rocket\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "pquyfOH4iuI.mp4", "subtitles": "to make a baking soda and vinegar rocket you'll need an empty plastic bottle three pencils duct tape a cork a paper towel baking soda and vinegar first use the duct tape to attach the pencils to the plastic bottle to make a stand for your rocket then place one scoop of baking soda in the middle of the paper towel and roll the paper towel up over it twist the ends to keep it secure next pour the vinegar into the bottle until it's halfway full take your rocket outside to a wide open area drop the pack of baking soda into the bottle and quickly close the bottle with the cork shake the rocket and stand it up on the ground and stand back carbon dioxide gas will build up in the bottle until the pressure pops out the cork and sends your rocket flyingto make a baking soda and vinegar rocket you'll need an empty plastic bottle three pencils duct tape a cork a paper towel baking soda and vinegar first use the duct tape to attach the pencils to the plastic bottle to make a stand for your rocket then place one scoop of baking soda in the middle of the paper towel and roll the paper towel up over it twist the ends to keep it secure next pour the vinegar into the bottle until it's halfway full take your rocket outside to a wide open area drop the pack of baking soda into the bottle and quickly close the bottle with the cork shake the rocket and stand it up on the ground and stand back carbon dioxide gas will build up in the bottle until the pressure pops out the cork and sends your rocket flying"}, {"title": "How to Make a Balsamic Reduction", "id": "CIr3dADx32w", "url": "https://www.youtube.com/embed/CIr3dADx32w", "uploader": "Guidecentral English", "views": 74, "duration": 39, "description": "Learn how to make a balsamic reduction with this guide from wikiHow: https://www.wikihow.com/Make-a-Balsamic-Reduction\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "CIr3dADx32w.mp4", "subtitles": "to make a balsamic reduction choose a high quality balsamic vinegar that is flavorful and sweet pour your balsamic vinegar into a wide shallow pan and bring it to a boil over medium heat if you want a sweet reduction to pour over fruit you can add sugar as you're heating the vinegar or you can add it at the end if you prefer once the vinegar reaches a boil turn the heat to low and simmer the vinegar for 10 to 20 minutes if you added sugar to your vinegar stir it occasionally to keep it from sticking to the pan allow the reduction to cool completely before servingto make a balsamic reduction choose a high quality balsamic vinegar that is flavorful and sweet pour your balsamic vinegar into a wide shallow pan and bring it to a boil over medium heat if you want a sweet reduction to pour over fruit you can add sugar as you're heating the vinegar or you can add it at the end if you prefer once the vinegar reaches a boil turn the heat to low and simmer the vinegar for 10 to 20 minutes if you added sugar to your vinegar stir it occasionally to keep it from sticking to the pan allow the reduction to cool completely before serving"}, {"title": "How to Make a Banana Milkshake", "id": "pa_k9L_TI2o", "url": "https://www.youtube.com/embed/pa_k9L_TI2o?showinfo=0", "uploader": "wikiHow", "views": 232, "duration": 34, "description": "This quick video will give you some tips on how to make a banana milkshake!\n\nRead more: https://www.wikihow.com/Make-a-Banana-Milkshake\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "pa_k9L_TI2o.mp4", "subtitles": ""}]