[{"title": "How to Make Self Rising Flour", "id": "VPc06tNvATs", "url": "https://www.youtube.com/embed/VPc06tNvATs", "uploader": "Guidecentral English", "views": 175, "duration": 37, "description": "Learn how to make self-rising flour with this guide from wikiHow: https://www.wikihow.com/Make-Self%E2%80%90Rising-Flour\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "VPc06tNvATs.mp4", "subtitles": "to make your own self-rising flour sift one cup of all-purpose flour into a bowl and mix one and a half teaspoons of baking powder add fourth teaspoon of baking soda if your recipe calls for buttermilk cocoa or yogurt and a fourth teaspoon of salt if the recipe contains salt if it doesn't pour in a half teaspoon of salt stir until your ingredients are evenly combined and use your flour in your recipe if you have any left over store it in an airtight container and keep until your baking powder's expiration dateto make your own self-rising flour sift one cup of all-purpose flour into a bowl and mix one and a half teaspoons of baking powder add fourth teaspoon of baking soda if your recipe calls for buttermilk cocoa or yogurt and a fourth teaspoon of salt if the recipe contains salt if it doesn't pour in a half teaspoon of salt stir until your ingredients are evenly combined and use your flour in your recipe if you have any left over store it in an airtight container and keep until your baking powder's expiration date"}, {"title": "How to Make Simple Five Minute Frosting", "id": "1r4Q5ttrkuw", "url": "https://www.youtube.com/embed/1r4Q5ttrkuw?showinfo=0", "uploader": "wikiHow", "views": 354, "duration": 100, "description": "Learn how to make simple five minute frosting with this guide from wikiHow: https://www.wikihow.com/Make-Simple-Five-Minute-Frosting\n\n0:00 Buttercream Frosting\n0:35 Chocolate Frosting\n1:11 Simple Glaze\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "1r4Q5ttrkuw.mp4", "subtitles": "[Music] you[Music] you [Music] you"}, {"title": "How to Make Simple Iced Coffee", "id": "0iEHzX3vTqM", "url": "https://www.youtube.com/embed/0iEHzX3vTqM?showinfo=0", "uploader": "wikiHow", "views": 157, "duration": 100, "description": "Learn how to make simple iced coffee with this guide from wikiHow: https://www.wikihow.com/Make-Simple-Iced-Coffee\n\n0:00 Instant Iced Coffee\n0:35 Basic Iced Coffee\n1:00 Cold Brewed Iced Coffee\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "0iEHzX3vTqM.mp4", "subtitles": "ah ahah ah ah ahyeahyeah yeahyeah yeah"}, {"title": "How to Make Simple Mashed Potatoes", "id": "2StTVY6y9xg", "url": "https://www.youtube.com/embed/2StTVY6y9xg?showinfo=0", "uploader": "wikiHow", "views": 689, "duration": 38, "description": "A cooking skill that everyone should master. This quick video will give you some tips on how to make easy mashed potatoes! \n\nRead more: https://www.wikihow.com/Make-Simple-Mashed-Potatoes\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "2StTVY6y9xg.mp4", "subtitles": ""}, {"title": "How to Make Simple Meatballs", "id": "0wpRuU7xKC8", "url": "https://www.youtube.com/embed/0wpRuU7xKC8?showinfo=0", "uploader": "wikiHow", "views": 253, "duration": 77, "description": "This quick video will give you some tips on how to make simple, tasty meatballs!\r\n\r\nRead more: https://www.wikihow.com/Make-Simple-Meatballs\r\n\r\nFollow our social media channels to find more interesting, easy, and helpful guides!\r\n\r\nFacebook: https://www.facebook.com/wikiHow/\r\nTwitter: https://twitter.com/wikiHow\r\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "0wpRuU7xKC8.mp4", "subtitles": "to make simple meatballs start by mixing one egg and your favorite seasonings in a bowl for a quick easy seasoning mix add about half a teaspoon three grams each of oregano garlic powder cracked red pepper in time then in a separate bowl at one pound half a kilogram of raw ground meat you can use any kind of ground meat but ground beef will give you a classic meatball flavor next pour the egg mixture into the beef and use your hands to knead it into the meat add in half a cup 50 grams of grated Parmesan cheese and 1cup 125 grams of breadcrumbs once everything is mixed together use your hands to form 1-inch balls then cook the meatballs in olive oil or sauce over medium heat until they're browned on all sides alternatively you can bake them in the oven for 20 to 30 minutes at 350 degrees Fahrenheit 177 degrees Celsius serve and enjoyto make simple meatballs start by mixing one egg and your favorite seasonings in a bowl for a quick easy seasoning mix add about half a teaspoon three grams each of oregano garlic powder cracked red pepper in time then in a separate bowl at one pound half a kilogram of raw ground meat you can use any kind of ground meat but ground beef will give you a classic meatball flavor next pour the egg mixture into the beef and use your hands to knead it into the meat add in half a cup 50 grams of grated Parmesan cheese and 1cup 125 grams of breadcrumbs once everything is mixed together use your hands to form 1-inch balls then cook the meatballs in olive oil or sauce over medium heat until they're browned on all sides alternatively you can bake them in the oven for 20 to 30 minutes at 350 degrees Fahrenheit 177 degrees Celsius serve and enjoy"}, {"title": "How to Make Simple Syrup", "id": "Uww-6iLp77k", "url": "https://www.youtube.com/embed/Uww-6iLp77k?showinfo=0", "uploader": "wikiHow", "views": 139, "duration": 34, "description": "Simple syrup requires only two ingredients: sugar and water. Because it is cooked, it does not have those annoying grains of sugar, making it a common sweetener for drinks where texture is important. Once you know how to make simple syrup, you can experiment with adding your own flavors and variations!\n\r\nRead more: https://www.wikihow.com/Make-Simple-Syrup\r\n\r\nFollow our social media channels to find more interesting, easy, and helpful guides!\r\n\r\nFacebook: https://www.facebook.com/wikiHow/\r\nTwitter: https://twitter.com/wikiHow\r\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "Uww-6iLp77k.mp4", "subtitles": ""}, {"title": "How to Make Sticky Rice Using Regular Rice", "id": "9676dHvNPXU", "url": "https://www.youtube.com/embed/9676dHvNPXU", "uploader": "wikiHow", "views": 200589, "duration": 179, "description": "Learn how to make sticky rice using regular rice with this guide from wikiHow: https://www.wikihow.com/Make-Sticky-Rice-Using-Regular-Rice\n\n0:00 Regular Sticky Rice \n0:40 Sushi Sticky Rice \n1:30 Mango Sticky Rice \n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "9676dHvNPXU.mp4", "subtitles": "code 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5code 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 code 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 55 5 5 per well to whom all 5 5 5 5 5 5 5 55 5 5 per well to whom all 5 5 5 5 5 5 5 5 5 5 5 per well to whom all 5 5 5 5 5 5 5 55 5 5 5 5 5 5 5 5 5 55 5 5 5 5 5 5 5 5 5 5    uh [music] wee 5 cover or who was 5 5 5 5 5 5 5 5 5uh [music] wee 5 cover or who was 5 5 5 5 5 5 5 5 5 uh [music] wee 5 cover or who was 5 5 5 5 5 5 5 5 55 55 5 5 55 uh a wee bee5 uh a wee bee 5 uh a wee bee[music][music] [music]5 uh5 uh 5 uh[music]"}, {"title": "Quick Tips: Store Bought Frosting Super Tip! | One Pot Chef", "id": "-LylT-D9b5M", "url": "https://www.youtube.com/embed/-LylT-D9b5M", "uploader": "OnePotChefShow", "views": 1058457, "duration": 43, "description": "If you love store bought frosting, this tip is going to rock your world. This awesome super tip will save you money and allow you to frost twice as many cakes, cupcakes and muffins :)\n\nONE POT CHEF COOKBOOKS ON iTUNES BOOKSTORE:\nhttp://itunes.apple.com/au/artist/david-chilcott/id478668534?mt=11\n\nONE POT CHEF COOKBOOKS - PAPERBACKS AND EBOOKS:\nhttp://www.lulu.com/spotlight/onepotchef\n\nMY SECOND CHANNEL:\nhttp://www.youtube.com/onepotchefblog\n\nPLEASE SUBSCRIBE!\nhttp://au.youtube.com/subscription_center?add_user=OnePotChefShow\n\nFOLLOW ME ON TWITTER\nhttp://www.twitter.com/onepotchef\n\nLIKE ME ON FACEBOOK\nhttp://www.facebook.com/onepotchef\n\nMore cooking videos at:\nhttp://www.onepotchefshow.com\n\nMusic Track:\n\"Peppy Pepe\" \nby Kevin MacLeod\nhttp://incompetech.com\nRoyalty Free Music - Used with Permission under Creative Commons license.", "hosted_mp4": "-LylT-D9b5M.mp4", "subtitles": "if you use store-bought frosting for cakes muffins or cupcakes and this little tip is going to change your life transfer the frosting into a mixing bowl then simply beat the frosting with an electric mixer and as if by magic suddenly you've got twice as much frosting basically what's happening here is we're whipping air into the frosting and so it doubles in volume so now you can guys twice as many cupcakes twice as many full-size cakes it's a great tip and it's so simple to do but don't tell Betty I told youif you use store-bought frosting for cakes muffins or cupcakes and this little tip is going to change your life transfer the frosting into a mixing bowl then simply beat the frosting with an electric mixer and as if by magic suddenly you've got twice as much frosting basically what's happening here is we're whipping air into the frosting and so it doubles in volume so now you can guys twice as many cupcakes twice as many full-size cakes it's a great tip and it's so simple to do but don't tell Betty I told you"}, {"title": "How to Make Sunny Side up Eggs", "id": "KROcOP-_Vv0", "url": "https://www.youtube.com/embed/KROcOP-_Vv0", "uploader": "Guidecentral English", "views": 547, "duration": 26, "description": "Learn how to make sunny side up eggs with this guide from wikiHow: https://www.wikihow.com/Make-Sunny-Side-up-Eggs\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "KROcOP-_Vv0.mp4", "subtitles": "to make sunny-side up eggs start by heating about one tablespoon of butter in a skillet over low heat then break a couple eggs into the pan keeping the yolks intact and the whites separated next cover the pan and cook the eggs for two to three minutes or until the whites are firm and cooked on the top finally use a spatula to transfer the eggs to a plate before serving to learn how to make sunny side up eggs in the oven scroll downto make sunny-side up eggs start by heating about one tablespoon of butter in a skillet over low heat then break a couple eggs into the pan keeping the yolks intact and the whites separated next cover the pan and cook the eggs for two to three minutes or until the whites are firm and cooked on the top finally use a spatula to transfer the eggs to a plate before serving to learn how to make sunny side up eggs in the oven scroll down"}, {"title": "How to Make Tacos", "id": "8uSk6oNaEbU", "url": "https://www.youtube.com/embed/8uSk6oNaEbU?showinfo=0", "uploader": "wikiHow", "views": 105, "duration": 74, "description": "Learn How to Make Tacos with this guide from wikiHow: https://www.wikihow.com/Make-Tacos\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "8uSk6oNaEbU.mp4", "subtitles": "to make tacos first add 2 teaspoons or 10 milliliters of vegetable oil and 1 pound or 1/2 kilogram of lean ground beef to a skillet then cook the ground beef over medium high heat for 10 minutes or until it's completely Brown drain the grease then season the meat with 1/2 TSP or 2 grams each of chili powder cumin paprika salt black pepper and crushed red pepper stir the seasonings into the meat so it's fully coated now spoon the ground beef into hard taco shells and add your favorite toppings like lettuce tomato onion and shredded cheese top with salsa or guacamole for even more flavor if you'd rather make soft tacos first wrap flour tortillas in foil and heat them in the oven at 325 degrees Fahrenheit or 160 degrees Celsius for 20 minutes then spoon the ground beef and toppings onto the tortillas fold the sides up and dig into make tacos first add 2 teaspoons or 10 milliliters of vegetable oil and 1 pound or 1/2 kilogram of lean ground beef to a skillet then cook the ground beef over medium high heat for 10 minutes or until it's completely Brown drain the grease then season the meat with 1/2 TSP or 2 grams each of chili powder cumin paprika salt black pepper and crushed red pepper stir the seasonings into the meat so it's fully coated now spoon the ground beef into hard taco shells and add your favorite toppings like lettuce tomato onion and shredded cheese top with salsa or guacamole for even more flavor if you'd rather make soft tacos first wrap flour tortillas in foil and heat them in the oven at 325 degrees Fahrenheit or 160 degrees Celsius for 20 minutes then spoon the ground beef and toppings onto the tortillas fold the sides up and dig in"}, {"title": "How to Make Tomato Soup", "id": "BuJy3V7__js", "url": "https://www.youtube.com/embed/BuJy3V7__js", "uploader": "Guidecentral English", "views": 108, "duration": 36, "description": "Learn how to make tomato soup with this guide from wikiHow: https://www.wikihow.com/Make-Tomato-Soup\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "BuJy3V7__js.mp4", "subtitles": "Hi squid dusub make a brush up toHi squid dusub make a brush up to Hi squid dusub make a brush up tofill the meadows fortfill the meadows fort fill the meadows fortworth  onebetqq.netonebetqq.net onebetqq.netdriven high pressure meds Next  You know each from our site"}, {"title": "How to Make Tzatziki", "id": "8eUoHSBZz-o", "url": "https://www.youtube.com/embed/8eUoHSBZz-o?showinfo=0", "uploader": "wikiHow", "views": 75, "duration": 57, "description": "Learn How to Make Tzatziki with this guide from wikiHow: https://www.wikihow.com/Make-Tzatziki\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "8eUoHSBZz-o.mp4", "subtitles": "to make Zeki start by peeling one cucumber remove the seeds then chop the cucumber into 1/4 inch or 0.6 centimeter pieces peel one clove of garlic and mince then stir the cucumber and garlic into a medium bowl with 1 cup or 245 grams of Greek style plain yogurt chop 2 tablespoons or 30 grams of fresh dill then add it to the yogurt along with 2 tablespoons or 30 milliliters of fresh squeezed lemon season the mixture with 1/2 teaspoon or two grams of kosher salt and 1/4 teaspoon or 1 gram of freshly ground black pepper lastly taste the sauce to see if it needs more seasoning like lemon or salt serve the sauce with your choice of toasted pita or pita chips and garnish with more fresh dillto make Zeki start by peeling one cucumber remove the seeds then chop the cucumber into 1/4 inch or 0.6 centimeter pieces peel one clove of garlic and mince then stir the cucumber and garlic into a medium bowl with 1 cup or 245 grams of Greek style plain yogurt chop 2 tablespoons or 30 grams of fresh dill then add it to the yogurt along with 2 tablespoons or 30 milliliters of fresh squeezed lemon season the mixture with 1/2 teaspoon or two grams of kosher salt and 1/4 teaspoon or 1 gram of freshly ground black pepper lastly taste the sauce to see if it needs more seasoning like lemon or salt serve the sauce with your choice of toasted pita or pita chips and garnish with more fresh dill"}, {"title": "How to Make Virgin Coconut Oil", "id": "YamJld4Z28g", "url": "https://www.youtube.com/embed/YamJld4Z28g", "uploader": "Guidecentral English", "views": 1908, "duration": 29, "description": "Learn how to make virgin coconut oil with this guide from wikiHow: https://www.wikihow.com/Make-Virgin-Coconut-Oil\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "YamJld4Z28g.mp4", "subtitles": ""}, {"title": "How to Make Whipped Cream", "id": "3Ud-C1qrhH0", "url": "https://www.youtube.com/embed/3Ud-C1qrhH0?showinfo=0", "uploader": "wikiHow", "views": 925, "duration": 38, "description": "Learn How to Make Whipped Cream with this guide from wikiHow: https://www.wikihow.com/Make-Whipped-Cream\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "3Ud-C1qrhH0.mp4", "subtitles": "to make whipped cream by hand chill one cup 240 milliliters heavy whipping cream and a mixing bowl in the refrigerator pour the cream into the bowl then add 1/3 cup 35 grams powdered sugar and a pinch of salt use a whisk or an electric mixer to whip the cream in a circular direction going quickly to keep the cream from warming up too much continue whipping until you can lift the whisk or beaters from the cream and leave semi stiff peaks behind place the bowl in the refrigerator or keep whipping if you want stiffer whipped cream that can retain its shapeto make whipped cream by hand chill one cup 240 milliliters heavy whipping cream and a mixing bowl in the refrigerator pour the cream into the bowl then add 1/3 cup 35 grams powdered sugar and a pinch of salt use a whisk or an electric mixer to whip the cream in a circular direction going quickly to keep the cream from warming up too much continue whipping until you can lift the whisk or beaters from the cream and leave semi stiff peaks behind place the bowl in the refrigerator or keep whipping if you want stiffer whipped cream that can retain its shape"}, {"title": "How to Make Yogurt", "id": "hhHsCFMwCBU", "url": "https://www.youtube.com/embed/hhHsCFMwCBU?showinfo=0", "uploader": "wikiHow", "views": 1059, "duration": 90, "description": "Learn How to Make Yogurt with this guide from wikiHow: https://www.wikihow.com/Make-Yogurt\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "hhHsCFMwCBU.mp4", "subtitles": "to make your own yogurt at home all you need is milk and some store-bought yogurt make sure the yogurt contains live active cultures which are what turn the milk into more yogurt first pour 8 cups 2 liters of milk into a Dutch oven then heat the milk over medium high heat stirring it continuously so it doesn't scorch use an instant-read thermometer to check the temperature of the milk once it reads 200 degrees Fahrenheit 93 degrees Celsius turn off the heat and let the milk cool to around 115 degrees Fahrenheit 46 degrees Celsius now add 1 cup 235 milliliters of the warm milk and add half a cup 120 grams of store-bought yogurt to a bowl and whisk until they're well blended whisk the finned yogurt into the rest of the warm milk then cover the Dutch oven and place in a turned off oven to keep the milk warm while it sets let the yogurt set for at least 4 hours or until it reaches the taste and consistency you like finally transfer the yogurt to a separate container and store it in your fridge for up to 2 weeksto make your own yogurt at home all you need is milk and some store-bought yogurt make sure the yogurt contains live active cultures which are what turn the milk into more yogurt first pour 8 cups 2 liters of milk into a Dutch oven then heat the milk over medium high heat stirring it continuously so it doesn't scorch use an instant-read thermometer to check the temperature of the milk once it reads 200 degrees Fahrenheit 93 degrees Celsius turn off the heat and let the milk cool to around 115 degrees Fahrenheit 46 degrees Celsius now add 1 cup 235 milliliters of the warm milk and add half a cup 120 grams of store-bought yogurt to a bowl and whisk until they're well blended whisk the finned yogurt into the rest of the warm milk then cover the Dutch oven and place in a turned off oven to keep the milk warm while it sets let the yogurt set for at least 4 hours or until it reaches the taste and consistency you like finally transfer the yogurt to a separate container and store it in your fridge for up to 2 weeks"}, {"title": "How to Melt Honey", "id": "-KdoY7lkAIU", "url": "https://www.youtube.com/embed/-KdoY7lkAIU", "uploader": "Guidecentral English", "views": 319, "duration": 31, "description": "Learn how to melt honey with this guide from wikiHow: https://www.wikihow.com/Melt-Honey\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "-KdoY7lkAIU.mp4", "subtitles": ""}, {"title": "How to Microwave Corn on the Cob", "id": "8vvBSQ5Qaok", "url": "https://www.youtube.com/embed/8vvBSQ5Qaok?showinfo=0", "uploader": "wikiHow", "views": 3357, "duration": 43, "description": "Learn How to Microwave Corn on the Cob with this guide from wikiHow: https://www.wikihow.com/Microwave-Corn-on-the-Cob\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "8vvBSQ5Qaok.mp4", "subtitles": "- microwave corn on the cob cover the corn with a wet paper towel and microwave on HIGH for two to four minutes per ear of corn carefully remove the corn and let it cool for a few minutes to microwave the corn on the cob in its husk remove any loose or dry leaves next trim the ends so the ears will fit in your microwave microwave one ear of corn at a time for three minutes on high heat carefully remove the ear of corn with an oven mitt finally let your corn cool for a few minutes before you remove the husk and flavor with butter salt and pepper- microwave corn on the cob cover the corn with a wet paper towel and microwave on HIGH for two to four minutes per ear of corn carefully remove the corn and let it cool for a few minutes to microwave the corn on the cob in its husk remove any loose or dry leaves next trim the ends so the ears will fit in your microwave microwave one ear of corn at a time for three minutes on high heat carefully remove the ear of corn with an oven mitt finally let your corn cool for a few minutes before you remove the husk and flavor with butter salt and pepper"}, {"title": "How to Organize Your Fridge", "id": "ofuMsjy4VcQ", "url": "https://www.youtube.com/embed/ofuMsjy4VcQ?showinfo=0", "uploader": "wikiHow", "views": 232, "duration": 63, "description": "Learn How to Organize Your Fridge with this guide from wikiHow: https://www.wikihow.com/Organize-Your-Fridge\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "ofuMsjy4VcQ.mp4", "subtitles": ""}, {"title": "How to Peel a Mango", "id": "jQepTW2VJKI", "url": "https://www.youtube.com/embed/jQepTW2VJKI?showinfo=0", "uploader": "wikiHow", "views": 749, "duration": 29, "description": "This quick video will give you some tips on how to peel a mango!\n\nRead more: https://www.wikihow.com/Peel-a-Mango\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "jQepTW2VJKI.mp4", "subtitles": "to peel a mango start by pulling off the stem at the top of the fruit then wedge your finger underneath the skin of the mango where the stem used to be once you've pried up some of the skin slowly peel it down toward the other end of the mango after that strip of skin is off rotate the mango and repeat keep doing this until you've peeled off all of the skin you can also use a knife instead of your fingers which will make peeling the mango easierto peel a mango start by pulling off the stem at the top of the fruit then wedge your finger underneath the skin of the mango where the stem used to be once you've pried up some of the skin slowly peel it down toward the other end of the mango after that strip of skin is off rotate the mango and repeat keep doing this until you've peeled off all of the skin you can also use a knife instead of your fingers which will make peeling the mango easier"}, {"title": "How to Peel a Pineapple", "id": "J6-RfyIuQsE", "url": "https://www.youtube.com/embed/J6-RfyIuQsE", "uploader": "Guidecentral English", "views": 747, "duration": 31, "description": "Learn how to peel a pineapple with this guide from wikiHow: https://www.wikihow.com/Peel-a-Pineapple\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "J6-RfyIuQsE.mp4", "subtitles": "to peel a whole pineapple lay it on its side and cut off the top about 1 4 inch below the leaves stand your pineapple up and slice downwards through the peel then turn it slightly and repeat lay the pineapple on its side again and slice off the bottom to get rid of the eyes make an angled cut above and below each diagonal line of eyes to remove them in small wedges leaving a spiral pattern then cut out the core of the pineapple and slice up the remaining fruit to eatto peel a whole pineapple lay it on its side and cut off the top about 1 4 inch below the leaves stand your pineapple up and slice downwards through the peel then turn it slightly and repeat lay the pineapple on its side again and slice off the bottom to get rid of the eyes make an angled cut above and below each diagonal line of eyes to remove them in small wedges leaving a spiral pattern then cut out the core of the pineapple and slice up the remaining fruit to eat"}]