[{"title": "How to Make Steamed Rice", "id": "Ksy-CZFVNjA", "url": "https://www.youtube.com/embed/Ksy-CZFVNjA?showinfo=0", "uploader": "wikiHow", "views": 115, "duration": 42, "description": "Learn how to make steamed rice with this guide from wikiHow: https://www.wikihow.com/Make-Steamed-Rice\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "Ksy-CZFVNjA.mp4", "subtitles": ""}, {"title": "How to Make Stone Soup", "id": "vqwexxbW4tw", "url": "https://www.youtube.com/embed/vqwexxbW4tw", "uploader": "Guidecentral English", "views": 3023, "duration": 40, "description": "Learn how to make stone soup with this guide from wikiHow: https://www.wikihow.com/Make-Stone-Soup\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "vqwexxbW4tw.mp4", "subtitles": "to make stone soup on the stovetop saute a diced onion two diced carrots and two diced celery stalks in a pot and add four cloves of minced garlic one pound of diced turnips and one pound of diced potatoes after the vegetables have cooked for five minutes stir in one small head of shredded cabbage and a 14.5 ounce can of diced tomatoes as a mixture simmers add a ham hock eight cups of chicken broth and a cleaned stone to the soup cover the pot and cook for 45 minutes before removing the stone to serve for more tips including how to make a veggie stone soup in a slow cooker read onto make stone soup on the stovetop saute a diced onion two diced carrots and two diced celery stalks in a pot and add four cloves of minced garlic one pound of diced turnips and one pound of diced potatoes after the vegetables have cooked for five minutes stir in one small head of shredded cabbage and a 14.5 ounce can of diced tomatoes as a mixture simmers add a ham hock eight cups of chicken broth and a cleaned stone to the soup cover the pot and cook for 45 minutes before removing the stone to serve for more tips including how to make a veggie stone soup in a slow cooker read on"}, {"title": "How to Make Strawberry Milkshakes", "id": "e37mPYXdVx0", "url": "https://www.youtube.com/embed/e37mPYXdVx0", "uploader": "Guidecentral English", "views": 850, "duration": 30, "description": "Learn how to make strawberry milkshakes with this guide from wikiHow: https://www.wikihow.com/Make-Strawberry-Milkshakes\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "e37mPYXdVx0.mp4", "subtitles": "if you want to make a simple strawberry milkshake place strawberries cold milk and vanilla ice cream in a blender blend the ingredients for about two to three minutes or until it reaches the consistency you like in a milkshake pour the strawberry milkshake into a glass or split it between two glasses if you're sharing garnish with a strawberry and serveif you want to make a simple strawberry milkshake place strawberries cold milk and vanilla ice cream in a blender blend the ingredients for about two to three minutes or until it reaches the consistency you like in a milkshake pour the strawberry milkshake into a glass or split it between two glasses if you're sharing garnish with a strawberry and serve"}, {"title": "How to Make Toast in an Oven", "id": "iMj6aZPh8_g", "url": "https://www.youtube.com/embed/iMj6aZPh8_g?showinfo=0", "uploader": "wikiHow", "views": 54714, "duration": 69, "description": "Learn how to make toast in an oven with this guide from wikiHow: https://www.wikihow.com/Make-Toast-in-an-Oven\n\n0:00 Slow-Toasting in the Oven\n0:35 Quick-Toasting Using the Broiler\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "iMj6aZPh8_g.mp4", "subtitles": ""}, {"title": "How to Make Unleavened Bread", "id": "HiFUOP1B5TU", "url": "https://www.youtube.com/embed/HiFUOP1B5TU", "uploader": "wikiHow", "views": 392, "duration": 148, "description": "Learn How to Make Unleavened Bread with this guide from wikiHow: https://www.wikihow.com/Make-Unleavened-Bread\n\n0:04 Crisp Matzo \n1:13 Roti Flatbread \n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "HiFUOP1B5TU.mp4", "subtitles": "[Music][Music] [Music]1  1  [Music][Music] [Music]à  à  m  [Music]  [Music]  oh  oh  [Music]  oh  on  [Music][Music] [Music]oh  oh  oh  hophop hopoh  [Music]"}, {"title": "How to Peel a Difficult Hard Boiled Egg", "id": "UJloKNrpo4k", "url": "https://www.youtube.com/embed/UJloKNrpo4k", "uploader": "Yum", "views": 1286, "duration": 40, "description": "Subscribe Our Channel For More Videos: https://www.youtube.com/channel/UCao2ujbKlXmYiwoesbVuDUw?sub_confirmation1 \n\nDon't Forget To Hit The Like Button.", "hosted_mp4": "UJloKNrpo4k.mp4", "subtitles": ""}, {"title": "How to Peel a Garlic Clove", "id": "aOGk7KnFpAg", "url": "https://www.youtube.com/embed/aOGk7KnFpAg?showinfo=0", "uploader": "wikiHow", "views": 365, "duration": 30, "description": "Learn How to Peel a Garlic Clove with this guide from wikiHow: https://www.wikihow.com/Peel-a-Garlic-Clove\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "aOGk7KnFpAg.mp4", "subtitles": "to easily peel a garlic clove microwave it for 10 seconds on high which will loosen the skin so it's easy to peel you can also put the clove in a metal bowl cover it and shake it vigorously for one minute if you don't have a microwave or a metal bowl try putting the clove underneath a dishcloth and then hitting it with a mallet or other hard object so the skin breaks offto easily peel a garlic clove microwave it for 10 seconds on high which will loosen the skin so it's easy to peel you can also put the clove in a metal bowl cover it and shake it vigorously for one minute if you don't have a microwave or a metal bowl try putting the clove underneath a dishcloth and then hitting it with a mallet or other hard object so the skin breaks off"}, {"title": "Peeling Peaches", "id": "pua2tDe6J2E", "url": "https://www.youtube.com/embed/pua2tDe6J2E", "uploader": "Luther Driggers", "views": 2369, "duration": 49, "description": "Immerse peaches in boiling water for 10-20 seconds (to little and you don't loosen the skin, too long and you overheat the peach).  Massage the skin until it looks and feels loose all over, then pop the peach out.", "hosted_mp4": "pua2tDe6J2E.mp4", "subtitles": ""}, {"title": "How to Plant Garlic", "id": "N3f5jeNmhYM", "url": "https://www.youtube.com/embed/N3f5jeNmhYM", "uploader": "Guidecentral English", "views": 641, "duration": 34, "description": "Learn how to plant garlic with this guide from wikiHow: https://www.wikihow.com/Plant-Garlic\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "N3f5jeNmhYM.mp4", "subtitles": "to plant garlic choose a spot with full sun and well-draining soil and use a garden rake or hoe to work the soil to about four inches divide your garlic clove into individual cloves keeping the papery skin intact plant the cloves with the flat root side pointing down and the tapered side pointing up and space the cloves about four inches apart and about two inches deep water the garlic every three to five days and cut off any shoots that grow to encourage the garlic bulb to develop harvest the garlic when the tops turn yellow and begin to die offto plant garlic choose a spot with full sun and well-draining soil and use a garden rake or hoe to work the soil to about four inches divide your garlic clove into individual cloves keeping the papery skin intact plant the cloves with the flat root side pointing down and the tapered side pointing up and space the cloves about four inches apart and about two inches deep water the garlic every three to five days and cut off any shoots that grow to encourage the garlic bulb to develop harvest the garlic when the tops turn yellow and begin to die off"}, {"title": "How to Puff Quinoa", "id": "pjCrJVB9eus", "url": "https://www.youtube.com/embed/pjCrJVB9eus", "uploader": "Guidecentral English", "views": 26020, "duration": 36, "description": "Learn how to puff quinoa with this guide from wikiHow: https://www.wikihow.com/Puff-Quinoa\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "pjCrJVB9eus.mp4", "subtitles": "if you'd like to puff keno heat a saucepan over medium heat and add the oil of desired to test if the pan is hot enough add a small amount of quinoa which should pop within a few seconds once your pan is hot enough cover the base of the pan with quinoa before shaking the pan to prevent the seeds from sticking when the popping slows usually after 1 to 5 minutes remove the pan from the heat finished by pouring the quinoa onto a baking sheet to let it cool downif you'd like to puff keno heat a saucepan over medium heat and add the oil of desired to test if the pan is hot enough add a small amount of quinoa which should pop within a few seconds once your pan is hot enough cover the base of the pan with quinoa before shaking the pan to prevent the seeds from sticking when the popping slows usually after 1 to 5 minutes remove the pan from the heat finished by pouring the quinoa onto a baking sheet to let it cool down"}, {"title": "How to Remove Brown Tips From the Leaves of Houseplants", "id": "LDPX-2lx4ro", "url": "https://www.youtube.com/embed/LDPX-2lx4ro?showinfo=0", "uploader": "wikiHow", "views": 1246, "duration": 64, "description": "Learn how to remove brown tips from the leaves of houseplants with this guide from wikiHow: https://www.wikihow.com/Remove-Brown-Tips-From-the-Leaves-of-Houseplants\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "LDPX-2lx4ro.mp4", "subtitles": "toute powers  spawn too ex thespawn too ex the spawn too ex thethree of us my dad sister nutthree of us my dad sister nut three of us my dad sister nutchui 2v jaw always howdy armchui 2v jaw always howdy arm chui 2v jaw always howdy armsostv ps i wear it while watching next ipai karin i rao bass too misssostv ps i wear it while watching next ipai karin i rao bass too miss sostv ps i wear it while watching next ipai karin i rao bass too missdamdam damsustain switzerland torn into eosustain switzerland torn into eo sustain switzerland torn into eosos air proteins is a to b scan saliv vrm Weesos air proteins is a to b scan saliv vrm Wee sos air proteins is a to b scan saliv vrm WeePiper Yes New Yooa I havePiper Yes New Yooa I have Piper Yes New Yooa I haveStopwatch Can I like it List SwedenStopwatch Can I like it List Sweden Stopwatch Can I like it List Swedencqi Yumin should look harmonious Anyway, like this, you clip 5cm x 5mcqi Yumin should look harmonious Anyway, like this, you clip 5cm x 5m cqi Yumin should look harmonious Anyway, like this, you clip 5cm x 5mmanners Audi soo suck and rifles domanners Audi soo suck and rifles do manners Audi soo suck and rifles don't harmonize a kamsa a bit line ole stud a born with a written trumpetn't harmonize a kamsa a bit line ole stud a born with a written trumpet n't harmonize a kamsa a bit line ole stud a born with a written trumpetweirdweird weirdowi"}, {"title": "How to Ripen Bananas Quickly", "id": "_XaMwwWllDA", "url": "https://www.youtube.com/embed/_XaMwwWllDA?showinfo=0", "uploader": "wikiHow", "views": 1025, "duration": 39, "description": "This quick video will give you some tips on how to ripen bananas quickly!\n\nRead more: https://www.wikihow.com/Ripen-Bananas-Quickly\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "_XaMwwWllDA.mp4", "subtitles": ""}, {"title": "How to Roll a Burrito", "id": "3Z55rGnR_Os", "url": "https://www.youtube.com/embed/3Z55rGnR_Os", "uploader": "Guidecentral English", "views": 1310, "duration": 25, "description": "Learn how to roll a burrito with this guide from wikiHow: https://www.wikihow.com/Roll-a-Burrito\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "3Z55rGnR_Os.mp4", "subtitles": "to roll a burrito start by folding the left and right edges of the tortilla toward the center and not all the way at this point the edges shouldn't be overlapping next bring the top edge of the burrito down over the fillings and wrap it underneath them so it stays in place finally roll the burrito towards yourself until it reaches the bottom edge of the tortillato roll a burrito start by folding the left and right edges of the tortilla toward the center and not all the way at this point the edges shouldn't be overlapping next bring the top edge of the burrito down over the fillings and wrap it underneath them so it stays in place finally roll the burrito towards yourself until it reaches the bottom edge of the tortilla"}, {"title": "How to Sauté Vegetables", "id": "8YcsWIzaqJI", "url": "https://www.youtube.com/embed/8YcsWIzaqJI?showinfo=0", "uploader": "wikiHow", "views": 64424, "duration": 101, "description": "Learn how to sauté vegetables with this guide from wikiHow: https://www.wikihow.com/Sauté-Vegetables\n\n0:00 Preparing the Vegetables\n0:25 Cooking the Vegetables\n1:00 Using Parchment Paper\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "8YcsWIzaqJI.mp4", "subtitles": ""}, {"title": "How To Scoop Ice Cream - Axel's Food and Ice Cream", "id": "q5AVhiwSY18", "url": "https://www.youtube.com/embed/q5AVhiwSY18", "uploader": "EatAtAxels", "views": 123454, "duration": 42, "description": "Justine at Axel's Food and Ice Cream shows you how to properly scoop ice cream.  Start with a clean ice cream scoop.  First, you scrape down along the walls of the container to form the ice cream into a tennis ball shape, gather it all together, and then just plop it on the cone.  It's as simple as that folks, so come on down today and we'll scoop one for you!\r\n\r\nAxel's Food and Ice Cream\r\n\"Where theres something for everyone!\"\r\nhttp://AxelsFoodAndIceCream.com\r\nFollow Us on Twitter http://axelsnh.com/twitter\r\nBe Our Fan on Facebook http://axelsnh.com/facebook", "hosted_mp4": "q5AVhiwSY18.mp4", "subtitles": ""}, {"title": "How to Season a Turkey", "id": "v9nhysbsuVo", "url": "https://www.youtube.com/embed/v9nhysbsuVo?showinfo=0", "uploader": "wikiHow", "views": 599, "duration": 72, "description": "PRO TIP: Start seasoning a whole turkey the day before roasting for the most memorable flavor. \n\nYou can season a turkey with a variety of different flavors, as well as a little salt and pepper. Once you've seasoned the turkey, you can cook it according to your recipe.\n\r\nRead more: https://www.wikihow.com/Season-a-Turkey\n\r\nFollow our social media channels to find more interesting, easy, and helpful guides!\r\n\r\nFacebook: https://www.facebook.com/wikiHow/\r\nTwitter: https://twitter.com/wikiHow\r\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "v9nhysbsuVo.mp4", "subtitles": "to season a turkey try using a simple herb and butter mixture first place one stick of softened butter in a bowl then add 1 tablespoon or 2.5 grams each of your favorite chopped herbs like oregano thyme and parsley next add 1 teaspoon or 6 grams of salt and 1/4 teaspoon or 1/2 gram of black pepper stir the butter herbs and spices together until everything is blended then spread the mixture underneath the turkey skin on the breast and legs to make a seasoning rub for your turkey first combine 2 teaspoons or 12 grams each of salt dry thyme and dried rosemary in a bowl then add 1 tsp or two and a half grams each of dried sage and black pepper as well as one half teaspoon or one and a half grams of garlic powder brush the turkey with olive oil then rub the seasoning mixture into the skin with your hands for even more flavor season the inside of the turkey cavity with salt and pepperto season a turkey try using a simple herb and butter mixture first place one stick of softened butter in a bowl then add 1 tablespoon or 2.5 grams each of your favorite chopped herbs like oregano thyme and parsley next add 1 teaspoon or 6 grams of salt and 1/4 teaspoon or 1/2 gram of black pepper stir the butter herbs and spices together until everything is blended then spread the mixture underneath the turkey skin on the breast and legs to make a seasoning rub for your turkey first combine 2 teaspoons or 12 grams each of salt dry thyme and dried rosemary in a bowl then add 1 tsp or two and a half grams each of dried sage and black pepper as well as one half teaspoon or one and a half grams of garlic powder brush the turkey with olive oil then rub the seasoning mixture into the skin with your hands for even more flavor season the inside of the turkey cavity with salt and pepper"}, {"title": "How to Seed a Pomegranate By Hand", "id": "hQBCEBcDe0o", "url": "https://www.youtube.com/embed/hQBCEBcDe0o?showinfo=0", "uploader": "wikiHow", "views": 265, "duration": 49, "description": "Learn how to seed a pomegranate by hand with this guide from wikiHow: https://www.wikihow.com/Seed-a-Pomegranate\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "hQBCEBcDe0o.mp4", "subtitles": ""}, {"title": "How to Ship Foods with Dry Ice", "id": "leAZm2Idk-U", "url": "https://www.youtube.com/embed/leAZm2Idk-U", "uploader": "Guidecentral English", "views": 5554, "duration": 31, "description": "Learn how to ship foods with dry ice with this guide from wikiHow: https://www.wikihow.com/Ship-Foods-with-Dry-Ice\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "leAZm2Idk-U.mp4", "subtitles": "if you want to ship food with dry ice buy some at your local grocery store and make sure to wear gloves while you handle the dry ice wrap your food in plastic or paper to protect it then use newspaper or cellulose and thick layers of styrofoam to pack the food and the dry ice tightly together in a durable box keep track of how much dry ice you used in your package since you'll need to know that to fill out the shipping paperwork for help labeling your package read onif you want to ship food with dry ice buy some at your local grocery store and make sure to wear gloves while you handle the dry ice wrap your food in plastic or paper to protect it then use newspaper or cellulose and thick layers of styrofoam to pack the food and the dry ice tightly together in a durable box keep track of how much dry ice you used in your package since you'll need to know that to fill out the shipping paperwork for help labeling your package read on"}, {"title": "Quick Tip: How To Shred Meat", "id": "tHY3fahBJpg", "url": "https://www.youtube.com/embed/tHY3fahBJpg", "uploader": "Gooseberry Patch", "views": 50351, "duration": 55, "description": "Enjoy this In the Kitchen video from http://www.gooseberrypatch.com\n\nVickie & Jo Ann share their favorite quick tip for shredding pork, beef or chicken!", "hosted_mp4": "tHY3fahBJpg.mp4", "subtitles": "hi I'm Vicki and I'm Joann welcome to the gooseberry patch kitchen if you've ever looked for a quick tip to shred beef pork or chicken we've got a quick tip for you we've got a pork loin that we're using today that we've already cooked all you do is you take the other crock pot we put it on a nice little platter here and what people don't know is it's so easy just use two forks just kind of pull it apart look how beautiful that comes with these nice big chunks it's nice and moist and tender so I'm just going to go ahead and separate it a little bit you know you could cut it with a knife people can do it however they really like to do it but we think this is maybe our favorite that's all there is to it thanks for watching youhi I'm Vicki and I'm Joann welcome to the gooseberry patch kitchen if you've ever looked for a quick tip to shred beef pork or chicken we've got a quick tip for you we've got a pork loin that we're using today that we've already cooked all you do is you take the other crock pot we put it on a nice little platter here and what people don't know is it's so easy just use two forks just kind of pull it apart look how beautiful that comes with these nice big chunks it's nice and moist and tender so I'm just going to go ahead and separate it a little bit you know you could cut it with a knife people can do it however they really like to do it but we think this is maybe our favorite that's all there is to it thanks for watching you"}, {"title": "How to Squeeze a Lemon", "id": "ZJiEv6ipASM", "url": "https://www.youtube.com/embed/ZJiEv6ipASM?showinfo=0", "uploader": "wikiHow", "views": 3777, "duration": 68, "description": "Learn how to squeeze a lemon with this guide from wikiHow: https://www.wikihow.com/Squeeze-a-Lemon\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "ZJiEv6ipASM.mp4", "subtitles": ""}]