[{"title": "How to Make Salsa", "id": "vghLX86XnIA", "url": "https://www.youtube.com/embed/vghLX86XnIA?showinfo=0", "uploader": "wikiHow", "views": 61, "duration": 70, "description": "Learn How to Make Salsa with this guide from wikiHow: https://www.wikihow.com/Make-Salsa\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "vghLX86XnIA.mp4", "subtitles": "to make salsa first add one 28-ounce or 800 gram can of whole tomatoes to a blender or food processor then add 1/2 cup or 25 grams of chopped cilantro and 1/4 cup or 35 grams of chopped onion next place 1 minced garlic clove and 1 chopped jalapeno in the blender and sprinkle 1/2 TSP or 2 grams each of cumin and salt over all of the ingredients add the juice from half of a lime to for even more flavor finally pulse everything together 4 to 6 times or until the salsa is the consistency you'd like refrigerate for 1 hour then enjoy if you want to make salsa with fresh tomatoes instead of canned ones just add 3 cups or 375 grams of chopped roma tomatoes to the blender in place of the canned tomatoes add the other ingredients pulse everything 4 to 6 times and you're doneto make salsa first add one 28-ounce or 800 gram can of whole tomatoes to a blender or food processor then add 1/2 cup or 25 grams of chopped cilantro and 1/4 cup or 35 grams of chopped onion next place 1 minced garlic clove and 1 chopped jalapeno in the blender and sprinkle 1/2 TSP or 2 grams each of cumin and salt over all of the ingredients add the juice from half of a lime to for even more flavor finally pulse everything together 4 to 6 times or until the salsa is the consistency you'd like refrigerate for 1 hour then enjoy if you want to make salsa with fresh tomatoes instead of canned ones just add 3 cups or 375 grams of chopped roma tomatoes to the blender in place of the canned tomatoes add the other ingredients pulse everything 4 to 6 times and you're done"}, {"title": "How to Make Sausage Rolls", "id": "KxjucUoy9kQ", "url": "https://www.youtube.com/embed/KxjucUoy9kQ?showinfo=0", "uploader": "wikiHow", "views": 359, "duration": 136, "description": "Learn how to make sausage rolls with this guide from wikiHow: https://www.wikihow.com/Make-Sausage-Rolls\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "KxjucUoy9kQ.mp4", "subtitles": ""}, {"title": "How to Make Scrambled Eggs", "id": "uzUaym9zW3c", "url": "https://www.youtube.com/embed/uzUaym9zW3c?showinfo=0", "uploader": "wikiHow", "views": 612, "duration": 31, "description": "Learn How to Make Scrambled Eggs with this guide from wikiHow: https://www.wikihow.com/Make-Scrambled-Eggs\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "uzUaym9zW3c.mp4", "subtitles": "to make scrambled eggs start by beating eggs in a bowl with a whisk or fork use 2 eggs per serving if you want creamy scrambled eggs you can also mix in 1 and 1/2 tablespoon of milk or cream next heat some butter or oil in a pan over medium-high heat pour the eggs into the pan reduce the heat to low and stir the eggs while they cook for 3 to 4 minutes remove the pan from the heat and serveto make scrambled eggs start by beating eggs in a bowl with a whisk or fork use 2 eggs per serving if you want creamy scrambled eggs you can also mix in 1 and 1/2 tablespoon of milk or cream next heat some butter or oil in a pan over medium-high heat pour the eggs into the pan reduce the heat to low and stir the eggs while they cook for 3 to 4 minutes remove the pan from the heat and serve"}, {"title": "How to Make Spaghetti", "id": "PyPnUCy_TE8", "url": "https://www.youtube.com/embed/PyPnUCy_TE8?showinfo=0", "uploader": "wikiHow", "views": 213, "duration": 56, "description": "Learn How to Make Spaghetti with this guide from wikiHow: https://www.wikihow.com/Make-Spaghetti\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "PyPnUCy_TE8.mp4", "subtitles": "to make spaghetti add four quarts or 3.8 liters of water to a pot for every one pound or 0.45 kilograms of pasta you're making bring the water to a boil and add 1 tablespoon or 17 grams of salt to give it more flavor next add the noodles to the boiling water and stir them for one to two minutes so they don't stick together cook for a total of 8 to 12 minutes or until the spaghetti is al dente cooked but slightly firm in the center when you bite it drain into a colander if you like save about 1 cup or 240 milliliters of the cooking water to thin out your spaghetti sauce if it's too thick finally put the noodles back into the pot and pour your sauce on the top mix together and enjoyto make spaghetti add four quarts or 3.8 liters of water to a pot for every one pound or 0.45 kilograms of pasta you're making bring the water to a boil and add 1 tablespoon or 17 grams of salt to give it more flavor next add the noodles to the boiling water and stir them for one to two minutes so they don't stick together cook for a total of 8 to 12 minutes or until the spaghetti is al dente cooked but slightly firm in the center when you bite it drain into a colander if you like save about 1 cup or 240 milliliters of the cooking water to thin out your spaghetti sauce if it's too thick finally put the noodles back into the pot and pour your sauce on the top mix together and enjoy"}, {"title": "How to Make Sugar Candy", "id": "01LFEpc0X-U", "url": "https://www.youtube.com/embed/01LFEpc0X-U?showinfo=0", "uploader": "wikiHow", "views": 49613, "duration": 162, "description": "Learn how to make sugar candy with this guide from wikiHow: https://www.wikihow.com/Make-Sugar-Candy\n\nWe've included some products we think are useful for viewers. If you buy through any of these links, we will earn a small commission. \n\nLollipop Mold: https://amzn.to/2Sa0Yiw\n\n*As an Amazon Associate we earn from qualifying purchases.\n\n0:00 Making Lollipops\n0:53 Making Rock Candy\n1:33 Making Butterscotch Candy\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "01LFEpc0X-U.mp4", "subtitles": "[Music] you[Music] you [Music] you"}, {"title": "How to Make Tea", "id": "1HGk49Ylz1k", "url": "https://www.youtube.com/embed/1HGk49Ylz1k?showinfo=0", "uploader": "wikiHow", "views": 422, "duration": 58, "description": "Learn how to make tea with this guide from wikiHow: https://www.wikihow.com/Make-Tea\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "1HGk49Ylz1k.mp4", "subtitles": "to make tea from tea leaves start by placing the leaves in an infuser or strainer once filled place the tea strainer in a mug or tea pot then pour boiling water over it you want about 1 to 3 teaspoons of leaves for every 8 to 12 ounces of water depending on your preference for the strength and taste of your tea next allow the tea to steep a good rule of thumb is two minutes for green tea four minutes for black tea and five minutes for herbal tea once your tea is ready remove the strainer and serve adding lemon milk and sugar as desired for an even easier cup of tea you can just use a tea bag and pour boiling water directly over then let your tea steep until it is readyto make tea from tea leaves start by placing the leaves in an infuser or strainer once filled place the tea strainer in a mug or tea pot then pour boiling water over it you want about 1 to 3 teaspoons of leaves for every 8 to 12 ounces of water depending on your preference for the strength and taste of your tea next allow the tea to steep a good rule of thumb is two minutes for green tea four minutes for black tea and five minutes for herbal tea once your tea is ready remove the strainer and serve adding lemon milk and sugar as desired for an even easier cup of tea you can just use a tea bag and pour boiling water directly over then let your tea steep until it is ready"}, {"title": "How to Make Toffee Apples", "id": "rSWCjLDAICA", "url": "https://www.youtube.com/embed/rSWCjLDAICA?showinfo=0", "uploader": "wikiHow", "views": 126, "duration": 73, "description": "Learn how to make toffee apples with this guide from wikiHow: https://www.wikihow.com/Make-Toffee-Apples\n\n0:00 Prepping Your Apples\n0:25 Making the Toffee\n0:45 Dipping and Drying the Apples\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "rSWCjLDAICA.mp4", "subtitles": ""}, {"title": "How to make Tomato Puree", "id": "lQsikcqdREI", "url": "https://www.youtube.com/embed/lQsikcqdREI", "uploader": "Aromatic Kitchen", "views": 287527, "duration": 49, "description": "Thanks for watching the video !!\r\nMake a cross at the end of the Tomato with a sharp knife.\r\nImmerse the Tomatoes in boiling water.\r\nWhen the skin separates from the flesh,take the tomatoes out. Let it cool.\r\nRemove the skin gently using a thin sharp knife .\r\nCut the tomato's red outer surface. Avoid the seed and inside portion to get the desired red color.\r\nSaute the tomato flesh in a nonstick pan .You can add the tomato juice from inside for more flavour.\r\nWhen they are of a very thick consistency , turn off the heat , let it cool & blend them into a smooth thick tomato puree.\r\n\r\nTaken From   http://aromatickitchen.blogspot.com/2008/12/how-to-make-tomato-puree.html", "hosted_mp4": "lQsikcqdREI.mp4", "subtitles": ""}, {"title": "How to Make Tostada Shells", "id": "g_RWiUkw9FY", "url": "https://www.youtube.com/embed/g_RWiUkw9FY", "uploader": "Guidecentral English", "views": 598, "duration": 24, "description": "Learn how to make tostada shells with this guide from wikiHow: https://www.wikihow.com/Make-Tostada-Shells\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "g_RWiUkw9FY.mp4", "subtitles": ""}, {"title": "How to Make Waffles", "id": "2zBdrc9n6ck", "url": "https://www.youtube.com/embed/2zBdrc9n6ck?showinfo=0", "uploader": "wikiHow", "views": 127, "duration": 77, "description": "Learn How to Make Waffles with this guide from wikiHow: https://www.wikihow.com/Make-Waffles\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "2zBdrc9n6ck.mp4", "subtitles": "to make waffles first pre-heat your waffle iron then add two eggs to a large bowl and beat them with a whisk or hand mixer until they're fluffy beating the eggs first we'll make your waffles light and airy add 2 cups 260 grams of all-purpose flour 1 in 3/4 cups 415 milliliters of milk and half a cup 120 milliliters of vegetable oil to the bowl next add 1 tablespoon 12 and 1/2 grams of sugar 4 teaspoons 15 grams of baking powder and 1/4 teaspoon 1 and 1/2 grams of salt pour in 1/2 teaspoon 2.5 milliliters of vanilla extract then beat the ingredients just until smooth avoid over beating the batter or else your waffles may turn out dense finally spray your preheated waffle iron with cooking spray and pour some of the batter onto it making sure not to over fill the moulds cook the waffles until they're golden brown about 5 minutes and enjoyto make waffles first pre-heat your waffle iron then add two eggs to a large bowl and beat them with a whisk or hand mixer until they're fluffy beating the eggs first we'll make your waffles light and airy add 2 cups 260 grams of all-purpose flour 1 in 3/4 cups 415 milliliters of milk and half a cup 120 milliliters of vegetable oil to the bowl next add 1 tablespoon 12 and 1/2 grams of sugar 4 teaspoons 15 grams of baking powder and 1/4 teaspoon 1 and 1/2 grams of salt pour in 1/2 teaspoon 2.5 milliliters of vanilla extract then beat the ingredients just until smooth avoid over beating the batter or else your waffles may turn out dense finally spray your preheated waffle iron with cooking spray and pour some of the batter onto it making sure not to over fill the moulds cook the waffles until they're golden brown about 5 minutes and enjoy"}, {"title": "How to Measure Flour", "id": "K-8keGk2rJ4", "url": "https://www.youtube.com/embed/K-8keGk2rJ4", "uploader": "Guidecentral English", "views": 42, "duration": 31, "description": "Learn how to measure flour with this guide from wikiHow: https://www.wikihow.com/Measure-Flour\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "K-8keGk2rJ4.mp4", "subtitles": "before you measure unsifted flour use a spoon to stir the flour in the original container to fluff it up then spoon the flour into your measuring cup until the cup is slightly more full do not pack the flour into the cup use a straight edge such as the back of a knife to level off the top of the flower by running it against the rim of the cup hold the measuring cup over the flour container so the excess flour drops back in youbefore you measure unsifted flour use a spoon to stir the flour in the original container to fluff it up then spoon the flour into your measuring cup until the cup is slightly more full do not pack the flour into the cup use a straight edge such as the back of a knife to level off the top of the flower by running it against the rim of the cup hold the measuring cup over the flour container so the excess flour drops back in you"}, {"title": "How to Melt Almond Bark", "id": "pubofzgti_M", "url": "https://www.youtube.com/embed/pubofzgti_M", "uploader": "Guidecentral English", "views": 364, "duration": 29, "description": "Learn how to melt almond bark with this guide from wikiHow: https://www.wikihow.com/Melt-Almond-Bark\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "pubofzgti_M.mp4", "subtitles": "to melt almond bark in a double boiler chop it into small pieces that are roughly the same size so the chocolate will melt evenly fill the bottom of the double boiler with water and place the almond bark in the top part of the double boiler turn your stove to medium-high heat stirring the almond bar constantly until it melts when all of the chunks are melted turn the heat off and remove the top pan from the double boilerto melt almond bark in a double boiler chop it into small pieces that are roughly the same size so the chocolate will melt evenly fill the bottom of the double boiler with water and place the almond bark in the top part of the double boiler turn your stove to medium-high heat stirring the almond bar constantly until it melts when all of the chunks are melted turn the heat off and remove the top pan from the double boiler"}, {"title": "How to Melt Butter", "id": "Aiymgo5cz-Y", "url": "https://www.youtube.com/embed/Aiymgo5cz-Y", "uploader": "Guidecentral English", "views": 302, "duration": 36, "description": "Learn how to melt butter with this guide from wikiHow: https://www.wikihow.com/Melt-Butter\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "Aiymgo5cz-Y.mp4", "subtitles": ""}, {"title": "How to Melt Cheddar Cheese", "id": "n3PryQKJfn0", "url": "https://www.youtube.com/embed/n3PryQKJfn0?showinfo=0", "uploader": "wikiHow", "views": 161331, "duration": 72, "description": "Learn how to melt cheddar cheese with this guide from wikiHow: https://www.wikihow.com/Melt-Cheddar-Cheese\n\n0:00 Melting in the Microwave\n0:30 Melting on the Stovetop \n0:45 Steaming the Cheese \n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "n3PryQKJfn0.mp4", "subtitles": ""}, {"title": "How to Melt Chocolate", "id": "Rg1XZfF-ybc", "url": "https://www.youtube.com/embed/Rg1XZfF-ybc?showinfo=0", "uploader": "wikiHow", "views": 615, "duration": 33, "description": "This sweet video will give you some tips on #howto melt chocolate!\n\nRead more: https://www.wikihow.com/Melt-Chocolate\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "Rg1XZfF-ybc.mp4", "subtitles": "if you want to melt chocolate in a microwave place the chocolate into a microwave-safe bowl microwave the chocolate on low heat for 30 to 40 seconds or for about 10 to 15 seconds if you are using small chocolate chips stir the chocolate with a wooden spoon then a microwave for an additional 10 to 15 seconds be careful not to overcook the chocolate or it will become scorched and unusable stir again then continue microwaving in 10 second bursts until the chocolate is fully meltedif you want to melt chocolate in a microwave place the chocolate into a microwave-safe bowl microwave the chocolate on low heat for 30 to 40 seconds or for about 10 to 15 seconds if you are using small chocolate chips stir the chocolate with a wooden spoon then a microwave for an additional 10 to 15 seconds be careful not to overcook the chocolate or it will become scorched and unusable stir again then continue microwaving in 10 second bursts until the chocolate is fully melted"}, {"title": "How to Open a Coconut", "id": "zSv-RzesjYo", "url": "https://www.youtube.com/embed/zSv-RzesjYo?showinfo=0", "uploader": "wikiHow", "views": 2501, "duration": 38, "description": "The only video you need to learn #howto open a coconut.\n\nRead more: https://www.wikihow.com/Open-a-Coconut\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "zSv-RzesjYo.mp4", "subtitles": "to open a coconut start by poking a hole in the top with a knife and draining out all the water then bake the coconut in the oven at 375 degrees Fahrenheit 190 degrees Celsius for 10 minutes or until a crack forms in the shell once the shell is cracked take the coconut out of the oven and put it in a plastic bag then hit the bag against a hard surface until the coconut breaks opento open a coconut start by poking a hole in the top with a knife and draining out all the water then bake the coconut in the oven at 375 degrees Fahrenheit 190 degrees Celsius for 10 minutes or until a crack forms in the shell once the shell is cracked take the coconut out of the oven and put it in a plastic bag then hit the bag against a hard surface until the coconut breaks open"}, {"title": "How to Oven Cook Sausages", "id": "_jkb00J6rZY", "url": "https://www.youtube.com/embed/_jkb00J6rZY", "uploader": "Guidecentral English", "views": 360, "duration": 36, "description": "Learn how to oven cook sausages with this guide from wikiHow: https://www.wikihow.com/Oven-Cook-Sausages\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "_jkb00J6rZY.mp4", "subtitles": "to oven cooked sausages take them out of the fridge 20 minutes before you want to bake them preheat your oven to 350 degrees fahrenheit and line a shallow baking pan with foil if the sausages are linked together cut them apart with scissors then put them in the pan be sure to space them evenly apart bake the meat for 20 minutes then cut into one of the sausages to make sure it's browned all the way through if it's still pink inside bake the sausages for 10 more minutes then enjoyto oven cooked sausages take them out of the fridge 20 minutes before you want to bake them preheat your oven to 350 degrees fahrenheit and line a shallow baking pan with foil if the sausages are linked together cut them apart with scissors then put them in the pan be sure to space them evenly apart bake the meat for 20 minutes then cut into one of the sausages to make sure it's browned all the way through if it's still pink inside bake the sausages for 10 more minutes then enjoy"}, {"title": "How to Oven Dry Bread", "id": "Oy4bxmlvQ04", "url": "https://www.youtube.com/embed/Oy4bxmlvQ04?showinfo=0", "uploader": "wikiHow", "views": 1486, "duration": 45, "description": "Learn how to oven dry bread with this guide from wikiHow: https://www.wikihow.com/Oven-Dry-Bread\n\n0:00 Cutting the Bread\n0:18 Toasting and Storing\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "Oy4bxmlvQ04.mp4", "subtitles": "[Music] [Music] you [Music]"}, {"title": "How to Pan Fry Salmon", "id": "OFNu_5jxLu0", "url": "https://www.youtube.com/embed/OFNu_5jxLu0", "uploader": "Guidecentral English", "views": 1001, "duration": 33, "description": "Learn how to pan fry salmon with this guide from wikiHow: https://www.wikihow.com/Pan-Fry-Salmon\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "OFNu_5jxLu0.mp4", "subtitles": "to pan fry salmon pat the fish dry with paper towels then drizzle the fillets with olive oil and sprinkle them with salt and pepper when you place the salmon in your pan place it skin side down if you want to have crispy salmon skin if you don't plan to serve the skin on the fish place it into the pan skin side up cook the salmon for two minutes on each side on medium heat and use a spatula to press the fish down during the first one to two minutes of cooking so it doesn't curl up let the salmon rest for about 5 minutes before servingto pan fry salmon pat the fish dry with paper towels then drizzle the fillets with olive oil and sprinkle them with salt and pepper when you place the salmon in your pan place it skin side down if you want to have crispy salmon skin if you don't plan to serve the skin on the fish place it into the pan skin side up cook the salmon for two minutes on each side on medium heat and use a spatula to press the fish down during the first one to two minutes of cooking so it doesn't curl up let the salmon rest for about 5 minutes before serving"}, {"title": "How to Parboil Potatoes", "id": "L8M6vAhUHFA", "url": "https://www.youtube.com/embed/L8M6vAhUHFA?showinfo=0", "uploader": "wikiHow", "views": 11245, "duration": 46, "description": "Learn how to parboil potatoes with this guide from wikiHow: https://www.wikihow.com/Parboil-Potatoes\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "L8M6vAhUHFA.mp4", "subtitles": "to parboil potatoes first wash the potatoes and peel off the skin if you'd like them to be skinless then cut the potatoes into equal size pieces place the potatoes in a wide saucepan and fill the pan with enough cold water to just cover the potatoes bring the water to a rolling boil over high heat then turn the heat off let the potatoes sit in the pan for 5 minutes finally drain the water and transfer the potatoes to a plate to cool store your parboiled potatoes in the refrigerator until you're ready to use them youto parboil potatoes first wash the potatoes and peel off the skin if you'd like them to be skinless then cut the potatoes into equal size pieces place the potatoes in a wide saucepan and fill the pan with enough cold water to just cover the potatoes bring the water to a rolling boil over high heat then turn the heat off let the potatoes sit in the pan for 5 minutes finally drain the water and transfer the potatoes to a plate to cool store your parboiled potatoes in the refrigerator until you're ready to use them you to parboil potatoes first wash the potatoes and peel off the skin if you'd like them to be skinless then cut the potatoes into equal size pieces place the potatoes in a wide saucepan and fill the pan with enough cold water to just cover the potatoes bring the water to a rolling boil over high heat then turn the heat off let the potatoes sit in the pan for 5 minutes finally drain the water and transfer the potatoes to a plate to cool store your parboiled potatoes in the refrigerator until you're ready to use them you"}]