[{"title": "How to Store Cilantro", "id": "myfGWbjltg0", "url": "https://www.youtube.com/embed/myfGWbjltg0?showinfo=0", "uploader": "wikiHow", "views": 270, "duration": 34, "description": "Learn How to Store Cilantro with this guide from wikiHow: https://www.wikihow.com/Store-Cilantro\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "myfGWbjltg0.mp4", "subtitles": "to store cilantro in the refrigerator use kitchen shears to trim about one inch off of the bottom of the stems then fill a glass jar nearly halfway with cool water place the cilantro into the jar making sure only the stems are submerged loosely cover the leaves with a plastic bag to keep in my stir you can also secure the bag to the jar with a rubber band store the cilantro in the refrigerator for up to two weeks replacing the water every two to three daysto store cilantro in the refrigerator use kitchen shears to trim about one inch off of the bottom of the stems then fill a glass jar nearly halfway with cool water place the cilantro into the jar making sure only the stems are submerged loosely cover the leaves with a plastic bag to keep in my stir you can also secure the bag to the jar with a rubber band store the cilantro in the refrigerator for up to two weeks replacing the water every two to three days"}, {"title": "How to Store Fresh Garlic", "id": "maCNg8DJ0s4", "url": "https://www.youtube.com/embed/maCNg8DJ0s4?showinfo=0", "uploader": "wikiHow", "views": 16990, "duration": 27, "description": "This quick video will give you some tips on #howto store fresh garlic!\n\nRead more: https://www.wikihow.com/Store-Fresh-Garlic\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "maCNg8DJ0s4.mp4", "subtitles": "to store fresh garlic put it in something that's well-ventilated like a wire basket or a bowl with holes in it then find a dark dry spot to put the garlic like a kitchen cupboard if you're looking for long-term storage wrap the garlic in plastic wrap toss it in a freezer bag and then place it in the freezerto store fresh garlic put it in something that's well-ventilated like a wire basket or a bowl with holes in it then find a dark dry spot to put the garlic like a kitchen cupboard if you're looking for long-term storage wrap the garlic in plastic wrap toss it in a freezer bag and then place it in the freezer"}, {"title": "How to Taste Wine | wikiHow Asks a Certified Wine Consultant", "id": "Hv4qL65QgPs", "url": "https://www.youtube.com/embed/Hv4qL65QgPs?showinfo=0", "uploader": "wikiHow", "views": 1053, "duration": 289, "description": "Learn more about how to taste wine and develop your palate from certified wine consultant, Murphy Perng. Read more in this guide from wikiHow: https://www.wikihow.com/Taste-Wine\n\n---\nMurphy Perng is a Wine Consultant and the Founder and Host of Matter of Wine, a business that produces educational wine events, including team-building experiences and networking events. Based in Los Angeles, California, Murphy has collaborated with brands such as Equinox, Buzzfeed, WeWork, and Stage & Table, to name a few. Murphy possesses her WSET (Wine & Spirit Education Trust) Level 3 Advanced Certification.\nLearn more: https://matterofwine.com/\n\n---\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "Hv4qL65QgPs.mp4", "subtitles": ""}, {"title": "How to Tell if a Pineapple Is Ripe", "id": "MS_9E8sGDOk", "url": "https://www.youtube.com/embed/MS_9E8sGDOk?showinfo=0", "uploader": "wikiHow", "views": 4494, "duration": 44, "description": "Learn How to Tell if a Pineapple Is Ripe with this guide from wikiHow: https://www.wikihow.com/Tell-if-a-Pineapple-Is-Ripe\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "MS_9E8sGDOk.mp4", "subtitles": "to tell if a pineapple is ripe first look at the color of its rind the more yellow the rind is the riper the pineapple will be a pineapple that's a golden yellow color from top to bottom is perfect if the rind is green the pineapple isn't ripe enough but if it's dark orange the pineapple is too ripe you can also tell if a pineapple is ripe by squeezing it if the rind feels slightly soft its ripe but if it's tough and solid the pineapple isn't ripe enough yet finally try smelling the bottom of the pineapple to see how ripe it is if it smells fruity and sweet it's probably ripe but if it smells like vinegar the pineapple is likely overripeto tell if a pineapple is ripe first look at the color of its rind the more yellow the rind is the riper the pineapple will be a pineapple that's a golden yellow color from top to bottom is perfect if the rind is green the pineapple isn't ripe enough but if it's dark orange the pineapple is too ripe you can also tell if a pineapple is ripe by squeezing it if the rind feels slightly soft its ripe but if it's tough and solid the pineapple isn't ripe enough yet finally try smelling the bottom of the pineapple to see how ripe it is if it smells fruity and sweet it's probably ripe but if it smells like vinegar the pineapple is likely overripe"}, {"title": "How to Tell if an Avocado Is Ripe", "id": "6CuRjETqyjI", "url": "https://www.youtube.com/embed/6CuRjETqyjI?showinfo=0", "uploader": "wikiHow", "views": 780, "duration": 30, "description": "This quick video will give you some tips on how to tell if an avocado is ripe!\n\nRead more: https://www.wikihow.com/Tell-if-an-Avocado-Is-Ripe\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "6CuRjETqyjI.mp4", "subtitles": ""}, {"title": "How to Temper Chocolate", "id": "rDbAApat2bw", "url": "https://www.youtube.com/embed/rDbAApat2bw?showinfo=0", "uploader": "wikiHow", "views": 342, "duration": 48, "description": "One cannot simply melt chocolate and then expect it to return to its original glossy, firm state! For chocolate to return to this state it has to be heated and cooled to allow a certain type of crystal (crystal V) to develop. This heating and cooling process is called tempering and it can be done in a number of different ways.\n\nThis quick video will give you some tips on how to give your chocolate creations the perfect shine and snap!\r\n\r\nRead more: https://www.wikihow.com/Temper-Chocolate\r\n\r\nFollow our social media channels to find more interesting, easy, and helpful guides!\r\n\r\nFacebook: https://www.facebook.com/wikiHow/\r\nTwitter: https://twitter.com/wikiHow\r\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "rDbAApat2bw.mp4", "subtitles": "if you want to temper chocolate first fill a large bowl with ice water then place about 2/3 of your chocolate into a second dry bowl heat the bowl of chocolate on top of a pot of water that's simmering but not boiling until the chocolate reaches 110 degrees Fahrenheit 43 degrees Celsius then place the bowl of melted chocolate inside of the bowl of ice water stir the chocolate slowly but constantly until the chocolate cools to 95 degrees Fahrenheit 35 degrees Celsius remove the bowl from the ice water and add the remaining third of your chocolate stir until the chocolate is well combined and smoothif you want to temper chocolate first fill a large bowl with ice water then place about 2/3 of your chocolate into a second dry bowl heat the bowl of chocolate on top of a pot of water that's simmering but not boiling until the chocolate reaches 110 degrees Fahrenheit 43 degrees Celsius then place the bowl of melted chocolate inside of the bowl of ice water stir the chocolate slowly but constantly until the chocolate cools to 95 degrees Fahrenheit 35 degrees Celsius remove the bowl from the ice water and add the remaining third of your chocolate stir until the chocolate is well combined and smooth"}, {"title": "Cupcakes: How to Test your Butter & Oil for Freshness", "id": "3cPuJkvkdhI", "url": "https://www.youtube.com/embed/3cPuJkvkdhI", "uploader": "CuriositySatisfiedi", "views": 825, "duration": 56, "description": "http://www.cupcakeaffair.com/ How can you tell if your butter or oil is okay to use? Find out in this video. Feed your cupcake curiosity and discover how to pave the way into anyone's heart by watching videos from \"A Cupcake Affair\", the cupcake book by The Cupcake Chef, Isabella Anjuli. Now available on Amazon.com.", "hosted_mp4": "3cPuJkvkdhI.mp4", "subtitles": ""}, {"title": "How to Properly Quick Thaw Frozen Fish", "id": "_nLsoFNsxHk", "url": "https://www.youtube.com/embed/_nLsoFNsxHk", "uploader": "The Better Fish", "views": 308077, "duration": 54, "description": "Having frozen fish on hand is a great way to enjoy delicious, healthful lean protein whenever you want. Australis Barramundi is packaged to thaw beautifully and safely, giving you a great piece of fish to work with. \n\nKey Takeaways \n+ Start with the fish solidly frozen. Don't pre-thaw in the fridge.\n+ Don't remove the vacuum-packaging before thawing. Thawing fish \"naked\" under water makes it waterlogged.\n+ Use only cold tap water to thaw as this minimizes the risk of bacterial growth. \n+ Remove packaging as soon as it's thawed and use the thawed fish immediately to ensure best results!\n\nPlanning to thaw the fish in your refrigerator overnight? Make sure to remove the vacuum-packaging BEFORE you let it thaw and place the fillets on a paper towel-lined plate. \n\nWhere to Buy Australis Barramundi\nhttp://better.fish/storelocator\n\n\n= = = = = = = = = = = = = = = = = \n\nCheck out our other helpful cooking how-to's: \n\nHow to Roast Fish Straight from the Freezer - https://youtu.be/-pay1VqtrWQ\n\nHow to Grill Fish Like a Pro - https://youtu.be/MD_OeXuGRgM\n\nHow to Perfectly Pan Sear Fish - https://youtu.be/ZGK9QQ2rKRc\n\nHow to Shallow Fry Fish at Home - https://youtu.be/K45aQ-LAjyk\n\n= = = = = = = = = = = = = = = = = \n\nFill up on other great fish recipes and sustainable seafood knowledge at TheBetterFish.com\n\nFacebook - http://www.facebook.com/thebetterfish\nInstagram - http://www.instagram.com/thebetterfish\nTwitter - http://www.twitter.com/thebetterfish", "hosted_mp4": "_nLsoFNsxHk.mp4", "subtitles": ""}, {"title": "How to Thicken Beef Stew", "id": "MNDamzWjb2Y", "url": "https://www.youtube.com/embed/MNDamzWjb2Y?showinfo=0", "uploader": "wikiHow", "views": 6029, "duration": 54, "description": "Learn how to thicken beef stew with this guide from wikiHow: https://www.wikihow.com/Thicken-Beef-Stew\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "MNDamzWjb2Y.mp4", "subtitles": "Lease this and sayLease this and say Lease this and sayFirst mix 1 tablespoon 5 a 6First mix 1 tablespoon 5 a 6 First mix 1 tablespoon 5 a 6now for our now star fuse 1 tablespoonnow for our now star fuse 1 tablespoon now for our now star fuse 1 tablespoonLifting we are sure World photo pasteLifting we are sure World photo paste Lifting we are sure World photo pasteall straight paste into this to pink up throughall straight paste into this to pink up through all straight paste into this to pink up throughnormal face off distributionnormal face off distribution normal face off distributionpano sheep bathing pliers of legs in to do thispano sheep bathing pliers of legs in to do this pano sheep bathing pliers of legs in to do thisJennetteJennette JennetteChecker stereoman Blake Ramses 20 steps to do do meChecker stereoman Blake Ramses 20 steps to do do me Checker stereoman Blake Ramses 20 steps to do do meno Blue European Process Adano Blue European Process Ada no Blue European Process Ada&amp; Pureway Bagstie net&amp; Pureway Bagstie net &amp; Pureway Bagstie net1 rr Shonste Jean Eve ostu Anchor Boo Boo Meeher Hime &amp;1 rr Shonste Jean Eve ostu Anchor Boo Boo Meeher Hime &amp; 1 rr Shonste Jean Eve ostu Anchor Boo Boo Meeher Hime &amp;summer dx sendra Tsu"}, {"title": "How to Thicken Soup", "id": "XfcAnStitIU", "url": "https://www.youtube.com/embed/XfcAnStitIU", "uploader": "Guidecentral English", "views": 1283, "duration": 35, "description": "Learn how to thicken soup with this guide from wikiHow: https://www.wikihow.com/Thicken-Soup\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "XfcAnStitIU.mp4", "subtitles": "if you want to thicken soup you can add a creamy element like cream yogurt or coconut milk to the soup then simmer the soup gently for about 10 minutes if you'd rather use starch to thicken your soup you can add chunks of bread to your soup and simmer it until the bread dissolves or you can make a slurry out of cool water and cornstarch then add it to the soup and simmer for an extra 10 minutes if you're making a potato soup or a chowder try adding instant potato flakes to thicken your soupif you want to thicken soup you can add a creamy element like cream yogurt or coconut milk to the soup then simmer the soup gently for about 10 minutes if you'd rather use starch to thicken your soup you can add chunks of bread to your soup and simmer it until the bread dissolves or you can make a slurry out of cool water and cornstarch then add it to the soup and simmer for an extra 10 minutes if you're making a potato soup or a chowder try adding instant potato flakes to thicken your soup"}, {"title": "How to Treat Apple Cider Vinegar Burns", "id": "AoT1LwW2fuo", "url": "https://www.youtube.com/embed/AoT1LwW2fuo?showinfo=0", "uploader": "wikiHow", "views": 6533, "duration": 48, "description": "Learn how to treat apple cider vinegar burns with this guide from wikiHow: https://www.wikihow.com/Treat-Apple-Cider-Vinegar-Burns\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "AoT1LwW2fuo.mp4", "subtitles": "apple cider vinegar is used in a variety of home remedies but it can cause burns if you apply it to your skin undiluted for prolonged periods of time to treat an apple cider vinegar burn first rinse the area with cool water for 20 minutes to soothe your skin and flush away any remaining vinegar then apply aloe vera gel to the burn and loosely cover the area with sterilized gauze watch for signs of infection while your burn is healing like redness pus swelling or your skin feeling hot to the touch talk to a doctor if you think your burn is infectedapple cider vinegar is used in a variety of home remedies but it can cause burns if you apply it to your skin undiluted for prolonged periods of time to treat an apple cider vinegar burn first rinse the area with cool water for 20 minutes to soothe your skin and flush away any remaining vinegar then apply aloe vera gel to the burn and loosely cover the area with sterilized gauze watch for signs of infection while your burn is healing like redness pus swelling or your skin feeling hot to the touch talk to a doctor if you think your burn is infected"}, {"title": "How to Use Agar Agar", "id": "bbawyOZuAZ8", "url": "https://www.youtube.com/embed/bbawyOZuAZ8?showinfo=0", "uploader": "wikiHow", "views": 37377, "duration": 86, "description": "Learn how to use Agar Agar with this guide from wikiHow: https://www.wikihow.com/Use-Agar-Agar\n\n0:00 Preparing Agar-Agar\n0:43 Ways to Use Agar-Agar in Cooking\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "bbawyOZuAZ8.mp4", "subtitles": "[Music] you"}, {"title": "How to use Green Tea Leaves for Fertilizer", "id": "BqHtxrQYuiY", "url": "https://www.youtube.com/embed/BqHtxrQYuiY", "uploader": "greentealivingbook", "views": 11114, "duration": 21, "description": "How to use your leftover Green Tea Leaves as fertilizer!", "hosted_mp4": "BqHtxrQYuiY.mp4", "subtitles": "after drinking green tea don't throw away the leaves you can use the leftover leaves for fertilizing your flowers or vegetable garden mix the green tea leaves into dirt for gardening and you can put the green tea leaves in planters and flowerpots alsoafter drinking green tea don't throw away the leaves you can use the leftover leaves for fertilizing your flowers or vegetable garden mix the green tea leaves into dirt for gardening and you can put the green tea leaves in planters and flowerpots also"}, {"title": "How to Wash Dishes", "id": "WbZ7QcamCdc", "url": "https://www.youtube.com/embed/WbZ7QcamCdc?showinfo=0", "uploader": "wikiHow", "views": 3497, "duration": 35, "description": "This quick video will show you #howto properly wash dishes!\n\nRead more: https://www.wikihow.com/Wash-Dishes\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "WbZ7QcamCdc.mp4", "subtitles": "to wash dishes by hand start by scraping any leftover food into the trash then place the empty dishes in the sink and fill the sink with hot water and dish soap next use a sponge or dish cloth to scrub the dishes underwater working on one dish at a time when you're finished scrubbing a dish double check it for any stuck on food before rinsing it off with clean hot water finally let your clean dishes air dry on a drying rack or a clean towelto wash dishes by hand start by scraping any leftover food into the trash then place the empty dishes in the sink and fill the sink with hot water and dish soap next use a sponge or dish cloth to scrub the dishes underwater working on one dish at a time when you're finished scrubbing a dish double check it for any stuck on food before rinsing it off with clean hot water finally let your clean dishes air dry on a drying rack or a clean towel"}, {"title": "Cleaning Vegetables and Fruits With Lemon Essential Oil", "id": "h6zo_7nvwNU", "url": "https://www.youtube.com/embed/h6zo_7nvwNU", "uploader": "yvonneplewis", "views": 15931, "duration": 59, "description": "http://www.essential-natural-remedies.com/green-household-products.html --How you can use lemon essential oil to clean vegetables and fruit. Great for cleaning vegetables like broccoli and cauliflower. Clean fruit like strawberries, blackberries and grapes", "hosted_mp4": "h6zo_7nvwNU.mp4", "subtitles": "I would like to show you how you can use lemon essential oil to clean fruits and vegetables once you have done taking off your fruit and done your initial rinse of the fruit filled the bowl back up with water lean water and drop in about two to three drops of lemon essential oil lemon oil is known to be able to dissolve petrochemicals so it is phenomenal to be able to use it with fruits and vegetables to get off pesticides and herbicides that color the fruit blend it in a bit with the water lemon essential oil tends to float on the water so you need to agitate it and let it sit for a few minutes give it one more rinse and you have wonderful fresh tasting vegetables and fruitI would like to show you how you can use lemon essential oil to clean fruits and vegetables once you have done taking off your fruit and done your initial rinse of the fruit filled the bowl back up with water lean water and drop in about two to three drops of lemon essential oil lemon oil is known to be able to dissolve petrochemicals so it is phenomenal to be able to use it with fruits and vegetables to get off pesticides and herbicides that color the fruit blend it in a bit with the water lemon essential oil tends to float on the water so you need to agitate it and let it sit for a few minutes give it one more rinse and you have wonderful fresh tasting vegetables and fruit"}, {"title": "How to Wash Grapes", "id": "UWNDqxeHY9o", "url": "https://www.youtube.com/embed/UWNDqxeHY9o", "uploader": "Guidecentral English", "views": 2546, "duration": 31, "description": "Learn how to wash grapes with this guide from wikiHow: https://www.wikihow.com/Wash-Grapes\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "UWNDqxeHY9o.mp4", "subtitles": "to wash grapes hold them under running water for 30 seconds rubbing them gently as you rinse them off then put your grapes in a clean bowl and fill the bowl with cool clean water until the grapes are completely covered allow them to soak for 5 to 10 minutes in the water to get rid of pesticides and bacteria if you want to remove 98 of bacteria combine 3 parts vinegar to 1 part water and soak the grapes in that instead be sure to rinse the grapes off with clean water before you enjoy themto wash grapes hold them under running water for 30 seconds rubbing them gently as you rinse them off then put your grapes in a clean bowl and fill the bowl with cool clean water until the grapes are completely covered allow them to soak for 5 to 10 minutes in the water to get rid of pesticides and bacteria if you want to remove 98 of bacteria combine 3 parts vinegar to 1 part water and soak the grapes in that instead be sure to rinse the grapes off with clean water before you enjoy them"}, {"title": "How to Whisk Eggs", "id": "1J4ebqqeG2M", "url": "https://www.youtube.com/embed/1J4ebqqeG2M?showinfo=0", "uploader": "wikiHow", "views": 12356, "duration": 29, "description": "Learn How to Whisk Eggs with this guide from wikiHow: https://www.wikihow.com/Whisk-Eggs\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "1J4ebqqeG2M.mp4", "subtitles": "E juice and suggests lamentable has beenE juice and suggests lamentable has been E juice and suggests lamentable has beenused to wish I'd stayed with circularused to wish I'd stayed with circular used to wish I'd stayed with circularMotion and listening and What's the westMotion and listening and What's the west Motion and listening and What's the westof food artemiss every so often to makeof food artemiss every so often to make of food artemiss every so often to makemore about missiles on the table viewmore about missiles on the table view more about missiles on the table viewfree health is perfectly clear waterfree health is perfectly clear water free health is perfectly clear waterlevels and interest because i speak withlevels and interest because i speak with levels and interest because i speak without in term is made from when you get toout in term is made from when you get to out in term is made from when you get toWhere are edible and that I"}, {"title": "How to Wrap a Burger", "id": "awgAoZWEuwM", "url": "https://www.youtube.com/embed/awgAoZWEuwM?showinfo=0", "uploader": "wikiHow", "views": 39508, "duration": 82, "description": "Learn how to wrap a burger with this guide from wikiHow: https://www.wikihow.com/Wrap-a-Burger\n\n0:00 Wrapping a Burger in Paper or Foil\n0:28 Making a Lettuce Wrap\n0:48 Using a Tortilla as a Wrap\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "awgAoZWEuwM.mp4", "subtitles": ""}, {"title": "How to Zest a Lime", "id": "XMW6ZnHW6NU", "url": "https://www.youtube.com/embed/XMW6ZnHW6NU?showinfo=0", "uploader": "wikiHow", "views": 1000, "duration": 24, "description": "Learn How to Zest a Lime with this guide from wikiHow: https://www.wikihow.com/Zest-a-Lime\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "XMW6ZnHW6NU.mp4", "subtitles": "to zest a lime start by washing it with cool water then hold a grater above the cutting board so it's at a 45-degree angle and gently drag the lime across it go from the top of the grater to the bottom rotate the lime after each stroke before dragging it across the grater again once you've graded off all of the green peel scrape the pile of zest on the cutting board into a bowl and add it to your recipeto zest a lime start by washing it with cool water then hold a grater above the cutting board so it's at a 45-degree angle and gently drag the lime across it go from the top of the grater to the bottom rotate the lime after each stroke before dragging it across the grater again once you've graded off all of the green peel scrape the pile of zest on the cutting board into a bowl and add it to your recipe"}, {"title": "How to Grill Flank Steak", "id": "ZlqhE5easgg", "url": "https://www.youtube.com/embed/ZlqhE5easgg?showinfo=0", "uploader": "wikiHow", "views": 53, "duration": 85, "description": "Learn how to grill flank steak with this guide from wikiHow: https://www.wikihow.com/Grill-Flank-Steak\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "ZlqhE5easgg.mp4", "subtitles": ""}]