[{"title": "How to Peel a Sweet Potato", "id": "2pqDr0NEZA0", "url": "https://www.youtube.com/embed/2pqDr0NEZA0?showinfo=0", "uploader": "wikiHow", "views": 605, "duration": 52, "description": "Learn how to peel a sweet potato with this guide from wikiHow: https://www.wikihow.com/Peel-a-Sweet-Potato\n\n0:00 Peeling Uncooked Sweet Potatoes\n0:30 Peeling Boiled Sweet Potatoes\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "2pqDr0NEZA0.mp4", "subtitles": ""}, {"title": "How to Peel an Avocado", "id": "K_AT_K29y4g", "url": "https://www.youtube.com/embed/K_AT_K29y4g", "uploader": "Guidecentral English", "views": 154, "duration": 39, "description": "Learn how to peel an avocado with this guide from wikiHow: https://www.wikihow.com/Peel-an-Avocado\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "K_AT_K29y4g.mp4", "subtitles": "smile upon me a and csmile upon me a and c smile upon me a and csoo 2.4 srx Ira Karimsoo 2.4 srx Ira Karim soo 2.4 srx Ira KarimBowlBowl Bowlthis chef list of rarethis chef list of rare this chef list of rareto form Karin we petto form Karin we pet to form Karin we petsos csrf settled ofsos csrf settled of sos csrf settled ofreportersreporters reporterswhowho whonx system he findsnx system he finds nx system he findspersonal foul and cousinspersonal foul and cousins personal foul and cousinscloser to be an ostcloser to be an ost closer to be an ostof co2 7p infant's numa ningof co2 7p infant's numa ning of co2 7p infant's numa ningIn your heart, enjoy raf"}, {"title": "How to Peel an Egg", "id": "n9zwdJh7LMA", "url": "https://www.youtube.com/embed/n9zwdJh7LMA?showinfo=0", "uploader": "wikiHow", "views": 424, "duration": 30, "description": "This quick video will give you some tips on #howto best peel an egg!\n\nRead more: https://www.wikihow.com/Peel-an-Egg\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "n9zwdJh7LMA.mp4", "subtitles": "to easily peel an egg first tap the ends of the egg on a hard surface to crack them then lay the egg on its side and roll it back and forth with the palm of your hand until the shell cracks more next use your fingers to pull the shell pieces off the egg you can also try shaking the egg in a metal container filled with water to crack the shell so it's easier to peel offto easily peel an egg first tap the ends of the egg on a hard surface to crack them then lay the egg on its side and roll it back and forth with the palm of your hand until the shell cracks more next use your fingers to pull the shell pieces off the egg you can also try shaking the egg in a metal container filled with water to crack the shell so it's easier to peel off"}, {"title": "How to Peel and Core Apples", "id": "onR3mhFJYfM", "url": "https://www.youtube.com/embed/onR3mhFJYfM?showinfo=0", "uploader": "wikiHow", "views": 112, "duration": 45, "description": "Learn How to Peel and Core Apples with this guide from wikiHow: https://www.wikihow.com/Peel-and-Core-Apples\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "onR3mhFJYfM.mp4", "subtitles": "to peel and core your Apple first use a vegetable or swivel peeler to remove the peel start at the top and circle down and around your Apple making one continuous peel if you can then put your apple stem side up on a cutting board and cut it in half next put the halves flat side down on the cutting board and cut them in half so you end up with four quarters you can then core each quarter by holding it in one hand and use a paring knife with your other hand cut a v-shape around the core and pull it away from the appleto peel and core your Apple first use a vegetable or swivel peeler to remove the peel start at the top and circle down and around your Apple making one continuous peel if you can then put your apple stem side up on a cutting board and cut it in half next put the halves flat side down on the cutting board and cut them in half so you end up with four quarters you can then core each quarter by holding it in one hand and use a paring knife with your other hand cut a v-shape around the core and pull it away from the apple"}, {"title": "How to Pickle Peppers", "id": "ShYBSQGibVI", "url": "https://www.youtube.com/embed/ShYBSQGibVI", "uploader": "Guidecentral English", "views": 40, "duration": 39, "description": "Learn how to pickle peppers with this guide from wikiHow: https://www.wikihow.com/Pickle-Peppers\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "ShYBSQGibVI.mp4", "subtitles": "if you want to pickle your own peppers remove the cores and seeds then blister the peppers by placing them in the oven and broil for six to eight minutes turning them frequently with tongs cover the peppers with a damp cloth so they'll cool quickly then peel away the skins boil vinegar water pickling salt sugar and garlic then simmer the mixture for 10 minutes remove the garlic cloves then place the peppers into glass jars and fill the jar the rest of the way with the pickling mixture stir each jar with a small rubber spatula to remove air bubbles then seal the jarsif you want to pickle your own peppers remove the cores and seeds then blister the peppers by placing them in the oven and broil for six to eight minutes turning them frequently with tongs cover the peppers with a damp cloth so they'll cool quickly then peel away the skins boil vinegar water pickling salt sugar and garlic then simmer the mixture for 10 minutes remove the garlic cloves then place the peppers into glass jars and fill the jar the rest of the way with the pickling mixture stir each jar with a small rubber spatula to remove air bubbles then seal the jars"}, {"title": "How to Plant a Lemon Seed", "id": "1ABy5w7GR5k", "url": "https://www.youtube.com/embed/1ABy5w7GR5k?showinfo=0", "uploader": "wikiHow", "views": 872, "duration": 86, "description": "Learn how to plant a lemon seed with this guide from wikiHow: https://www.wikihow.com/Plant-a-Lemon-Seed\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "1ABy5w7GR5k.mp4", "subtitles": "to plant a lemon seed first cut open a plump juicy lemon and extract the seeds from the pulp choose an undamaged seed and rinse it under cool water then find a small pot with drainage holes on the bottom and fill it with pasteurized soil mix push your seed one half inch one centimeter below the surface lightly moisten the soil with lukewarm water and cover the top of the pot with plastic wrap to help the soil retain its moisture place the pot in a warm spot that gets indirect sunlight lightly water your lemon seed every day to keep the soil moist but not soaked once seedlings appear move the pot into direct sunlight and take the plastic wrap off transfer the seedling to a large pot or well draining area in your yard when the first leaves appear if possible do this in the spring right before the growing season keep your lemon tree indoors if your local temperature ever drops below 45 degrees fahrenheit 7 degrees celsius water the plant as needed to keep the soil moist but not soaked fertilize the soil once a month between april and august with a water-soluble fertilizer that's high in potassium and nitrogen to encourage growthto plant a lemon seed first cut open a plump juicy lemon and extract the seeds from the pulp choose an undamaged seed and rinse it under cool water then find a small pot with drainage holes on the bottom and fill it with pasteurized soil mix push your seed one half inch one centimeter below the surface lightly moisten the soil with lukewarm water and cover the top of the pot with plastic wrap to help the soil retain its moisture place the pot in a warm spot that gets indirect sunlight lightly water your lemon seed every day to keep the soil moist but not soaked once seedlings appear move the pot into direct sunlight and take the plastic wrap off transfer the seedling to a large pot or well draining area in your yard when the first leaves appear if possible do this in the spring right before the growing season keep your lemon tree indoors if your local temperature ever drops below 45 degrees fahrenheit 7 degrees celsius water the plant as needed to keep the soil moist but not soaked fertilize the soil once a month between april and august with a water-soluble fertilizer that's high in potassium and nitrogen to encourage growth"}, {"title": "How to Plant Cherry Seeds", "id": "Cfa-cwBqZyc", "url": "https://www.youtube.com/embed/Cfa-cwBqZyc", "uploader": "wikiHow", "views": 12721, "duration": 101, "description": "Learn how to plant cherry seeds with this guide from wikiHow: https://www.wikihow.com/Plant-Cherry-Seeds\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "Cfa-cwBqZyc.mp4", "subtitles": "arrest print esco density patch balm bu kearrest print esco density patch balm bu ke arrest print esco density patch balm bu kesub abolished what or office hnc like figure 6 7 8 schoolteachersub abolished what or office hnc like figure 6 7 8 schoolteacher sub abolished what or office hnc like figure 6 7 8 schoolteacherbering trousers do other distribution tea wall tweet a 4 nbering trousers do other distribution tea wall tweet a 4 n bering trousers do other distribution tea wall tweet a 4 nmore stories sovereignty astro ex skse second mouth and back row inquirymore stories sovereignty astro ex skse second mouth and back row inquiry more stories sovereignty astro ex skse second mouth and back row inquiryI really have to oh super come and have to do it teraI really have to oh super come and have to do it tera I really have to oh super come and have to do it teraanyway marker lamp azalea above smokey angel spar I useanyway marker lamp azalea above smokey angel spar I use anyway marker lamp azalea above smokey angel spar I usenth pen locked chainsnth pen locked chains nth pen locked chainsb short i fill the sides petersb short i fill the sides peters b short i fill the sides peterswhat to do with this celebration rice almost ntp oj to suck ink tablet oswhat to do with this celebration rice almost ntp oj to suck ink tablet os what to do with this celebration rice almost ntp oj to suck ink tablet oscaverncavern caverni 7 2 2 Above x 3 teili 7 2 2 Above x 3 teil i 7 2 2 Above x 3 teilh and Lime Dam Whyh and Lime Dam Why   so so so so so so so so so so so so so so so so so so so so so so so so so so so so so so so so so so so so so so sooo’ once elba chen jul story diverges meaning lucy more now this is that same 4 scv powers no.9 it’s my turn to join andso so so so so so so so so so so so so so so so so so so so so so so so so so so so so so so so so so so so so so sooo’ once elba chen jul story diverges meaning lucy more now this is that same 4 scv powers no.9 it’s my turn to join and so so so so so so so so so so so so so so so so so so so so so so so so so so so so so so so so so so so so so so sooo’ once elba chen jul story diverges meaning lucy more now this is that same 4 scv powers no.9 it’s my turn to join andmake-up were externalmake-up were external make-up were externalman to heaven I also over use me outman to heaven I also over use me out man to heaven I also over use me outDeneb 8 The godfather may tremble, only 7 degrees 2nd arms started andDeneb 8 The godfather may tremble, only 7 degrees 2nd arms started and Deneb 8 The godfather may tremble, only 7 degrees 2nd arms started andends soon i or heroes once wakeboard unknown next seasonends soon i or heroes once wakeboard unknown next season ends soon i or heroes once wakeboard unknown next season1 q2 ice speed and right transition slv plant mfa es"}, {"title": "How to Plant Sunflower Seeds", "id": "kmihByW3cVk", "url": "https://www.youtube.com/embed/kmihByW3cVk", "uploader": "Guidecentral English", "views": 1115, "duration": 40, "description": "Learn how to plant sunflower seeds with this guide from wikiHow: https://www.wikihow.com/Plant-Sunflower-Seeds\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "kmihByW3cVk.mp4", "subtitles": "if you want to plant sunflower seeds wait until all danger of frost is passed then germinate the seeds by folding them in a damp paper towel for two to three days when you're choosing a location for your sunflowers look for an area with deep drainage and which receives six to eight hours of full sun a day plant the seeds one inch deep and six inches apart keep the soil moist but not soaking wet until the sprouts emerge from the soil and water three to four inches away from the new sprouts so the plants don't wash away reduce your watering frequency to once a week when the sunflowers have formed stamps [Music]if you want to plant sunflower seeds wait until all danger of frost is passed then germinate the seeds by folding them in a damp paper towel for two to three days when you're choosing a location for your sunflowers look for an area with deep drainage and which receives six to eight hours of full sun a day plant the seeds one inch deep and six inches apart keep the soil moist but not soaking wet until the sprouts emerge from the soil and water three to four inches away from the new sprouts so the plants don't wash away reduce your watering frequency to once a week when the sunflowers have formed stamps [Music]"}, {"title": "How to Play Apples to Apples", "id": "OxyviNTVApU", "url": "https://www.youtube.com/embed/OxyviNTVApU?showinfo=0", "uploader": "wikiHow", "views": 934, "duration": 126, "description": "Learn how to play apples to apples with this guide from wikiHow: https://www.wikihow.com/Play-Apples-to-Apples\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "OxyviNTVApU.mp4", "subtitles": ""}, {"title": "How to Prepare a Pop Tart", "id": "Iu_Q-O8cz0g", "url": "https://www.youtube.com/embed/Iu_Q-O8cz0g?showinfo=0", "uploader": "wikiHow", "views": 1070, "duration": 53, "description": "Learn how to prepare a pop tart with this guide from wikiHow: https://www.wikihow.com/Prepare-a-Pop-Tart\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "Iu_Q-O8cz0g.mp4", "subtitles": ""}, {"title": "How to Prepare Beef Ribs", "id": "Ab3Ke8AX8fw", "url": "https://www.youtube.com/embed/Ab3Ke8AX8fw", "uploader": "Guidecentral English", "views": 322, "duration": 42, "description": "Learn how to prepare beef ribs with this guide from wikiHow: https://www.wikihow.com/Prepare-Beef-Ribs\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "Ab3Ke8AX8fw.mp4", "subtitles": "[Music] to prepare beef ribs start by removing the membrane so you don't wind up with chewy meat if you want to use a rub you'll have to let the rub sit overnight alternatively you can apply barbecue sauce while cooking once you know how you want your ribs preheat your grill or oven to 225 degrees fahrenheit wrap your ribs in several layers of aluminum foil with the opening facing up so you can check the ribs while they cook finally place the ribs meat side down and cook for three hours or until the meat easily falls off the bone for more tips including how to use the broiler to finish your ribs read on[Music] to prepare beef ribs start by removing the membrane so you don't wind up with chewy meat if you want to use a rub you'll have to let the rub sit overnight alternatively you can apply barbecue sauce while cooking once you know how you want your ribs preheat your grill or oven to 225 degrees fahrenheit wrap your ribs in several layers of aluminum foil with the opening facing up so you can check the ribs while they cook finally place the ribs meat side down and cook for three hours or until the meat easily falls off the bone for more tips including how to use the broiler to finish your ribs read on"}, {"title": "Alaska Residents Prepare for Possible Eruption", "id": "rqZoNClTSRs", "url": "https://www.youtube.com/embed/rqZoNClTSRs", "uploader": "Associated Press", "views": 48036, "duration": 44, "description": "Geologists say Alaska's Mount Redoubt could erupt within days, the first time in 20 years. Nearby residents are preparing for a possible ash storm.(Jan. 29)", "hosted_mp4": "rqZoNClTSRs.mp4", "subtitles": ""}, {"title": "What to Do to Prepare for Allergy Season", "id": "YruqJwn1GJQ", "url": "https://www.youtube.com/embed/YruqJwn1GJQ?showinfo=0", "uploader": "wikiHow", "views": 62, "duration": 43, "description": "Learn how to prepare for allergy season with Board Certified Allergist., Dr. Alan O. Khadavi.st. Learn more with this wikiHow guide: https://www.wikihow.com/Prepare-for-Allergy-Season.\n\nDr. Alan O. Khadavi is a Board Certified Allergist and a Pediatric Allergy Specialist based in Los Angeles, California. He holds a BS in biochemistry from the State University of New York (SUNY) at Stony Brook and an MD from the State University of New York Health Science Center at Brooklyn. Dr. Khadavi completed his pediatric residency at Schneider Children’s Hospital in New York, and then went on to complete his allergy and immunology fellowship and pediatric residency at Long Island College Hospital. He is board certified in adult and pediatric allergy/immunology. Dr. Khadavi is a Diplomate of the American Board of Allergy and Immunology, a Fellow of the American College of Allergy, Asthma & Immunology (ACAAI), and a member of the American Academy of Allergy, Asthma & Immunology (AAAAI). Dr. Khadavi's honors include Castle Connolly’s list of Top Doctors 2013-2020, and Patient Choice Awards \"Most Compassionate Doctor\" in 2013 & 2014.\nLearn more: https://allergylosangeles.com/\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "YruqJwn1GJQ.mp4", "subtitles": ""}, {"title": "How to Prepare Okra", "id": "UikPRyNLiG8", "url": "https://www.youtube.com/embed/UikPRyNLiG8", "uploader": "Guidecentral English", "views": 576, "duration": 34, "description": "Learn how to prepare okra with this guide from wikiHow: https://www.wikihow.com/Prepare-Okra\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "UikPRyNLiG8.mp4", "subtitles": "to prepare okra start by trimming off the stem without cutting into the pot itself once the okra is trimmed defuse the okra by running it under cold water and rubbing the pot gently with a paper towel or vegetable brush you can also reduce the sliminess of okra by letting it sit in some vinegar for 30 minutes before cooking after its vinegar bath slice the okra into chunks if you plan to add it into gumbo or stew or cut it into thin slices if you want to fry itto prepare okra start by trimming off the stem without cutting into the pot itself once the okra is trimmed defuse the okra by running it under cold water and rubbing the pot gently with a paper towel or vegetable brush you can also reduce the sliminess of okra by letting it sit in some vinegar for 30 minutes before cooking after its vinegar bath slice the okra into chunks if you plan to add it into gumbo or stew or cut it into thin slices if you want to fry it"}, {"title": "How to Prepare Perfect Sandwich Bread", "id": "-F_TV5PSn90", "url": "https://www.youtube.com/embed/-F_TV5PSn90?showinfo=0", "uploader": "wikiHow", "views": 937, "duration": 32, "description": "Learn how to prepare perfect sandwich bread with this guide from wikiHow: https://www.wikihow.com/Prepare-Perfect-Sandwich-Bread\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "-F_TV5PSn90.mp4", "subtitles": ""}, {"title": "How to Preserve Lemon Peel", "id": "3PLsx8y8P58", "url": "https://www.youtube.com/embed/3PLsx8y8P58?showinfo=0", "uploader": "wikiHow", "views": 1987, "duration": 135, "description": "Learn how to preserve lemon peel with this guide from wikiHow: https://www.wikihow.com/Preserve-Lemon-Peel\n\n0:00 Preparing Your Lemons\n0:27 Freezing Fresh Lemon Peel\n0:45 Dry Preserving Lemon Peel\n1:26 Making and Freezing Lemon Juice\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "3PLsx8y8P58.mp4", "subtitles": ""}, {"title": "How to Puree Meat", "id": "whdMl00w1vw", "url": "https://www.youtube.com/embed/whdMl00w1vw", "uploader": "Guidecentral English", "views": 7801, "duration": 37, "description": "Learn how to puree meat with this guide from wikiHow: https://www.wikihow.com/Puree-Meat\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "whdMl00w1vw.mp4", "subtitles": "to puree meat start with a tender cut and cook it slowly by braising it boiling it or putting it in a slow cooker refrigerate your cooked meat for at least two hours then chop it into one inch pieces next put a cup of your meat into a food processor or blender blend your meat until it's fine and powdery almost like sand finally puree your meat by adding quarter cup of water meat broth or reserved cooking liquid per cup of meat continue blending or processing until your perrier has reached the consistency you wantto puree meat start with a tender cut and cook it slowly by braising it boiling it or putting it in a slow cooker refrigerate your cooked meat for at least two hours then chop it into one inch pieces next put a cup of your meat into a food processor or blender blend your meat until it's fine and powdery almost like sand finally puree your meat by adding quarter cup of water meat broth or reserved cooking liquid per cup of meat continue blending or processing until your perrier has reached the consistency you want"}, {"title": "How to Quarter a Chicken", "id": "NsyI1l_vvr8", "url": "https://www.youtube.com/embed/NsyI1l_vvr8?showinfo=0", "uploader": "wikiHow", "views": 245, "duration": 45, "description": "Learn how to quarter a chicken with this guide from wikiHow: https://www.wikihow.com/Quarter-a-Chicken\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "NsyI1l_vvr8.mp4", "subtitles": ""}, {"title": "How to Reheat Bread", "id": "AhrLD1MkuRg", "url": "https://www.youtube.com/embed/AhrLD1MkuRg?showinfo=0", "uploader": "wikiHow", "views": 22285, "duration": 37, "description": "Learn how to reheat bread with this guide from wikiHow: https://www.wikihow.com/Reheat-Bread\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "AhrLD1MkuRg.mp4", "subtitles": "the very own note2 route at all  teresa teng overteresa teng over teresa teng overju,ju, ju,ju, what came from vero, what did you pour factor to portju, what came from vero, what did you pour factor to port ju, what came from vero, what did you pour factor to portled wins the term 1led wins the term 1 led wins the term 1leaflet"}, {"title": "How to Remove Eggplant Seeds", "id": "nZTw_iJn6M4", "url": "https://www.youtube.com/embed/nZTw_iJn6M4?showinfo=0", "uploader": "wikiHow", "views": 4900, "duration": 63, "description": "Learn how to remove eggplant seeds with this guide from wikiHow: https://www.wikihow.com/Remove-Eggplant-Seeds\n\n0:00 Getting Rid of Seeds for Cooking\n0:27 Saving the Seeds for Planting\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "nZTw_iJn6M4.mp4", "subtitles": ""}]