[{"title": "How to Clean Clams", "id": "HKGkI_ilCGM", "url": "https://www.youtube.com/embed/HKGkI_ilCGM", "uploader": "Guidecentral English", "views": 545, "duration": 27, "description": "Learn how to clean clams with this guide from wikiHow: https://www.wikihow.com/Clean-Clams\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "HKGkI_ilCGM.mp4", "subtitles": "Teak Reason I'm a flex team Some pieTeak Reason I'm a flex team Some pie Teak Reason I'm a flex team Some pierenewal one 2.0 Kerr 4renewal one 2.0 Kerr 4 renewal one 2.0 Kerr 4etc and xiaos I use Cryingetc and xiaos I use Crying etc and xiaos I use CryingBlocking Traders com serverBlocking Traders com server Blocking Traders com server  when I get points I want to end up with something I want to endwhen I get points I want to end up with something I want to end when I get points I want to end up with something I want to endPelican m400 classPelican m400 class Pelican m400 classor childcareor childcare or childcareIf you let the grass herbal workIf you let the grass herbal work If you let the grass herbal work, it was lonely to learn 4 Ah 2"}, {"title": "How to Clean Potatoes", "id": "msCGAlwNnwE", "url": "https://www.youtube.com/embed/msCGAlwNnwE?showinfo=0", "uploader": "wikiHow", "views": 7750, "duration": 36, "description": "Learn how to clean potatoes with this guide from wikiHow: https://www.wikihow.com/Clean-Potatoes\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "msCGAlwNnwE.mp4", "subtitles": "potato promotion organization First Love onpotato promotion organization First Love on potato promotion organization First Love onthe good work and prospects ahead withthe good work and prospects ahead with the good work and prospects ahead withyour fingers to remove and stylesyour fingers to remove and styles your fingers to remove and stylesboris Yeltsin auswaertiges performance fromboris Yeltsin auswaertiges performance from boris Yeltsin auswaertiges performance fromBright effective method is distributedBright effective method is distributed Bright effective method is distributedserver Motion focus on any Dallas wiensserver Motion focus on any Dallas wiens server Motion focus on any Dallas wiensPieces of second time in your part 5Pieces of second time in your part 5 Pieces of second time in your part 5in Hanoi Ta tap Thao's tree price drive examin Hanoi Ta tap Thao's tree price drive exam"}, {"title": "How to Clean Stainless Steel Cutlery", "id": "ylujt3D6XaE", "url": "https://www.youtube.com/embed/ylujt3D6XaE?showinfo=0", "uploader": "wikiHow", "views": 12560, "duration": 63, "description": "Learn how to clean stainless steel cutlery with this guide from wikiHow: https://www.wikihow.com/Clean-Stainless-Steel-Cutlery\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "ylujt3D6XaE.mp4", "subtitles": ""}, {"title": "How to Wash Romaine Lettuce", "id": "qddFrJhSi3Y", "url": "https://www.youtube.com/embed/qddFrJhSi3Y?showinfo=0", "uploader": "wikiHow", "views": 17832, "duration": 79, "description": "Learn how to wash romaine lettuce with this guide from wikiHow: https://www.wikihow.com/Wash-Romaine-Lettuce\n\n0:00 Rinsing With Water\n0:23 Drying and Storing\n0:50 Sanitizing the Lettuce\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "qddFrJhSi3Y.mp4", "subtitles": ""}, {"title": "How to Cook a Roast", "id": "fQfSWWHw0BE", "url": "https://www.youtube.com/embed/fQfSWWHw0BE", "uploader": "Guidecentral English", "views": 42, "duration": 39, "description": "Learn how to cook a roast with this guide from wikiHow: https://www.wikihow.com/Cook-a-Roast\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "fQfSWWHw0BE.mp4", "subtitles": "to cook a roast in the oven preheat the oven to 350 degrees fahrenheit for a pork roast and season the meat with as much salt pepper garlic and herbs as you like then place the roast on a rack inside the roasting pan and cook for 20 minutes per 1 pound of meat near the end of the cooking time use a meat thermometer to check that the internal temperature of the pork has reached 145 degrees fahrenheit once it's there remove the roast from the oven and let it rest for 10 to 15 minutes slice the meat and serveto cook a roast in the oven preheat the oven to 350 degrees fahrenheit for a pork roast and season the meat with as much salt pepper garlic and herbs as you like then place the roast on a rack inside the roasting pan and cook for 20 minutes per 1 pound of meat near the end of the cooking time use a meat thermometer to check that the internal temperature of the pork has reached 145 degrees fahrenheit once it's there remove the roast from the oven and let it rest for 10 to 15 minutes slice the meat and serve"}, {"title": "How to Cook a Top Round Roast", "id": "6Ee0IEgFnWI", "url": "https://www.youtube.com/embed/6Ee0IEgFnWI?showinfo=0", "uploader": "wikiHow", "views": 4370, "duration": 87, "description": "Learn how to cook a top round roast with this guide from wikiHow: https://www.wikihow.com/Cook-a-Top-Round-Roast\n\n0:00 Seasoning the Roast\n0:40 Roasting the Meat\n1:00 Serving the Meat\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "6Ee0IEgFnWI.mp4", "subtitles": ""}, {"title": "How to Cook Apples", "id": "Hkz3YAARFak", "url": "https://www.youtube.com/embed/Hkz3YAARFak", "uploader": "Guidecentral English", "views": 75, "duration": 36, "description": "Learn how to cook apples with this guide from wikiHow: https://www.wikihow.com/Cook-Apples\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "Hkz3YAARFak.mp4", "subtitles": "to cook apples in the oven start by cutting the tops off and removing the cores then fill the apples with cinnamon brown sugar and butter and place them in a baking dish filled with a little bit of hot water bake the apples in the oven for 30 minutes at 375 degrees fahrenheit to cook apples on the stovetop start by peeling and slicing them into wedges or rings then fry the apples and the butter cinnamon and sugar over medium high heat for 5-8 minutesto cook apples in the oven start by cutting the tops off and removing the cores then fill the apples with cinnamon brown sugar and butter and place them in a baking dish filled with a little bit of hot water bake the apples in the oven for 30 minutes at 375 degrees fahrenheit to cook apples on the stovetop start by peeling and slicing them into wedges or rings then fry the apples and the butter cinnamon and sugar over medium high heat for 5-8 minutes"}, {"title": "How to Cook Arborio Rice", "id": "9HIbh8_Prm8", "url": "https://www.youtube.com/embed/9HIbh8_Prm8", "uploader": "Guidecentral English", "views": 27185, "duration": 44, "description": "Learn how to cook arborio rice with this guide from wikiHow: https://www.wikihow.com/Cook-Arborio-Rice\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "9HIbh8_Prm8.mp4", "subtitles": "to cook risotto with arborio rice add chicken broth to a pot and let it simmer over low heat in a separate pan heat diced onions for about 4 minutes and add garlic for an additional minute next add dry arborio rice and add a dash of salt to the pan and cook for two to three minutes stirring constantly then add about half a cup of the chicken broth and a splash of white wine to the pan and cook until the rice absorbs the liquids once it's absorbed add the remaining chicken broth and cook for another 25 to 35 minutes before adding parmesan cheese and servingto cook risotto with arborio rice add chicken broth to a pot and let it simmer over low heat in a separate pan heat diced onions for about 4 minutes and add garlic for an additional minute next add dry arborio rice and add a dash of salt to the pan and cook for two to three minutes stirring constantly then add about half a cup of the chicken broth and a splash of white wine to the pan and cook until the rice absorbs the liquids once it's absorbed add the remaining chicken broth and cook for another 25 to 35 minutes before adding parmesan cheese and serving"}, {"title": "How to Cook Asparagus", "id": "iKJ6_Gm1b9g", "url": "https://www.youtube.com/embed/iKJ6_Gm1b9g?showinfo=0", "uploader": "wikiHow", "views": 56, "duration": 74, "description": "Learn How to Cook Asparagus with this guide from wikiHow: https://www.wikihow.com/Cook-Asparagus\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "iKJ6_Gm1b9g.mp4", "subtitles": "to cook asparagus on the stovetop first snap the woody ends off the asparagus and cut them to your desired size then add some oil or butter to a pan and saute the asparagus on high heat for three to five minutes you'll know it's done when it's lightly browned and tender to roast asparagus in the oven first place the asparagus in a bowl and add olive oil salt pepper and your favorite seasonings toss the asparagus so all of the spears are coated then spread them out on a baking sheet finally cook the asparagus at 400 degrees Fahrenheit 205 degrees Celsius for 10 to 15 minutes or until the spears are browned and tender if you want to grill asparagus first pre-heat your grill over high heat then toss the asparagus in olive oil salt and pepper place the spears directly on the grill and grill them for 3 to 4 minutes or until they're charred and tender serve and enjoyto cook asparagus on the stovetop first snap the woody ends off the asparagus and cut them to your desired size then add some oil or butter to a pan and saute the asparagus on high heat for three to five minutes you'll know it's done when it's lightly browned and tender to roast asparagus in the oven first place the asparagus in a bowl and add olive oil salt pepper and your favorite seasonings toss the asparagus so all of the spears are coated then spread them out on a baking sheet finally cook the asparagus at 400 degrees Fahrenheit 205 degrees Celsius for 10 to 15 minutes or until the spears are browned and tender if you want to grill asparagus first pre-heat your grill over high heat then toss the asparagus in olive oil salt and pepper place the spears directly on the grill and grill them for 3 to 4 minutes or until they're charred and tender serve and enjoy"}, {"title": "How to Cook Bacon in the Oven", "id": "kylZRqap55E", "url": "https://www.youtube.com/embed/kylZRqap55E?showinfo=0", "uploader": "wikiHow", "views": 982, "duration": 44, "description": "HOW TO BAKE YOUR BACON\n\nCooking bacon in the microwave or frying it up in a pan might be the fastest ways to get breakfast on the table, but to achieve the perfect balance of crispy and chewy textures and the deepest bacon flavor, try baking it in the oven.\n\nRead more: https://www.wikihow.com/Cook-Bacon-in-the-Oven\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "kylZRqap55E.mp4", "subtitles": "to cook bacon in the oven first preheat your oven to 400 degrees Fahrenheit 204 degrees Celsius place the slices close together on a broiler pan covered with aluminum foil and put the pan in the oven cook the bacon for 12 to 15 minutes then remove the pan from the oven and use tongs to flip the bacon over cook the bacon for another 8 to 10 minutes or until it's crispy remove the bacon from the oven and let it cool before servingto cook bacon in the oven first preheat your oven to 400 degrees Fahrenheit 204 degrees Celsius place the slices close together on a broiler pan covered with aluminum foil and put the pan in the oven cook the bacon for 12 to 15 minutes then remove the pan from the oven and use tongs to flip the bacon over cook the bacon for another 8 to 10 minutes or until it's crispy remove the bacon from the oven and let it cool before serving"}, {"title": "How to Cook Banana", "id": "ZzEotsWVsKk", "url": "https://www.youtube.com/embed/ZzEotsWVsKk", "uploader": "Guidecentral English", "views": 71, "duration": 34, "description": "Learn how to cook banana with this guide from wikiHow: https://www.wikihow.com/Cook-Banana\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "ZzEotsWVsKk.mp4", "subtitles": "if you want to cook bananas by pan frying them peel the bananas then slice them into half inch pieces pour honey cinnamon salt and butter into a pan on medium until the butter warms up then add the banana slices to the pan and cook them for four 4-5 minutes stir the bananas frequently so they don't burn and remove them from the heat once they turn golden and start to get sticky eat the caramelized bananas on their own or serve them on top of french toast or ice cream to learn how to bake bananas read onif you want to cook bananas by pan frying them peel the bananas then slice them into half inch pieces pour honey cinnamon salt and butter into a pan on medium until the butter warms up then add the banana slices to the pan and cook them for four 4-5 minutes stir the bananas frequently so they don't burn and remove them from the heat once they turn golden and start to get sticky eat the caramelized bananas on their own or serve them on top of french toast or ice cream to learn how to bake bananas read on"}, {"title": "Cooking Tips : How to Cook Barley", "id": "T5eCNgcm6hY", "url": "https://www.youtube.com/embed/T5eCNgcm6hY", "uploader": "cookingguide", "views": 43824, "duration": 52, "description": "Kitchen Tips: How to Cook Barley. Basic cooking techniques and tips for Cooking Barley", "hosted_mp4": "T5eCNgcm6hY.mp4", "subtitles": "To correctly cook barley, start with a panon medium-high heat. Next, take your barleyand pour it into the pan. The barley is goingto expand about two to three times its sizeso you want to make sure that your stock pot'sbig enough to hold that. Allow your barleyto toast for just a second it'll help bringout the nutty flavor. Once your barley istoasted go ahead and add about two times theamount of liquid. I like to use chicken stockor beef stock, it helps bring out extra flavorwithin the product. Next, bring your liquidto a boil and then a simmer. Allow your barleyto cook thirty to forty minutes until it'snice, soft and chewy. Barley, when it's complete,should have looked like its expanded abouttwo to three times it shape. It's also gota pearled look to it. And that is how youcook barley."}, {"title": "How to Cook Bean Sprouts", "id": "Ojnc7v-sTYQ", "url": "https://www.youtube.com/embed/Ojnc7v-sTYQ?showinfo=0", "uploader": "wikiHow", "views": 5418, "duration": 79, "description": "Learn how to cook bean sprouts with this guide from wikiHow: https://www.wikihow.com/Cook-Bean-Sprouts\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "Ojnc7v-sTYQ.mp4", "subtitles": "to saute bean sprouts first heat one tablespoon 15 milliliters of vegetable oil in a non-stick pan over medium heat in a mixing bowl mix one half teaspoon six grams of salt and two cups 200 grams of fresh bean sprouts together then pour your bean sprouts into the pan cook them over medium heat for 5 minutes stir the bean sprouts occasionally to ensure they cook evenly to make bean sprouts stir fry first slice one half cup 50 grams of scallions into thin slices add them to a mixing bowl with one tablespoon 5 grams of minced ginger and 1 tablespoon 8 grams of sliced garlic toss them together by hand then coat a large wok with vegetable oil and heat it over medium heat add your hand mixed ingredients and stir them in the wok for one to two minutes next add four cups 400 grams of bean sprouts to the wok and continue stirring heat your ingredients for an additional five minutes and serve with your choice of riceto saute bean sprouts first heat one tablespoon 15 milliliters of vegetable oil in a non-stick pan over medium heat in a mixing bowl mix one half teaspoon six grams of salt and two cups 200 grams of fresh bean sprouts together then pour your bean sprouts into the pan cook them over medium heat for 5 minutes stir the bean sprouts occasionally to ensure they cook evenly to make bean sprouts stir fry first slice one half cup 50 grams of scallions into thin slices add them to a mixing bowl with one tablespoon 5 grams of minced ginger and 1 tablespoon 8 grams of sliced garlic toss them together by hand then coat a large wok with vegetable oil and heat it over medium heat add your hand mixed ingredients and stir them in the wok for one to two minutes next add four cups 400 grams of bean sprouts to the wok and continue stirring heat your ingredients for an additional five minutes and serve with your choice of rice to saute bean sprouts first heat one tablespoon 15 milliliters of vegetable oil in a non-stick pan over medium heat in a mixing bowl mix one half teaspoon six grams of salt and two cups 200 grams of fresh bean sprouts together then pour your bean sprouts into the pan cook them over medium heat for 5 minutes stir the bean sprouts occasionally to ensure they cook evenly to make bean sprouts stir fry first slice one half cup 50 grams of scallions into thin slices add them to a mixing bowl with one tablespoon 5 grams of minced ginger and 1 tablespoon 8 grams of sliced garlic toss them together by hand then coat a large wok with vegetable oil and heat it over medium heat add your hand mixed ingredients and stir them in the wok for one to two minutes next add four cups 400 grams of bean sprouts to the wok and continue stirring heat your ingredients for an additional five minutes and serve with your choice of rice"}, {"title": "How to Cook Beets", "id": "0tvX_iVSX8M", "url": "https://www.youtube.com/embed/0tvX_iVSX8M?showinfo=0", "uploader": "wikiHow", "views": 631, "duration": 92, "description": "This quick video will give you some tips on #howto cook beets!\n\nRead more: https://www.wikihow.com/Cook-Beets\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "0tvX_iVSX8M.mp4", "subtitles": "to cook beets in the microwave scrub four to five beets clean under running water then slice off the leaves close to the beets tip and trim off the long end of the beet next put the beets in a microwave-safe bowl in a single layer and add two tablespoons of water cover the beets and microwave them for five minutes before rotating them and cooking them for another three to five minutes you'll know the beets are done if they are tender when you stick a fork into them cool the beets peel off their skins and serve to cook beets in the oven first pre-heat your oven to 400 degrees Fahrenheit or 205 degrees Celsius and wrap each beat individually in aluminum foil place the beets on a baking sheet and cook them in the oven for 50 to 60 minutes check the beets every 20 minutes if they start looking dry or you notice scorch marks on the bottom gently pull the foil away and pour one tablespoon of water onto each beat you'll know the beets are done if they are tender when you stick a fork into them cool the beets peel off their skins and serveto cook beets in the microwave scrub four to five beets clean under running water then slice off the leaves close to the beets tip and trim off the long end of the beet next put the beets in a microwave-safe bowl in a single layer and add two tablespoons of water cover the beets and microwave them for five minutes before rotating them and cooking them for another three to five minutes you'll know the beets are done if they are tender when you stick a fork into them cool the beets peel off their skins and serve to cook beets in the oven first pre-heat your oven to 400 degrees Fahrenheit or 205 degrees Celsius and wrap each beat individually in aluminum foil place the beets on a baking sheet and cook them in the oven for 50 to 60 minutes check the beets every 20 minutes if they start looking dry or you notice scorch marks on the bottom gently pull the foil away and pour one tablespoon of water onto each beat you'll know the beets are done if they are tender when you stick a fork into them cool the beets peel off their skins and serve"}, {"title": "How to Cook Black Pudding", "id": "NX8tdBtbWPc", "url": "https://www.youtube.com/embed/NX8tdBtbWPc", "uploader": "Guidecentral English", "views": 382, "duration": 32, "description": "Learn how to cook black pudding with this guide from wikiHow: https://www.wikihow.com/Cook-Black-Pudding\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "NX8tdBtbWPc.mp4", "subtitles": "to cook black pudding start by cutting it up into half inch thick slices and removing the skin then spread the slices out on a greased baking sheet and bake them for 10 to 20 minutes at 375 degrees fahrenheit you can also put the slices in a pan with some oil and fry them for three to four minutes on each side over medium heat to learn how to boil black pudding scroll down youto cook black pudding start by cutting it up into half inch thick slices and removing the skin then spread the slices out on a greased baking sheet and bake them for 10 to 20 minutes at 375 degrees fahrenheit you can also put the slices in a pan with some oil and fry them for three to four minutes on each side over medium heat to learn how to boil black pudding scroll down you"}, {"title": "How to Cook Brussels Sprouts", "id": "lqbVTE_6mnk", "url": "https://www.youtube.com/embed/lqbVTE_6mnk?showinfo=0", "uploader": "wikiHow", "views": 406, "duration": 105, "description": "Learn how to cook brussels sprouts with this guide from wikiHow: https://www.wikihow.com/Cook-Brussels-Sprouts\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "lqbVTE_6mnk.mp4", "subtitles": "before you cook brussels sprouts rinse them off under cool water to clean them and trim off the stem of each sprout peel away any yellow leaves then cut each sprout in half lengthwise for firm crispy brussels sprouts cook them on the stovetop heat a large skillet over medium-high for 4 minutes then add 2 tablespoons 30 milliliters of olive oil once the oil is shining add the brussels sprouts and shake the pan so they're mostly cut side down let them cook for five to eight minutes until the cut sides are seared then stir the sprouts and cook them for another six to eight minutes until they're browned all over and slightly tender season with salt and pepper and cook the brussels sprouts for one more minute before serving for tender melt in your mouth brussels sprouts roast them in the oven preheat your oven to 400 degrees fahrenheit 200 degrees celsius and mix the brussels sprouts with three tablespoons 45 milliliters of olive oil and a pinch of salt and pepper in a bowl spread the sprouts out on a baking sheet then roast them in the oven for 35 to 40 minutes shaking the pan occasionally so the sprouts cook evenly you'll know that brussels sprouts are done when they're tender on the insidebefore you cook brussels sprouts rinse them off under cool water to clean them and trim off the stem of each sprout peel away any yellow leaves then cut each sprout in half lengthwise for firm crispy brussels sprouts cook them on the stovetop heat a large skillet over medium-high for 4 minutes then add 2 tablespoons 30 milliliters of olive oil once the oil is shining add the brussels sprouts and shake the pan so they're mostly cut side down let them cook for five to eight minutes until the cut sides are seared then stir the sprouts and cook them for another six to eight minutes until they're browned all over and slightly tender season with salt and pepper and cook the brussels sprouts for one more minute before serving for tender melt in your mouth brussels sprouts roast them in the oven preheat your oven to 400 degrees fahrenheit 200 degrees celsius and mix the brussels sprouts with three tablespoons 45 milliliters of olive oil and a pinch of salt and pepper in a bowl spread the sprouts out on a baking sheet then roast them in the oven for 35 to 40 minutes shaking the pan occasionally so the sprouts cook evenly you'll know that brussels sprouts are done when they're tender on the inside"}, {"title": "How to Cook Butternut Squash", "id": "SO6SDojPYvQ", "url": "https://www.youtube.com/embed/SO6SDojPYvQ?showinfo=0", "uploader": "wikiHow", "views": 138, "duration": 111, "description": "Learn How to Cook Butternut Squash with this guide from wikiHow: https://www.wikihow.com/Cook-Butternut-Squash\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "SO6SDojPYvQ.mp4", "subtitles": "to cook butternut squash start by cutting 1/4 inch or point 6 centimeters off the ends with a knife then use a vegetable peeler to peel off all the skin once you've removed the skin stand the squash up on a stable flat surface and use a large knife to cut it in half lengthwise use a spoon to scoop out all the seeds in each half then discard them or set them aside to toast later if you want to roast the halves place them in a greased baking dish cut side up and season them with butter or oil and your favorite herbs and spices roast the halves for 50 to 60 minutes at 400 degrees Fahrenheit or 205 degrees Celsius alternatively you can cut the squash into cubes before roasting it to cut the halves into cubes first place them cut side down on a cutting board cut the halves into slices then stack the slices and cut them crosswise to make cubes when you're finished cutting up the squash toss the cubes in olive oil or butter and your favorite seasonings spread the cubes out on a baking sheet and roast them for 25 to 30 minutes at 400 degrees Fahrenheit or 205 degrees Celsius serve and enjoy be sure to practice knife safety grasp the blade of the knife firmly between your thumb and index finger just above the handle wrap the rest of your fingers around the handle slice away from yourself one cutting and keep your fingers curled away from the blade when holding foodto cook butternut squash start by cutting 1/4 inch or point 6 centimeters off the ends with a knife then use a vegetable peeler to peel off all the skin once you've removed the skin stand the squash up on a stable flat surface and use a large knife to cut it in half lengthwise use a spoon to scoop out all the seeds in each half then discard them or set them aside to toast later if you want to roast the halves place them in a greased baking dish cut side up and season them with butter or oil and your favorite herbs and spices roast the halves for 50 to 60 minutes at 400 degrees Fahrenheit or 205 degrees Celsius alternatively you can cut the squash into cubes before roasting it to cut the halves into cubes first place them cut side down on a cutting board cut the halves into slices then stack the slices and cut them crosswise to make cubes when you're finished cutting up the squash toss the cubes in olive oil or butter and your favorite seasonings spread the cubes out on a baking sheet and roast them for 25 to 30 minutes at 400 degrees Fahrenheit or 205 degrees Celsius serve and enjoy be sure to practice knife safety grasp the blade of the knife firmly between your thumb and index finger just above the handle wrap the rest of your fingers around the handle slice away from yourself one cutting and keep your fingers curled away from the blade when holding food"}, {"title": "How to Cook Cabbage and Potatoes", "id": "3TKmsCzAcEk", "url": "https://www.youtube.com/embed/3TKmsCzAcEk?showinfo=0", "uploader": "wikiHow", "views": 6893, "duration": 289, "description": "Learn how to cook cabbage and potatoes with this guide from wikiHow: https://www.wikihow.com/Cook-Cabbage-and-Potatoes\n\n0:00 Pan-frying Cabbage and Potatoes \n1:30 Boiling Cabbage with Potatoes\n3:20 Roasting Cabbage with Potatoes\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "3TKmsCzAcEk.mp4", "subtitles": ""}, {"title": "How to Cook Corn on the Cob", "id": "xjsnDshyb_c", "url": "https://www.youtube.com/embed/xjsnDshyb_c?showinfo=0", "uploader": "wikiHow", "views": 149, "duration": 43, "description": "This quick video will give you some tips on how to cook corn on the cob!\n\nRead more: https://www.wikihow.com/Cook-Corn-on-the-Cob\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "xjsnDshyb_c.mp4", "subtitles": ""}, {"title": "How to Cook Dried Fava Beans", "id": "YBmlJNwE7DQ", "url": "https://www.youtube.com/embed/YBmlJNwE7DQ?showinfo=0", "uploader": "wikiHow", "views": 11435, "duration": 127, "description": "Learn how to cook dried fava beans with this guide from wikiHow: https://www.wikihow.com/Cook-Dried-Fava-Beans\n\n0:00 Rehydrating the Fava Beans\n0:40 Cooking Plain Fava Beans\n1:05 Making Fava Bean Dishes\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "YBmlJNwE7DQ.mp4", "subtitles": ""}]