[{"title": "How to Make Caramelized Apples", "id": "JLJK9zIT_hY", "url": "https://www.youtube.com/embed/JLJK9zIT_hY", "uploader": "Guidecentral English", "views": 241, "duration": 39, "description": "Learn how to make caramelized apples with this guide from wikiHow: https://www.wikihow.com/Make-Caramelized-Apples\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "JLJK9zIT_hY.mp4", "subtitles": "to make caramelized apples use crisp apple varieties like braeburn fuji or gala for best results select four apples then skin and slice them into quarters disposing of the cores next melt four tablespoons of butter in a large skillet over medium high heat and add the slices to the skillet saute the slices for about five minutes flipping them repeatedly until both sides are browned then stir in four tablespoons of white sugar and let the sugar melt before removing the apples from the skilletto make caramelized apples use crisp apple varieties like braeburn fuji or gala for best results select four apples then skin and slice them into quarters disposing of the cores next melt four tablespoons of butter in a large skillet over medium high heat and add the slices to the skillet saute the slices for about five minutes flipping them repeatedly until both sides are browned then stir in four tablespoons of white sugar and let the sugar melt before removing the apples from the skillet"}, {"title": "How to Make Chili Sauce", "id": "5W2G1t-yrGg", "url": "https://www.youtube.com/embed/5W2G1t-yrGg?showinfo=0", "uploader": "wikiHow", "views": 78, "duration": 135, "description": "Learn how to make chili sauce with this guide from wikiHow: https://www.wikihow.com/Make-Chili-Sauce\n\n0:00 Tomato-Based Chili Sauce \n0:45 Spicy Garlic Chili Sauce \n1:15 Sweet Chili Sauce \n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "5W2G1t-yrGg.mp4", "subtitles": ""}, {"title": "How to Make Chocolate Curls", "id": "6IFpX2lq6Zo", "url": "https://www.youtube.com/embed/6IFpX2lq6Zo?showinfo=0", "uploader": "wikiHow", "views": 226, "duration": 151, "description": "Learn how to make chocolate curls with this guide from wikiHow: https://www.wikihow.com/Make-Chocolate-Curls\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "6IFpX2lq6Zo.mp4", "subtitles": ""}, {"title": "How to Make Cranberry Sauce", "id": "3gaALn0ZkJ4", "url": "https://www.youtube.com/embed/3gaALn0ZkJ4?showinfo=0", "uploader": "wikiHow", "views": 117, "duration": 78, "description": "What would a Thanksgiving feast be without cranberry sauce?\n\nWhile many of us grew up on the canned concoction (complete with can rings embedded into the gel), real homemade cranberry sauce is the stuff of legends. It's super easy to make, and amazingly delicious!\n\nRead more: https://www.wikihow.com/Make-Cranberry-Sauce\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "3gaALn0ZkJ4.mp4", "subtitles": ""}, {"title": "How to Make Cream from Milk", "id": "Ng04tYPHHQ0", "url": "https://www.youtube.com/embed/Ng04tYPHHQ0?showinfo=0", "uploader": "wikiHow", "views": 15967, "duration": 83, "description": "This quick video will give you some tips on how to make cream from milk at home!\r\n\r\nRead more: https://www.wikihow.com/Make-Cream-from-Milk\n\r\nFollow our social media channels to find more interesting, easy, and helpful guides!\r\n\r\nFacebook: https://www.facebook.com/wikiHow/\r\nTwitter: https://twitter.com/wikiHow\r\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "Ng04tYPHHQ0.mp4", "subtitles": "to make heavy cream from milk first melt 1/3 cup 75 grams of butter in a bowl in the microwave then at 2/3 cup 150 grams of whole milk to the bowl and stir together with a wooden spoon once the butter and milk are completely mixed together you're done to make whipped cream first pour 1/4 cup 60 grams of cold whole milk into a large bowl scatter 2 teaspoons 6 grams of powdered unflavored gelatin over the surface of the milk and let it sit for 5 minutes after 5 minutes the mixture should look spongy next heat the mixture in the microwave for 10 to 20 seconds to turn it back into a liquid then pour 1 cup 240 grams of whole milk into a separate bowl and stir in 2 tablespoons of powdered sugar 25 grams combine the contents of both bowls and whisk for 20 to 30 seconds place the bowl in the fridge for 20 minutes finally beat the mixture with an electric mixer until the milk becomes thick and doubles in sizeto make heavy cream from milk first melt 1/3 cup 75 grams of butter in a bowl in the microwave then at 2/3 cup 150 grams of whole milk to the bowl and stir together with a wooden spoon once the butter and milk are completely mixed together you're done to make whipped cream first pour 1/4 cup 60 grams of cold whole milk into a large bowl scatter 2 teaspoons 6 grams of powdered unflavored gelatin over the surface of the milk and let it sit for 5 minutes after 5 minutes the mixture should look spongy next heat the mixture in the microwave for 10 to 20 seconds to turn it back into a liquid then pour 1 cup 240 grams of whole milk into a separate bowl and stir in 2 tablespoons of powdered sugar 25 grams combine the contents of both bowls and whisk for 20 to 30 seconds place the bowl in the fridge for 20 minutes finally beat the mixture with an electric mixer until the milk becomes thick and doubles in size"}, {"title": "How to Make Cupcakes", "id": "wVhvtmvErr8", "url": "https://www.youtube.com/embed/wVhvtmvErr8?showinfo=0", "uploader": "wikiHow", "views": 107, "duration": 112, "description": "Learn How to Make Cupcakes with this guide from wikiHow: https://www.wikihow.com/Make-Cupcakes\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "wVhvtmvErr8.mp4", "subtitles": "to make vanilla cupcakes first pre-heat your oven to 350 degrees Fahrenheit or 175 degrees Celsius and line a muffin pan with cupcake liners then add 1/4 cup or 55 grams of softened butter 1/4 cup or 60 milliliters of vegetable oil and 3/4 cup or 150 grams of sugar to a large bowl cream everything together with a hand mixer until well blended next beat in 3/4 cup or 175 milliliters of buttermilk 2 eggs and 2 teaspoons or 10 milliliters of vanilla extract gradually mix in 1 in 3/4 cups or 225 grams of flour then add 2 teaspoons or 8 grams of baking powder and 1/4 teaspoon or 1 and 1/2 grams of salt mix until all of the ingredients are just combined and pour the batter into the muffin pan so each cupcake liner is half-full bake the cupcakes for 14 to 18 minutes or until a toothpick inserted into the center comes out clean finally let the cupcakes cool completely before frosting them to make your own vanilla frosting first beat 1 cup or 220 grams of softened butter in a bowl until it's smooth then add three cups or 360 grams of confectioner's sugar and two teaspoons or 10 milliliters of vanilla extract and mix until well blended finally gradually beat in two tablespoons or thirty milliliters of heavy cream youto make vanilla cupcakes first pre-heat your oven to 350 degrees Fahrenheit or 175 degrees Celsius and line a muffin pan with cupcake liners then add 1/4 cup or 55 grams of softened butter 1/4 cup or 60 milliliters of vegetable oil and 3/4 cup or 150 grams of sugar to a large bowl cream everything together with a hand mixer until well blended next beat in 3/4 cup or 175 milliliters of buttermilk 2 eggs and 2 teaspoons or 10 milliliters of vanilla extract gradually mix in 1 in 3/4 cups or 225 grams of flour then add 2 teaspoons or 8 grams of baking powder and 1/4 teaspoon or 1 and 1/2 grams of salt mix until all of the ingredients are just combined and pour the batter into the muffin pan so each cupcake liner is half-full bake the cupcakes for 14 to 18 minutes or until a toothpick inserted into the center comes out clean finally let the cupcakes cool completely before frosting them to make your own vanilla frosting first beat 1 cup or 220 grams of softened butter in a bowl until it's smooth then add three cups or 360 grams of confectioner's sugar and two teaspoons or 10 milliliters of vanilla extract and mix until well blended finally gradually beat in two tablespoons or thirty milliliters of heavy cream you"}, {"title": "3-Ingredient Peanut Butter Cookies", "id": "4hMfOmqD720", "url": "https://www.youtube.com/embed/4hMfOmqD720", "uploader": "Tasty", "views": 1073071, "duration": 46, "description": "Here is what you'll need!\n\n3-INGREDIENT PEANUT BUTTER COOKIES\nMakes 25-30 cookies\n\nINGREDIENTS\n1 cup peanut butter\n½ cup sugar\n1 egg\n\nPREPARATION\n1. Preheat oven to 350ºF/180ºC.\n2. In a large bowl, mix together the peanut butter, sugar, and egg. \n3. Scoop out a spoonful of dough and roll it into a ball. Place the cookie balls onto a nonstick baking sheet.\n4. For extra decoration and to make them cook more evenly, flatten the cookie balls by pressing a fork down on top of them, then press it down again at a 90º angle to make a criss-cross pattern.\n5. Bake for 8-10 minutes or until the bottom of the cookies are golden brown.\n6. Remove from baking sheet and cool.\n\n\nCheck us out on Facebook! - facebook.com/buzzfeedtasty\n\nMUSIC\nWhat's Wrong With That Instrumental_FullMix.aif\nLicensed via Warner Chappell Production Music Inc.\n\nCreated by https://www.buzzfeed.com/bfmp/videos/11788", "hosted_mp4": "4hMfOmqD720.mp4", "subtitles": ""}, {"title": "How to Make Frozen Hot Chocolate", "id": "iQZHaGxhAMs", "url": "https://www.youtube.com/embed/iQZHaGxhAMs", "uploader": "Guidecentral English", "views": 119, "duration": 37, "description": "Learn how to make frozen hot chocolate with this guide from wikiHow: https://www.wikihow.com/Make-Frozen-Hot-Chocolate\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "iQZHaGxhAMs.mp4", "subtitles": "to make frozen hot chocolate pour milk and hot chocolate mix into your blender if you like you can add pure chocolate extract or vanilla extract to add extra flavor top off the mixture with ice then place the lid on your blender and turn it on low to break up the ice once the ice is broken into small pieces use a rubber spatula to scrape the unmixed hot chocolate into the mixture and blend it on high speed until the mixture is smooth although it will have a grainy texture pour the frozen hot chocolate into tall glasses and serve it immediatelyto make frozen hot chocolate pour milk and hot chocolate mix into your blender if you like you can add pure chocolate extract or vanilla extract to add extra flavor top off the mixture with ice then place the lid on your blender and turn it on low to break up the ice once the ice is broken into small pieces use a rubber spatula to scrape the unmixed hot chocolate into the mixture and blend it on high speed until the mixture is smooth although it will have a grainy texture pour the frozen hot chocolate into tall glasses and serve it immediately"}, {"title": "How to Make Green Beans", "id": "exrMHovBYCM", "url": "https://www.youtube.com/embed/exrMHovBYCM?showinfo=0", "uploader": "wikiHow", "views": 12, "duration": 80, "description": "Learn how to make green beans with this guide from wikiHow: https://www.wikihow.com/Make-Green-Beans\n\n0:00 Boiling Fresh Green Beans\n0:28 Steaming Fresh Green Beans\n0:42 Sauté Green Beans\n1:01 Stewing Green Beans\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "exrMHovBYCM.mp4", "subtitles": ""}, {"title": "How to Make Heavy Cream", "id": "4qJ1WdkHUdY", "url": "https://www.youtube.com/embed/4qJ1WdkHUdY?showinfo=0", "uploader": "wikiHow", "views": 272115, "duration": 45, "description": "You can make a perfect homemade heavy cream with just 2 ingredients – milk and butter – and a whisk. This substitute will not whip into whipping cream like store-bought heavy cream, but is an excellent replacement for heavy cream in most recipes. \n\nVideo Transcript: https://www.wikihow.com/Make-Heavy-Cream#videotranscript\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "4qJ1WdkHUdY.mp4", "subtitles": "to make one cup 240 milliliters of heavy cream first place a third cup 75 grams of unsalted butter in a microwave-safe bowl microwave the butter on high for 10 seconds at a time until it's fully melted then take the butter out of the microwave and let it cool for one to two minutes finally pour two thirds cup 160 milliliters of whole milk into the melted butter and whisk the ingredients together for 1 minute you now have heavy cream store your homemade heavy cream in the refrigerator for up to 2 days remix the cream when you take it out of the fridge before using itto make one cup 240 milliliters of heavy cream first place a third cup 75 grams of unsalted butter in a microwave-safe bowl microwave the butter on high for 10 seconds at a time until it's fully melted then take the butter out of the microwave and let it cool for one to two minutes finally pour two thirds cup 160 milliliters of whole milk into the melted butter and whisk the ingredients together for 1 minute you now have heavy cream store your homemade heavy cream in the refrigerator for up to 2 days remix the cream when you take it out of the fridge before using it"}, {"title": "How to Make Hibiscus Tea", "id": "TTk89sxaWKI", "url": "https://www.youtube.com/embed/TTk89sxaWKI?showinfo=0", "uploader": "wikiHow", "views": 1184, "duration": 73, "description": "Learn how to make hibiscus tea with this guide from wikiHow: https://www.wikihow.com/Make-Hibiscus-Tea\n\n0:00 Making Hot Hibiscus Tea\n0:45 Making Jamaica-Style Hibiscus Iced Tea\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "TTk89sxaWKI.mp4", "subtitles": ""}, {"title": "How to Make Icing", "id": "amUTyh_sbew", "url": "https://www.youtube.com/embed/amUTyh_sbew?showinfo=0", "uploader": "wikiHow", "views": 531, "duration": 45, "description": "Learn How to Make Icing with this guide from wikiHow: https://www.wikihow.com/Make-Icing\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "amUTyh_sbew.mp4", "subtitles": "Team a grade noi saeng sr1 value want to assemble veil vaccine saberTeam a grade noi saeng sr1 value want to assemble veil vaccine saber Team a grade noi saeng sr1 value want to assemble veil vaccine saber  when dying ju and now this look is solid barley rice where you want to make a goodwhen dying ju and now this look is solid barley rice where you want to make a good  living dr saeng tv sang phone what the mandible tesol of ro ​​swrliving dr saeng tv sang phone what the mandible tesol of ro ​​swr living dr saeng tv sang phone what the mandible tesol of ro ​​swrnos ltd ah We have a big bindnos ltd ah We have a big bind nos ltd ah We have a big bindbasic maker, Thing 3 is a collection of moonsbasic maker, Thing 3 is a collection of moons basic maker, Thing 3 is a collection of moons. At some point, you can know the color of the dog. Tight shawl. At some point, you can know the color of the dog. Tight shawl . At some point, you can know the color of the dog. Tight shawlouter cell or nfl bra is q"}, {"title": "How to Make Liquid Starch", "id": "fkar3wwWqSM", "url": "https://www.youtube.com/embed/fkar3wwWqSM?showinfo=0", "uploader": "wikiHow", "views": 6296, "duration": 80, "description": "Learn how to make liquid starch with this guide from wikiHow: https://www.wikihow.com/Make-Liquid-Starch\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "fkar3wwWqSM.mp4", "subtitles": ""}, {"title": "Quick Cooking Tip: Making Melba Toast", "id": "-hJLWZpTB5Y", "url": "https://www.youtube.com/embed/-hJLWZpTB5Y", "uploader": "WhatsForDinner", "views": 39886, "duration": 50, "description": "Don’t waste money by buying melba toast! With these What’s for Dinner cooking tips, you can easily make it yourself. Melba Toast works exceptionally well on a cheese platter or served with some pâté. How’s that for two easy and impressive dinner party ideas? With What’s for Dinner, easy recipes just got easier!\n\nEvery day South Africans ask the question “What’s for Dinner?” So we created a free platform that aims to help South Africans prepare wholesome and nutritious meals for themselves and their loved ones. Here you’ll find new meal ideas and all time classics that the Knorr Chefs have refined and made as easy as possible for you. Ask Chef Wendy for her top tips when you need assistance and join thousands of hungry others in the What’s for Dinner? Community @ http://www.whatsfordinner.co.za/.", "hosted_mp4": "-hJLWZpTB5Y.mp4", "subtitles": "Take sliced bread and cut off the crusts.Place them on an oven tray and pop under a hot grill.Always keep the oven door open while grilling,and watch them so they don't burn.After a few minutes,turn them over, and return to the oven for another minute or two.Remove from the oven,and, with a sharp knife,cut each slice in halfso you are left with two thinner slices.Return to the oven for another minute to let the exposed sides crisp up.Your Melba Toast is now ready to serve with soft cheese, hummus or pâté.."}, {"title": "How to Make Meringue", "id": "3C_lL9eHRT8", "url": "https://www.youtube.com/embed/3C_lL9eHRT8?showinfo=0", "uploader": "wikiHow", "views": 184, "duration": 66, "description": "Learn How to Make Meringue with this guide from wikiHow: https://www.wikihow.com/Make-Meringue\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "3C_lL9eHRT8.mp4", "subtitles": "tool to counsel soul eater sp alerttool to counsel soul eater sp alert tool to counsel soul eater sp alerterror to my old i go to see in order toerror to my old i go to see in order to error to my old i go to see in order toy must over hoody tsf watch owly must over hoody tsf watch owl y must over hoody tsf watch owlfit note s back la crème so a b d lg than shore olsenfit note s back la crème so a b d lg than shore olsen fit note s back la crème so a b d lg than shore olsenmaxwell sits gum m mathematician When he'smaxwell sits gum m mathematician When he's maxwell sits gum m mathematician When he'sxl1 waka wants one option,xl1 waka wants one option, xl1 waka wants one option,one moisturizing is owarione moisturizing is owari one moisturizing is owariwho was up x4 oa too short expert on bwho was up x4 oa too short expert on b"}, {"title": "How to Make No Bake Cookies", "id": "GKTaaO6590U", "url": "https://www.youtube.com/embed/GKTaaO6590U?showinfo=0", "uploader": "wikiHow", "views": 103, "duration": 36, "description": "Learn How to Make No Bake Cookies with this guide from wikiHow: https://www.wikihow.com/Make-No-Bake-Cookies\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "GKTaaO6590U.mp4", "subtitles": ""}, {"title": "How to Make Orange", "id": "sDXHM9qG1HE", "url": "https://www.youtube.com/embed/sDXHM9qG1HE?showinfo=0", "uploader": "wikiHow", "views": 568, "duration": 44, "description": "Learn How to Make Orange with this guide from wikiHow: https://www.wikihow.com/Make-Orange\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "sDXHM9qG1HE.mp4", "subtitles": "to make orange paint mixed together equal parts red and yellow paint for a lighter yellow orange color mixed together one part red paint and two parts yellow paint to make a darker red orange color combine one part yellow paint and two parts red paint if you don't have yellow paint mix together equal parts red and green paint to make yellow then mix that with more red paint to make orange to make orange food coloring mixed together equal parts red and yellow food coloring add more red food coloring to make the color darker or add more yellow food coloring to make it lighterto make orange paint mixed together equal parts red and yellow paint for a lighter yellow orange color mixed together one part red paint and two parts yellow paint to make a darker red orange color combine one part yellow paint and two parts red paint if you don't have yellow paint mix together equal parts red and green paint to make yellow then mix that with more red paint to make orange to make orange food coloring mixed together equal parts red and yellow food coloring add more red food coloring to make the color darker or add more yellow food coloring to make it lighter"}, {"title": "How to Make Pancake Batter", "id": "8hsNUnY6YZk", "url": "https://www.youtube.com/embed/8hsNUnY6YZk?showinfo=0", "uploader": "wikiHow", "views": 603, "duration": 82, "description": "Learn How to Make Pancake Batter with this guide from wikiHow: https://www.wikihow.com/Make-Pancake-Batter\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "8hsNUnY6YZk.mp4", "subtitles": "nail pen type pearlnail pen type pearl nail pen type pearl+ l onna half kattsu on &amp; ad Graeme Spoon + power+ l onna half kattsu on &amp; ad Graeme Spoon + power + l onna half kattsu on &amp; ad Graeme Spoon + power2 tablespoons without 5 a 6 f sugar2 tablespoons without 5 a 6 f sugar 2 tablespoons without 5 a 6 f sugar1 tablespoon1 tablespoon 1 tablespoonFesting Reimu no bakingFesting Reimu no baking Festing Reimu no bakingn half teaspoonn half teaspoon n half teaspoon2 points 5 frames without lies 2 mix conspiracies2 points 5 frames without lies 2 mix conspiracies 2 points 5 frames without lies 2 mix conspiracieslet's save on petit line green star cablet's save on petit line green star cab let's save on petit line green star cabn sharp and open horse sister districtn sharp and open horse sister district n sharp and open horse sister district1 force carp shake tones ahu no 91 force carp shake tones ahu no 9 1 force carp shake tones ahu no 94 tablespoons no stingray amnos baller4 tablespoons no stingray amnos baller 4 tablespoons no stingray amnos ballernot spawnnot spawn not spawnpark me loose abloom egg shoppark me loose abloom egg shop park me loose abloom egg shopold dayold day old daystory next join Greenspin to win Greensstory next join Greenspin to win Greens story next join Greenspin to win GreensWitherspoon Chotto Balloo Smooth  Claw Pen kx with blueClaw Pen kx with blue Claw Pen kx with blueAlforce KaAlforce Ka Alforce KaCheck tCheck t Check tyou do ra Term Tona Sticks Kyoto wo Family feat teeyou do ra Term Tona Sticks Kyoto wo Family feat tee you do ra Term Tona Sticks Kyoto wo Family feat teeKutto Penx to do Iki Side no Jab Size Ivory Brown Do"}, {"title": "How to Make Pickles", "id": "Hzr0fDfzoBI", "url": "https://www.youtube.com/embed/Hzr0fDfzoBI", "uploader": "Guidecentral English", "views": 78, "duration": 35, "description": "Learn how to make pickles with this guide from wikiHow: https://www.wikihow.com/Make-Pickles\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "Hzr0fDfzoBI.mp4", "subtitles": ""}, {"title": "Rainbow Fruit Salad With Honey Lime Dressing", "id": "hYGZMWt1mOI", "url": "https://www.youtube.com/embed/hYGZMWt1mOI", "uploader": "Tasty", "views": 488223, "duration": 53, "description": "Customize & buy the Tasty Cookbook here: http://bzfd.it/2fpfeu5\n\nHere is what you'll need!\n\nRainbow Fruit Salad With Honey Lime Dressing\nServings: 4 - 6\n\nINGREDIENTS\n1 pound fresh strawberries, quartered\n4 kiwis, peeled and diced\n2 mangoes, diced\n2 bananas, sliced\n12 ounces fresh blueberries\n2 tablespoons honey\n1 lime, juiced\n\n\n\nPREPARATION\n1. Place sliced fruits in a large salad bowl.\n2. In a small bowl mix honey and lime juice. Pour syrup over the fruit and mix.\n\nInspired by http://www.cookingclassy.com/honey-lime-rainbow-fruit-salad/\n\nCheck us out on Facebook! - facebook.com/buzzfeedtasty\n\nMUSIC\nLicensed via Audio Network\n\nCreated by https://www.buzzfeed.com/bfmp/videos/9366", "hosted_mp4": "hYGZMWt1mOI.mp4", "subtitles": ""}]