[{"title": "How to Store and Reheat Pizza", "id": "2AbIFNUhojQ", "url": "https://www.youtube.com/embed/2AbIFNUhojQ?showinfo=0", "uploader": "wikiHow", "views": 12872, "duration": 33, "description": "This quick video will give you some tips on #howto store and reheat pizza!\n\nRead more: https://www.wikihow.com/Store-and-Reheat-Pizza\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "2AbIFNUhojQ.mp4", "subtitles": "to store and reheat pizza start by lining an airtight container with paper towels then put the pizza in the container and cover it with another layer of paper towels which will help absorb moisture so the pizza lasts longer store the pizza in the fridge until you're ready to eat it when you want to reheat the pizza put it on a baking sheet and cook it in the oven at 400 degrees Fahrenheit 205 degrees Celsius for 6 to 10 minutes depending on the thickness serve and enjoyto store and reheat pizza start by lining an airtight container with paper towels then put the pizza in the container and cover it with another layer of paper towels which will help absorb moisture so the pizza lasts longer store the pizza in the fridge until you're ready to eat it when you want to reheat the pizza put it on a baking sheet and cook it in the oven at 400 degrees Fahrenheit 205 degrees Celsius for 6 to 10 minutes depending on the thickness serve and enjoy"}, {"title": "How to Store Baking Soda", "id": "2LXdg4ugraA", "url": "https://www.youtube.com/embed/2LXdg4ugraA", "uploader": "Guidecentral English", "views": 1895, "duration": 35, "description": "Learn how to store baking soda with this guide from wikiHow: https://www.wikihow.com/Store-Baking-Soda\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "2LXdg4ugraA.mp4", "subtitles": ""}, {"title": "How to Store Bananas", "id": "PvapXqzCbwM", "url": "https://www.youtube.com/embed/PvapXqzCbwM?showinfo=0", "uploader": "wikiHow", "views": 1913, "duration": 57, "description": "Learn How to Store Bananas with this guide from wikiHow: https://www.wikihow.com/Store-Bananas\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "PvapXqzCbwM.mp4", "subtitles": ""}, {"title": "How to Store Boiled Eggs", "id": "hhfkNrFxkcM", "url": "https://www.youtube.com/embed/hhfkNrFxkcM?showinfo=0", "uploader": "wikiHow", "views": 17768, "duration": 21, "description": "This quick video will give you some tips on #howto store boiled eggs!\n\nRead more: https://www.wikihow.com/Store-Boiled-Eggs\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "hhfkNrFxkcM.mp4", "subtitles": ""}, {"title": "How to Store Dry Ice", "id": "otxeXf4eipg", "url": "https://www.youtube.com/embed/otxeXf4eipg", "uploader": "Guidecentral English", "views": 5865, "duration": 26, "description": "Learn how to store dry ice with this guide from wikiHow: https://www.wikihow.com/Store-Dry-Ice\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "otxeXf4eipg.mp4", "subtitles": "a beautiful you handle lies in spite ofa beautiful you handle lies in spite of a beautiful you handle lies in spite ofskin forskin for skin forwhen i first day at schoolwhen i first day at school when i first day at schooland special schools and composition ofand special schools and composition of and special schools and composition ofpersonal Royal tunbridge Wells to herpersonal Royal tunbridge Wells to her personal Royal tunbridge Wells to herschools and spacious commemoration ofschools and spacious commemoration of schools and spacious commemoration ofdisease a"}, {"title": "How to Store Lemons", "id": "jpkOPTH1_6s", "url": "https://www.youtube.com/embed/jpkOPTH1_6s?showinfo=0", "uploader": "wikiHow", "views": 635, "duration": 36, "description": "Learn How to Store Lemons with this guide from wikiHow: https://www.wikihow.com/Store-Lemons\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "jpkOPTH1_6s.mp4", "subtitles": "to store lemons that have been cut cover the exposed side of the fruit by placing them face down on a plate or wrapping them in plastic wrap then place the lemons in the refrigerator to keep them fresh and juicy cut lemons will last in the fridge for two to three days but you can also freeze lemon slices by placing them on a baking sheet lined with parchment paper in the freezer once the lemons are completely frozen you can put them in a plastic bag and store them in the freezer for several monthsto store lemons that have been cut cover the exposed side of the fruit by placing them face down on a plate or wrapping them in plastic wrap then place the lemons in the refrigerator to keep them fresh and juicy cut lemons will last in the fridge for two to three days but you can also freeze lemon slices by placing them on a baking sheet lined with parchment paper in the freezer once the lemons are completely frozen you can put them in a plastic bag and store them in the freezer for several months"}, {"title": "How to Store Onions", "id": "znpeiy5clfI", "url": "https://www.youtube.com/embed/znpeiy5clfI", "uploader": "Guidecentral English", "views": 666, "duration": 35, "description": "Learn how to store onions with this guide from wikiHow: https://www.wikihow.com/Store-Onions\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "znpeiy5clfI.mp4", "subtitles": "if you want to store onions fresh from the garden spread them out in a warm ventilated area for two to four weeks so the skins can harden once the skins are dry use sharp scissors or a knife to trim the roots at least one inch above the bulb choose a dark well-ventilated place to store your onions with a temperature that stays between 40 to 50 degrees fahrenheit such as a root cellar or a basement if you like you can place your onions into pantyhose tying knots between each onion to allow them to breathe and stay dry [Music]if you want to store onions fresh from the garden spread them out in a warm ventilated area for two to four weeks so the skins can harden once the skins are dry use sharp scissors or a knife to trim the roots at least one inch above the bulb choose a dark well-ventilated place to store your onions with a temperature that stays between 40 to 50 degrees fahrenheit such as a root cellar or a basement if you like you can place your onions into pantyhose tying knots between each onion to allow them to breathe and stay dry [Music]"}, {"title": "How to Store Radishes", "id": "GUyPtPjqEGU", "url": "https://www.youtube.com/embed/GUyPtPjqEGU?showinfo=0", "uploader": "wikiHow", "views": 3715, "duration": 24, "description": "Learn How to Store Radishes with this guide from wikiHow: https://www.wikihow.com/Store-Radishes\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "GUyPtPjqEGU.mp4", "subtitles": ""}, {"title": "How to Store Raspberries", "id": "z_AwSL0r4m0", "url": "https://www.youtube.com/embed/z_AwSL0r4m0", "uploader": "Guidecentral English", "views": 460, "duration": 31, "description": "Learn how to store raspberries with this guide from wikiHow: https://www.wikihow.com/Store-Raspberries\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "z_AwSL0r4m0.mp4", "subtitles": "to store raspberries in the fridge put them in a well-ventilated container like a colander or the container that they came in line the container with paper towels to help absorb moisture so the raspberries stay fresh if you want to store raspberries in the freezer so they last longer start by spreading them out on a lined baking sheet then freeze the raspberries on the baking sheet for several hours before transferring them to a freezer bag which will help prevent the raspberries from sticking together youto store raspberries in the fridge put them in a well-ventilated container like a colander or the container that they came in line the container with paper towels to help absorb moisture so the raspberries stay fresh if you want to store raspberries in the freezer so they last longer start by spreading them out on a lined baking sheet then freeze the raspberries on the baking sheet for several hours before transferring them to a freezer bag which will help prevent the raspberries from sticking together you"}, {"title": "How to Store Scallions", "id": "9PwqZyQjuaE", "url": "https://www.youtube.com/embed/9PwqZyQjuaE", "uploader": "Guidecentral English", "views": 234, "duration": 39, "description": "Learn how to store scallions with this guide from wikiHow: https://www.wikihow.com/Store-Scallions\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "9PwqZyQjuaE.mp4", "subtitles": "if you need to store scallions fill a jar with two inches of water then place the scallions upright in the jar so the roots are in the water cover the scallions with a plastic sandwich bag then place the jar of scallions in the fridge for up to a week to store scallions for longer than a week chop the scallions into small pieces and spread them on a small lined baking sheet then place the baking sheet into the freezer for three hours and transfer the scallions to a freezer-safe plastic bag place the scallions in the freezer where they will stay fresh for up to a yearif you need to store scallions fill a jar with two inches of water then place the scallions upright in the jar so the roots are in the water cover the scallions with a plastic sandwich bag then place the jar of scallions in the fridge for up to a week to store scallions for longer than a week chop the scallions into small pieces and spread them on a small lined baking sheet then place the baking sheet into the freezer for three hours and transfer the scallions to a freezer-safe plastic bag place the scallions in the freezer where they will stay fresh for up to a year"}, {"title": "How to Store Strawberries", "id": "KwawIea30Nk", "url": "https://www.youtube.com/embed/KwawIea30Nk", "uploader": "Guidecentral English", "views": 68, "duration": 28, "description": "Learn how to store strawberries with this guide from wikiHow: https://www.wikihow.com/Store-Strawberries\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "KwawIea30Nk.mp4", "subtitles": "to store strawberries for the short term line a large plastic container with a layer of paper towels then place the strawberries onto the paper towel in a single layer you can leave the container open to circulate the air but if the stems have been removed seal the container before placing it in the refrigerator strawberries will stay fresh in the refrigerator for several days until you're ready to eat themto store strawberries for the short term line a large plastic container with a layer of paper towels then place the strawberries onto the paper towel in a single layer you can leave the container open to circulate the air but if the stems have been removed seal the container before placing it in the refrigerator strawberries will stay fresh in the refrigerator for several days until you're ready to eat them"}, {"title": "How to Strain Juice", "id": "DOx6cBuTZrc", "url": "https://www.youtube.com/embed/DOx6cBuTZrc?showinfo=0", "uploader": "wikiHow", "views": 1192, "duration": 49, "description": "Learn how to strain juice with this guide from wikiHow: https://www.wikihow.com/Strain-Juice\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "DOx6cBuTZrc.mp4", "subtitles": "what's up"}, {"title": "How to Sweeten Your Watermelon", "id": "LsI6T8C2nIA", "url": "https://www.youtube.com/embed/LsI6T8C2nIA?showinfo=0", "uploader": "wikiHow", "views": 3487, "duration": 73, "description": "Learn how to sweeten your watermelon with this guide from wikiHow: https://www.wikihow.com/Sweeten-Your-Watermelon\n\n0:00 Using Salt \n0:33 Using Sugar, Balsamic Glaze, Lemon Juice or Sweet Cream\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "LsI6T8C2nIA.mp4", "subtitles": "and thereand there and thereand there"}, {"title": "How to Tell if a Mango Is Ripe", "id": "RCg9BOqPh1U", "url": "https://www.youtube.com/embed/RCg9BOqPh1U", "uploader": "Guidecentral English", "views": 834, "duration": 34, "description": "Learn how to tell if a mango is ripe with this guide from wikiHow: https://www.wikihow.com/Tell-if-a-Mango-Is-Ripe\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "RCg9BOqPh1U.mp4", "subtitles": "if you want to check a mango for ripeness hold it in your hand and squeeze gently with your palm if the mango indents slightly it's probably right if the mango is hard it needs more time to ripen and if it's squishy it's overripe and should be discarded next run your fingers over the skin of the mango most ripe mangoes will have some wrinkles in the skin although some will stay smooth finally test the weight in your hand a ripe mango will feel heavier for its size than an unripe mango for tips on ripening a mango keep readingif you want to check a mango for ripeness hold it in your hand and squeeze gently with your palm if the mango indents slightly it's probably right if the mango is hard it needs more time to ripen and if it's squishy it's overripe and should be discarded next run your fingers over the skin of the mango most ripe mangoes will have some wrinkles in the skin although some will stay smooth finally test the weight in your hand a ripe mango will feel heavier for its size than an unripe mango for tips on ripening a mango keep reading"}, {"title": "How to tell if an egg has been hard boiled", "id": "bqLOjkPPPfc", "url": "https://www.youtube.com/embed/bqLOjkPPPfc", "uploader": "RhinosoRoss", "views": 96239, "duration": 13, "description": "http://knol.google.com/k/boss-shot/make-peas-delicious/uk1ykg8l6p5z/1#\r\n\r\nThe liquid (yolk and white) inside raw eggs doesn't spin (or stop spinning) as fast as the shell.\r\n\r\nIf you've cooked a batch of hard-boiled eggs and put them in the fridge... then someone else has moved them... you can find out which are raw and which are cooked just by spinning them.", "hosted_mp4": "bqLOjkPPPfc.mp4", "subtitles": ""}, {"title": "How to Tenderize Chicken", "id": "Y5MDy4LMfCw", "url": "https://www.youtube.com/embed/Y5MDy4LMfCw?showinfo=0", "uploader": "wikiHow", "views": 21697, "duration": 53, "description": "Learn how to tenderize chicken with this guide from wikiHow: https://www.wikihow.com/Tenderize-Chicken\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "Y5MDy4LMfCw.mp4", "subtitles": "to tenderize chicken first lay a sheet of plastic wrap over a clean cutting board place your thought boneless chicken on top of the plastic wrap then lay another piece of plastic wrap over it press the plastic wrap down around the edges of the chicken to compress it next gently pound each section of the meat with a tenderizing mallet for 30 seconds this will break down the fibers in the meat which will make the chicken much more tender when you cook it finally peel the plastic wrap off and season or cut your chicken before cooking it keep in mind that the older or tougher the meat the longer you should tenderize it before cooking if you have a fresh cut of quality chicken you don't need to tenderize it at allto tenderize chicken first lay a sheet of plastic wrap over a clean cutting board place your thought boneless chicken on top of the plastic wrap then lay another piece of plastic wrap over it press the plastic wrap down around the edges of the chicken to compress it next gently pound each section of the meat with a tenderizing mallet for 30 seconds this will break down the fibers in the meat which will make the chicken much more tender when you cook it finally peel the plastic wrap off and season or cut your chicken before cooking it keep in mind that the older or tougher the meat the longer you should tenderize it before cooking if you have a fresh cut of quality chicken you don't need to tenderize it at all"}, {"title": "Quick Tips: How to Test If a Dish is Microwavable", "id": "yGtvZc0gMqo", "url": "https://www.youtube.com/embed/yGtvZc0gMqo", "uploader": "Howcast", "views": 25274, "duration": 20, "description": "Full Playlist: https://www.youtube.com/playlist?list=PLLALQuK1NDrj4G_X93bgPzTj8SZhEBcVD\n-\n-\nWatch more Food Quick Tips videos: http://www.howcast.com/videos/414666-Quick-Tips-How-to-Test-If-a-Dish-is-Microwavable\n\n\n\nMan: Not sure if a dish is microwave safe?\n\nWoman: Quick tips!\n\nMan: Nuke it for one minute alongside a cup of water. If the plate gets hot but the water doesn't, the dish isn't microwavable. Hot stuff!", "hosted_mp4": "yGtvZc0gMqo.mp4", "subtitles": "not sure if a dish is microwave safe quick tip nuke it for one minute alongside a cup of water if the plate gets hot but the water doesn't the dish isn't microwavable hot stuffnot sure if a dish is microwave safe quick tip nuke it for one minute alongside a cup of water if the plate gets hot but the water doesn't the dish isn't microwavable hot stuff"}, {"title": "How to Thicken Gravy", "id": "zA99Qn2T_9g", "url": "https://www.youtube.com/embed/zA99Qn2T_9g?showinfo=0", "uploader": "wikiHow", "views": 370, "duration": 50, "description": "Learn how to thicken gravy with this guide from wikiHow: https://www.wikihow.com/Thicken-Gravy\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "zA99Qn2T_9g.mp4", "subtitles": "Format WindowsFormat Windows Format Windowsrepair system for Plants of flower inrepair system for Plants of flower in repair system for Plants of flower inthe Global War on the last forces of thethe Global War on the last forces of the the Global War on the last forces of thepistes internet live events that timepistes internet live events that time pistes internet live events that timethe great eastern condorsthe great eastern condors the great eastern condorsin the abdomen yuxin mistletoes birth Treein the abdomen yuxin mistletoes birth Tree in the abdomen yuxin mistletoes birth TreeFriends accumulated expenses for finalistsFriends accumulated expenses for finalists Friends accumulated expenses for finalistsof all your fault is rare steakof all your fault is rare steak of all your fault is rare steakintegrateintegrate integrate3 notes of integration justable edestus3 notes of integration justable edestus 3 notes of integration justable edestuspiqueras Advanced resource forpiqueras Advanced resource for piqueras Advanced resource forintegrative Skills and forever i"}, {"title": "Stew Recipes : How to Thicken Beef Stew Gravy", "id": "v2Nmg6aGeXg", "url": "https://www.youtube.com/embed/v2Nmg6aGeXg", "uploader": "cookingguide", "views": 159529, "duration": 58, "description": "There are several ways to thicken beef stew gravy, from the old-fashioned way to the modern way. Thicken your beef stew gravy with help from a head cook in this free video on stew recipes.\n\nExpert: Susan Walker\nBio: Sue Walker owns her own freelance cooking business. She worked as a pastry chef and a full-time head cook for more than 10 years before deciding to start her own company.\nFilmmaker: Luke Neumann", "hosted_mp4": "v2Nmg6aGeXg.mp4", "subtitles": "hi I'm sue Walker and I'm going to show you how to thicken beef stew gravy the things you will need are your hot stew a 1 cup measuring cup a 1 tablespoon measuring spoon and a whisk there are several ways to thicken beef stew gravy the old-fashioned way is to mix water and flour together take 1 cup of water and mix 2 to 3 tablespoons of flour into it using a small whisk until all the lumps are gone then add it to the stool and stir until thick if it is not thick enough repeat this but only add what is needed to thicken the stew another way to thicken beef stew gravy is to use water and cornstarch - 1 cup of water mix in 2 tablespoons of cornstarch until smooth add it to the stew and stir until thick and that is how to thicken beef stew gravyhi I'm sue Walker and I'm going to show you how to thicken beef stew gravy the things you will need are your hot stew a 1 cup measuring cup a 1 tablespoon measuring spoon and a whisk there are several ways to thicken beef stew gravy the old-fashioned way is to mix water and flour together take 1 cup of water and mix 2 to 3 tablespoons of flour into it using a small whisk until all the lumps are gone then add it to the stool and stir until thick if it is not thick enough repeat this but only add what is needed to thicken the stew another way to thicken beef stew gravy is to use water and cornstarch - 1 cup of water mix in 2 tablespoons of cornstarch until smooth add it to the stew and stir until thick and that is how to thicken beef stew gravy"}, {"title": "How to Toast Pecans", "id": "4JRG36dnJ-0", "url": "https://www.youtube.com/embed/4JRG36dnJ-0?showinfo=0", "uploader": "wikiHow", "views": 4607, "duration": 42, "description": "Learn How to Toast Pecans with this guide from wikiHow: https://www.wikihow.com/Toast-Pecans\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "4JRG36dnJ-0.mp4", "subtitles": "- toast pecans spread them out on a greased baking sheet and toast them in the oven for 10 to 15 minutes at 300 degrees Fahrenheit 150 degrees Celsius flip the pecans over halfway through so they toast evenly on both sides if you want to toast pecans on the stovetop start by preheating a skillet over high heat then turn the heat down to medium and add the pecans to the skillet stirring constantly as they cook once the pecan start to turn brown and develop a nutty smell remove them from the heat enjoy- toast pecans spread them out on a greased baking sheet and toast them in the oven for 10 to 15 minutes at 300 degrees Fahrenheit 150 degrees Celsius flip the pecans over halfway through so they toast evenly on both sides if you want to toast pecans on the stovetop start by preheating a skillet over high heat then turn the heat down to medium and add the pecans to the skillet stirring constantly as they cook once the pecan start to turn brown and develop a nutty smell remove them from the heat enjoy"}]