[{"title": "How to Steam Lobster", "id": "TMyUQbbdVtQ", "url": "https://www.youtube.com/embed/TMyUQbbdVtQ?showinfo=0", "uploader": "wikiHow", "views": 403, "duration": 57, "description": "Learn how to steam lobster with this guide from wikiHow: https://www.wikihow.com/Steam-Lobster\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "TMyUQbbdVtQ.mp4", "subtitles": "to steam a lobster first place the live lobster on a cutting board place the tip of a chef's knife one inch 2.5 centimeters above the first striation and insert the knife straight down through the lobster move the blade down so it's parallel to the cutting board to humanely kill the lobster then set a steaming rack inside of a large pot fill the pot with 2 inches five centimeters of water and add one tablespoon 17 grams of salt bring the water to a boil then place the lobster on the steaming rack and cover the pot steam a 1 pound half a kilogram lobster for 14 minutes adding 3 minutes for each additional pound half a kilogram finally drain the lobster and serve with some melted butterto steam a lobster first place the live lobster on a cutting board place the tip of a chef's knife one inch 2.5 centimeters above the first striation and insert the knife straight down through the lobster move the blade down so it's parallel to the cutting board to humanely kill the lobster then set a steaming rack inside of a large pot fill the pot with 2 inches five centimeters of water and add one tablespoon 17 grams of salt bring the water to a boil then place the lobster on the steaming rack and cover the pot steam a 1 pound half a kilogram lobster for 14 minutes adding 3 minutes for each additional pound half a kilogram finally drain the lobster and serve with some melted butter"}, {"title": "How to Store Fresh Basil", "id": "UhMyUuaE21A", "url": "https://www.youtube.com/embed/UhMyUuaE21A?showinfo=0", "uploader": "wikiHow", "views": 5071, "duration": 148, "description": "Learn how to store fresh basil with this guide from wikiHow: https://www.wikihow.com/Store-Fresh-Basil\n\n0:00 Storing a \"Bouquet\" of Basil\n0:33 Stashing Leaves in the Fridge\n1:08 Freezing Fresh Basil Leaves\n1:58 Keeping Potted Basil Indoors\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "UhMyUuaE21A.mp4", "subtitles": ""}, {"title": "How to Store Fresh Green Beans", "id": "kYZJKvZaCG4", "url": "https://www.youtube.com/embed/kYZJKvZaCG4?showinfo=0", "uploader": "wikiHow", "views": 32214, "duration": 30, "description": "This quick video will give you some tips on #howto store fresh green beans!\n\nRead more: https://www.wikihow.com/Store-Fresh-Green-Beans\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "kYZJKvZaCG4.mp4", "subtitles": "if you need to store fresh green beans to use within a week use a sharp knife to carefully cut off the knobby ends of the beans do not wash the beans before you store them as the moisture can cause mold to form fold a paper towel and place it into a large resealable bag to absorb moisture then fill the bag with the green beans push as much air out of the bag as you can before you seal it wash the beans before you use themif you need to store fresh green beans to use within a week use a sharp knife to carefully cut off the knobby ends of the beans do not wash the beans before you store them as the moisture can cause mold to form fold a paper towel and place it into a large resealable bag to absorb moisture then fill the bag with the green beans push as much air out of the bag as you can before you seal it wash the beans before you use them"}, {"title": "How to Store Fresh Rosemary", "id": "ot3w0ObYiLg", "url": "https://www.youtube.com/embed/ot3w0ObYiLg", "uploader": "Guidecentral English", "views": 1308, "duration": 32, "description": "Learn how to store fresh rosemary with this guide from wikiHow: https://www.wikihow.com/Store-Fresh-Rosemary\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "ot3w0ObYiLg.mp4", "subtitles": "to store fresh rosemary start by rinsing the springs in cool water and placing them on a paper towel to pat them dry then wrap the whole uncut springs in a damp paper towel to prevent them from drying out place the wrap springs in a ziploc bag or air tight container and write the date on the bag or container store the bag in the crisper drawer of the refrigerator and set the humidity in the drawer to high you can store the rosemary here for up to two weeks before it will begin to turn brown and loses freshnessto store fresh rosemary start by rinsing the springs in cool water and placing them on a paper towel to pat them dry then wrap the whole uncut springs in a damp paper towel to prevent them from drying out place the wrap springs in a ziploc bag or air tight container and write the date on the bag or container store the bag in the crisper drawer of the refrigerator and set the humidity in the drawer to high you can store the rosemary here for up to two weeks before it will begin to turn brown and loses freshness"}, {"title": "How to Store Guacamole", "id": "U7Poo8AAIas", "url": "https://www.youtube.com/embed/U7Poo8AAIas?showinfo=0", "uploader": "wikiHow", "views": 1301, "duration": 28, "description": "This quick video will give you some tips on #howto store guacamole!\n\nRead more: https://www.wikihow.com/Store-Guacamole\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "U7Poo8AAIas.mp4", "subtitles": "to store guacamole first transfer it into an airtight container and pack it down with a spoon then pour a little bit of water or lime juice over the top since contact with the air will cause the guacamole to turn brown cover the container with plastic wrap before putting on the lid store the guacamole in the fridge for three to five daysto store guacamole first transfer it into an airtight container and pack it down with a spoon then pour a little bit of water or lime juice over the top since contact with the air will cause the guacamole to turn brown cover the container with plastic wrap before putting on the lid store the guacamole in the fridge for three to five days"}, {"title": "How to Store Potatoes", "id": "oYP_GU34x3U", "url": "https://www.youtube.com/embed/oYP_GU34x3U?showinfo=0", "uploader": "wikiHow", "views": 779, "duration": 43, "description": "Learn How to Store Potatoes with this guide from wikiHow: https://www.wikihow.com/Store-Potatoes\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "oYP_GU34x3U.mp4", "subtitles": "to store potatoes first place them in an open bag basket or other ventilated container since closed containers make potatoes spoil faster then store the potatoes in a cool dry dark place like a pantry or your basement don't keep raw potatoes in the fridge since the cold temperature can change how they taste stored this way potatoes will stay good for around one to two weeks for longer-term storage keep the potatoes at 45 and 55 degrees Fahrenheit 7 and 13 degrees Celsius where they'll stay good for up to 3 monthsto store potatoes first place them in an open bag basket or other ventilated container since closed containers make potatoes spoil faster then store the potatoes in a cool dry dark place like a pantry or your basement don't keep raw potatoes in the fridge since the cold temperature can change how they taste stored this way potatoes will stay good for around one to two weeks for longer-term storage keep the potatoes at 45 and 55 degrees Fahrenheit 7 and 13 degrees Celsius where they'll stay good for up to 3 months"}, {"title": "How to Use Banana Peels", "id": "JGiv2A6XXD8", "url": "https://www.youtube.com/embed/JGiv2A6XXD8", "uploader": "wikiHow", "views": 145, "duration": 69, "description": "Learn how to use banana peels with this guide from wikiHow: https://www.wikihow.com/Use-Banana-Peels\n\n0:00 Eating\n0:35 Applying to Skin\n0:50 Using in the Yard\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "JGiv2A6XXD8.mp4", "subtitles": "and thereand there and thereand there"}, {"title": "How to Use Egg Yolks", "id": "7obeNv3Jlw4", "url": "https://www.youtube.com/embed/7obeNv3Jlw4?showinfo=0", "uploader": "wikiHow", "views": 40447, "duration": 120, "description": "Learn how to use egg yolks with this guide from wikiHow: https://www.wikihow.com/Use-Egg-Yolks\n\n0:00 Making an Egg Wash\n0:25 Creating a Custard\n1:25 Making Mayonnaise\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "7obeNv3Jlw4.mp4", "subtitles": "yeah yeah  [music]  [music]  um yeah  [music]  [music]"}, {"title": "How to Wash Lettuce", "id": "WbfhvpK6ggk", "url": "https://www.youtube.com/embed/WbfhvpK6ggk", "uploader": "Guidecentral English", "views": 1496, "duration": 33, "description": "Learn how to wash lettuce with this guide from wikiHow: https://www.wikihow.com/Wash-Lettuce\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "WbfhvpK6ggk.mp4", "subtitles": "to wash lettuce use a knife to cut off the root in any wilted spots from the lettuce and cut out the core if you're using iceberg lettuce use your hands to separate the lettuce leaves then soak your lettuce in a bowl full of cold water swirling the lettuce around to loosen any dirt after about 10 minutes take the greens out of the bowl and shake any excess water off the leaves dry the lettuce by spinning it in a salad spinner or by patting the leaves dry with paper towels youto wash lettuce use a knife to cut off the root in any wilted spots from the lettuce and cut out the core if you're using iceberg lettuce use your hands to separate the lettuce leaves then soak your lettuce in a bowl full of cold water swirling the lettuce around to loosen any dirt after about 10 minutes take the greens out of the bowl and shake any excess water off the leaves dry the lettuce by spinning it in a salad spinner or by patting the leaves dry with paper towels you"}, {"title": "How to Clean Eggs", "id": "qCcMlnB4igE", "url": "https://www.youtube.com/embed/qCcMlnB4igE", "uploader": "Guidecentral English", "views": 147, "duration": 31, "description": "Learn how to clean eggs with this guide from wikiHow: https://www.wikihow.com/Clean-Eggs\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "qCcMlnB4igE.mp4", "subtitles": "to clean eggs start by filling two bowls with warm water then add a few drops of dish soap into one of the bowls and a splash of vinegar or bleach to the other next dip each egg in the dish soap water and scrub it with your fingers or a scrub brush after you clean off the eggs dip them in the vinegar or bleach water and set them on a paper towel to dry once the eggs are dry transfer them to a carton and you're done youto clean eggs start by filling two bowls with warm water then add a few drops of dish soap into one of the bowls and a splash of vinegar or bleach to the other next dip each egg in the dish soap water and scrub it with your fingers or a scrub brush after you clean off the eggs dip them in the vinegar or bleach water and set them on a paper towel to dry once the eggs are dry transfer them to a carton and you're done you"}, {"title": "How to Clean Strawberries", "id": "yS8jE2Fat1M", "url": "https://www.youtube.com/embed/yS8jE2Fat1M?showinfo=0", "uploader": "wikiHow", "views": 6005, "duration": 41, "description": "Learn how to clean strawberries with this guide from wikiHow: https://www.wikihow.com/Clean-Strawberries\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "yS8jE2Fat1M.mp4", "subtitles": "to clean strawberries first fill a large bowl with four parts water and one part white vinegar place the strawberries in the vinegar solution and let them soak for 20 minutes then drain the strawberries into a colander and rinse them thoroughly with cool water rotate the strawberries in the colander while rinsing them so the water gets to all of the fruit finally pat the strawberries dry with paper towels for organic strawberries you can just rinse them off with cool water in a colander to clean them since they shouldn't have any pesticides on themto clean strawberries first fill a large bowl with four parts water and one part white vinegar place the strawberries in the vinegar solution and let them soak for 20 minutes then drain the strawberries into a colander and rinse them thoroughly with cool water rotate the strawberries in the colander while rinsing them so the water gets to all of the fruit finally pat the strawberries dry with paper towels for organic strawberries you can just rinse them off with cool water in a colander to clean them since they shouldn't have any pesticides on them"}, {"title": "How to Cut a Papaya", "id": "6b1IN44V86Y", "url": "https://www.youtube.com/embed/6b1IN44V86Y?showinfo=0", "uploader": "wikiHow", "views": 365, "duration": 39, "description": "Learn How to Cut a Papaya with this guide from wikiHow: https://www.wikihow.com/Cut-a-Papaya\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "6b1IN44V86Y.mp4", "subtitles": "to cut a papaya first cut the papaya in half lengthwise using a sharp chef's knife then scoop out all of the seeds in each half using a spoon and discard them place one of the halves skin side down on your cutting board and cut it into thick evenly spaced slices repeat with the other half now use your knife to cut the skin off of each slice you can leave the slices as they are or you can make evenly spaced cuts across them for bite size papaya pieces be sure to practice knife safetyto cut a papaya first cut the papaya in half lengthwise using a sharp chef's knife then scoop out all of the seeds in each half using a spoon and discard them place one of the halves skin side down on your cutting board and cut it into thick evenly spaced slices repeat with the other half now use your knife to cut the skin off of each slice you can leave the slices as they are or you can make evenly spaced cuts across them for bite size papaya pieces be sure to practice knife safety"}, {"title": "How to Bag Groceries", "id": "XIM6RZQFBj0", "url": "https://www.youtube.com/embed/XIM6RZQFBj0", "uploader": "wikiHow", "views": 16023, "duration": 75, "description": "Learn How to Bag Groceries with this guide from wikiHow: https://www.wikihow.com/Bag-Groceries\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "XIM6RZQFBj0.mp4", "subtitles": ""}, {"title": "How to Bake a Yam", "id": "Huk26YgxiG0", "url": "https://www.youtube.com/embed/Huk26YgxiG0?showinfo=0", "uploader": "wikiHow", "views": 76, "duration": 143, "description": "Learn how to bake a yam with this guide from wikiHow: https://www.wikihow.com/Bake-a-Yam\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "Huk26YgxiG0.mp4", "subtitles": "[Music] you[Music] you [Music] you"}, {"title": "How to Bake Potatoes", "id": "PoydhOjqilw", "url": "https://www.youtube.com/embed/PoydhOjqilw?showinfo=0", "uploader": "wikiHow", "views": 98, "duration": 44, "description": "Learn How to Bake Potatoes with this guide from wikiHow: https://www.wikihow.com/Bake-Potatoes\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "PoydhOjqilw.mp4", "subtitles": "to bake potatoes first scrub the potatoes and rinse them in cold water pat them dry and cut off any bruised or discolored spots then pierce the potatoes with a fork for faster cooking in an oven bake the potatoes at 425 degrees Fahrenheit 220 degrees Celsius for 45 to 60 minutes you also wrap them in aluminum foil to shorten your cooking time since it acts as a heat conductor for fast baked potatoes place the washed and Pierce potatoes in a microwave-safe dish cook for 5 minutes on each side and enjoyto bake potatoes first scrub the potatoes and rinse them in cold water pat them dry and cut off any bruised or discolored spots then pierce the potatoes with a fork for faster cooking in an oven bake the potatoes at 425 degrees Fahrenheit 220 degrees Celsius for 45 to 60 minutes you also wrap them in aluminum foil to shorten your cooking time since it acts as a heat conductor for fast baked potatoes place the washed and Pierce potatoes in a microwave-safe dish cook for 5 minutes on each side and enjoy"}, {"title": "How to Bake Sweet Potatoes", "id": "S3nQzqnh1IM", "url": "https://www.youtube.com/embed/S3nQzqnh1IM?showinfo=0", "uploader": "wikiHow", "views": 26, "duration": 108, "description": "Learn how to bake sweet potatoes with this guide from wikiHow: https://www.wikihow.com/Bake-Sweet-Potatoes\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "S3nQzqnh1IM.mp4", "subtitles": ""}, {"title": "How do you become an executive chef? | wikiHow Asks Michelin Star rated chef Alex Hong", "id": "pKh1x2LdpCI", "url": "https://www.youtube.com/embed/pKh1x2LdpCI?showinfo=0", "uploader": "wikiHow", "views": 1753, "duration": 279, "description": "wikiHow spent a day in the life of executive chef Alex Hong, and learned what it takes to become Michelin Star rated. Alex is a co-owner of Sorrel restaurant in San Francisco, CA.\nRead more: https://www.wikihow.com/Become-a-Chef\n---\nwikiHow Expert Alex Hong is the Executive Chef and owner of Sorrel, a New American restaurant in San Francisco. He has been working in restaurants for over ten years. Alex is a graduate of the Culinary Institute of America, and has worked in the kitchens of Jean-Georges and Quince, both Michelin-starred restaurants.\nLearn more: https://www.sorrelrestaurant.com/\n\n---\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/\n\n---\nOkey Dokey Smokey by Audionautix is licensed under a Creative Commons Attribution license (https://creativecommons.org/licenses/by/4.0/)\nArtist: http://audionautix.com/", "hosted_mp4": "pKh1x2LdpCI.mp4", "subtitles": "hi my name is Alex Hong I'm the executive chef and owner of soar restaurant in San Francisco we do whole - well I've been cooking since high school so I've been basically cooking for 15 years I got into food kind of two different ways one was for my aunt and uncle who were organic farmers in Missouri for them to bring all this amazing produce and cook something that's totally different was kind of a changing point but I do have to say the first kind of interest in cooking was just kind of funny in a summer job in high school I got hired at kind of this kind of old-school steakhouse and it worked there for four years really kind of falling in love with cooking and working a couple different stations and deciding that I wanted to go to culinary school after that so a typical day to day for me in this restaurant is kind of coming in I come in kind of around 10:30 to 11:00 and we all kind of meet as like a management team there's four of us there's a chef de cuisine the executive sous chef the sous chef and the pastry chef and every day we meet back here and just go over the menu go over things that happened last night and things that we can improve on and new dishes coming up and events and all that stuff the CDC chef de cuisine starts all the butchery executives sue and Sue kind of go through the prep morning prep lists and manage the prep cooks and the pastry chef starts his prep list at 2 o'clock the line cooks come in and we have another meeting kind of just going over the night the cover counts the big pushes family meal is at 3:40 and then everyone's back up for 15 and then we open up 5 so to be an executive chef you need to put in your dues you need to put in a time this could take you know anywhere from like five to ten years to kind of depending on your skill level you start washing dishes so then you move to garnish a learning kind of all of the hot and cold apps and crudos and all that type of stuff once you put in your time there and it take away as much as you can you'll move to pasta station and then after pasta station you'll move into pasta production when you're you're learning really how to make all these pastas with your hand after that is meat entremet and you're working very very close with the protein cook so once you master that you move to protein station and protein station is kind of like the head of the line and you're basically you're doing some butchery and you're also you know you're cooking at proteins and that it's very very important that you have the right skill level so after being protein station you kind of graduate to what's called at or not and eight or not basically works kind of any station if someone calls out sick or just helping other station if they're in the weeds or whatnot after tour not kind of come sous chef which is like making all the stocks and the sauces and the braces and and all that stuff and the executive sous-chef has just a little bit more responsibilities does more ordering and just kind of like make sure that the whole team is ready and set up on time and then the chef de cuisine he's kind of like my second hand man and also does a lot of like their creativity parts of the restaurant and and helps out with like food cost and inventory and all that stuff my advice for a teenager would be go to your local favorite restaurant asked to star which is kind of like a trial that's your college you're taking as much information as possible but you're also working these long days 12 hours a day is five to six days a week and it's draining on your body and your love life and your and your friends and family and all that stuff but it's super God if we got gratifying so go in there and do a couple days stodg and see if if you really like it if you really like the atmosphere if you're still wanting to do this as your career then I would keep on challenging yourself and work for a better person and a better person a better person and absorb as much knowledge as you can I think it takes a certain period of time and and repetition to really master a craft it's a giant trial and error period and and I can't tell you how many dishes I made for my family that are just unedible and still I'm still learning some new stuff every single dayhi my name is Alex Hong I'm the executive chef and owner of soar restaurant in San Francisco we do whole - well I've been cooking since high school so I've been basically cooking for 15 years I got into food kind of two different ways one was for my aunt and uncle who were organic farmers in Missouri for them to bring all this amazing produce and cook something that's totally different was kind of a changing point but I do have to say the first kind of interest in cooking was just kind of funny in a summer job in high school I got hired at kind of this kind of old-school steakhouse and it worked there for four years really kind of falling in love with cooking and working a couple different stations and deciding that I wanted to go to culinary school after that so a typical day to day for me in this restaurant is kind of coming in I come in kind of around 10:30 to 11:00 and we all kind of meet as like a management team there's four of us there's a chef de cuisine the executive sous chef the sous chef and the pastry chef and every day we meet back here and just go over the menu go over things that happened last night and things that we can improve on and new dishes coming up and events and all that stuff the CDC chef de cuisine starts all the butchery executives sue and Sue kind of go through the prep morning prep lists and manage the prep cooks and the pastry chef starts his prep list at 2 o'clock the line cooks come in and we have another meeting kind of just going over the night the cover counts the big pushes family meal is at 3:40 and then everyone's back up for 15 and then we open up 5 so to be an executive chef you need to put in your dues you need to put in a time this could take you know anywhere from like five to ten years to kind of depending on your skill level you start washing dishes so then you move to garnish a learning kind of all of the hot and cold apps and crudos and all that type of stuff once you put in your time there and it take away as much as you can you'll move to pasta station and then after pasta station you'll move into pasta production when you're you're learning really how to make all these pastas with your hand after that is meat entremet and you're working very very close with the protein cook so once you master that you move to protein station and protein station is kind of like the head of the line and you're basically you're doing some butchery and you're also you know you're cooking at proteins and that it's very very important that you have the right skill level so after being protein station you kind of graduate to what's called at or not and eight or not basically works kind of any station if someone calls out sick or just helping other station if they're in the weeds or whatnot after tour not kind of come sous chef which is like making all the stocks and the sauces and the braces and and all that stuff and the executive sous-chef has just a little bit more responsibilities does more ordering and just kind of like make sure that the whole team is ready and set up on time and then the chef de cuisine he's kind of like my second hand man and also does a lot of like their creativity parts of the restaurant and and helps out with like food cost and inventory and all that stuff my advice for a teenager would be go to your local favorite restaurant asked to star which is kind of like a trial that's your college you're taking as much information as possible but you're also working these long days 12 hours a day is five to six days a week and it's draining on your body and your love life and your and your friends and family and all that stuff but it's super God if we got gratifying so go in there and do a couple days stodg and see if if you really like it if you really like the atmosphere if you're still wanting to do this as your career then I would keep on challenging yourself and work for a better person and a better person a better person and absorb as much knowledge as you can I think it takes a certain period of time and and repetition to really master a craft it's a giant trial and error period and and I can't tell you how many dishes I made for my family that are just unedible and still I'm still learning some new stuff every single day"}, {"title": "How to Belly Roll", "id": "5tcV4teBm2A", "url": "https://www.youtube.com/embed/5tcV4teBm2A?showinfo=0", "uploader": "wikiHow", "views": 2787, "duration": 55, "description": "Learn how to belly roll with this guide from wikiHow: https://www.wikihow.com/Belly-Roll\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "5tcV4teBm2A.mp4", "subtitles": "here he watered it and he was this force and cheap andhere he watered it and he was this force and cheap and here he watered it and he was this force and cheap anddeceived us withdeceived us with deceived us withimpudence he gives babs fomina loap there sheimpudence he gives babs fomina loap there she impudence he gives babs fomina loap there sherushed the tank popped the batin of therushed the tank popped the batin of the rushed the tank popped the batin of theold stunden infanta youold stunden infanta you old stunden infanta youwhere of feet shoutout from the skirts straightwhere of feet shoutout from the skirts straight where of feet shoutout from the skirts straighteju khao lak steju khao lak st eju khao lak stsake new but deceived the mosolovsake new but deceived the mosolov sake new but deceived the mosolovlet a little overtake been so canyonlet a little overtake been so canyon let a little overtake been so canyondeceived us cissdeceived us ciss deceived us cissand deceived mosolov practice akininand deceived mosolov practice akinin and deceived mosolov practice akininfound cinema souls and martyshinfound cinema souls and martyshin found cinema souls and martyshinhe secateurs him it go fast as a mixhe secateurs him it go fast as a mix he secateurs him it go fast as a mixvarnishes decrease fieldsvarnishes decrease fields varnishes decrease fields1 protests ezio will buy ball from okie overtook1 protests ezio will buy ball from okie overtook 1 protests ezio will buy ball from okie overtookmass xss likes and fingersmass xss likes and fingers mass xss likes and fingerspaid kali rolling izia"}, {"title": "How to Blanch Broccoli", "id": "Tw3UO3J6PdE", "url": "https://www.youtube.com/embed/Tw3UO3J6PdE?showinfo=0", "uploader": "wikiHow", "views": 18673, "duration": 51, "description": "Learn how to blanch broccoli with this guide from wikiHow: https://www.wikihow.com/Blanch-Broccoli\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "Tw3UO3J6PdE.mp4", "subtitles": "Chibu lgpl almost to act of boa almost into red soleChibu lgpl almost to act of boa almost into red sole Chibu lgpl almost to act of boa almost into red sole, vol.2 try taking a picture of boa with par, vol.2 try taking a picture of boa with par     collective whelan bike ing  dessert or to die or die rote is swollendessert or to die or die rote is swollen dessert or to die or die rote is swollen  big nosed puig to send behind the security korn axis in this group being a luibig nosed puig to send behind the security korn axis in this group being a lui big nosed puig to send behind the security korn axis in this group being a luiin the middle of a 100 dollar tower"}, {"title": "How to Blanch Cauliflower", "id": "jNVfv50NxgM", "url": "https://www.youtube.com/embed/jNVfv50NxgM?showinfo=0", "uploader": "wikiHow", "views": 1435, "duration": 44, "description": "Learn how to blanch cauliflower with this guide from wikiHow: https://www.wikihow.com/Blanch-Cauliflower\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "jNVfv50NxgM.mp4", "subtitles": "to blanch cauliflower first bring a large pot of water to a boil and fill a bowl with water and ice cut the cauliflower up into florets then add the florets to the boiling water let the florets cook for three minutes drain the florets in a colander and immediately transfer them to the bowl of ice water so they stop cooking finally drain the cauliflower in the colander and dry the florets with a dish towel you can store your blanched cauliflower in an airtight container in the fridge for up to five days or in the freezer for up to six monthsto blanch cauliflower first bring a large pot of water to a boil and fill a bowl with water and ice cut the cauliflower up into florets then add the florets to the boiling water let the florets cook for three minutes drain the florets in a colander and immediately transfer them to the bowl of ice water so they stop cooking finally drain the cauliflower in the colander and dry the florets with a dish towel you can store your blanched cauliflower in an airtight container in the fridge for up to five days or in the freezer for up to six months"}]