[{"title": "How to Toast Sesame Seeds", "id": "EQkkuDl9Tb0", "url": "https://www.youtube.com/embed/EQkkuDl9Tb0?showinfo=0", "uploader": "wikiHow", "views": 3713, "duration": 49, "description": "Learn how to toast sesame seeds with this guide from wikiHow: https://www.wikihow.com/Toast-Sesame-Seeds\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "EQkkuDl9Tb0.mp4", "subtitles": "to toast sesame seeds in the oven first spread out the seeds in a single layer on a baking sheet then toast the seeds in the oven at 350 degrees fahrenheit 177 degrees celsius for 8 to 10 minutes or until they're golden brown you can also toast sesame seeds on the stove first spread the seeds out in a skillet then turn the stove to medium heat toast the sesame seeds for three to five minutes or until they're golden brown stirring them occasionally use your toasted sesame seeds in a recipe right away or store them in an airtight container in the refrigerator or freezer for up to a yearto toast sesame seeds in the oven first spread out the seeds in a single layer on a baking sheet then toast the seeds in the oven at 350 degrees fahrenheit 177 degrees celsius for 8 to 10 minutes or until they're golden brown you can also toast sesame seeds on the stove first spread the seeds out in a skillet then turn the stove to medium heat toast the sesame seeds for three to five minutes or until they're golden brown stirring them occasionally use your toasted sesame seeds in a recipe right away or store them in an airtight container in the refrigerator or freezer for up to a year"}, {"title": "How to Delete Dropbox from Mac", "id": "giFAcJQw4W0", "url": "https://www.youtube.com/embed/giFAcJQw4W0", "uploader": "Mac OS X Tutorials and App reviews from HowTech", "views": 14119, "duration": 37, "description": "Learn how to delete dropbox from mac.\n\nDon't forget to check out our site http://howtech.tv/ for more free how-to videos!\nhttp://youtube.com/ithowtovids - our feed\nhttp://www.facebook.com/howtechtv - join us on facebook\nhttps://plus.google.com/103440382717658277879 - our group in Google+\n\nTo delete dropbox from your mac right click on the dropbox icon in the menu bar at the top right. Select launch dropbox website.\n\nOnce your dropbox opens online select the arrow next to your name. Click settings.\n\nClick on the account settings tab. Under account preferences click the delete my account link.\n\nEnter your password. Enter a reason your leaving. Enter in additional information if you like. Then click on delete my account.\n\nYour dropbox account will now be deleted.", "hosted_mp4": "giFAcJQw4W0.mp4", "subtitles": ""}, {"title": "How to Use a Bamboo Steamer Basket", "id": "q8cPVPH3EMI", "url": "https://www.youtube.com/embed/q8cPVPH3EMI?showinfo=0", "uploader": "wikiHow", "views": 78921, "duration": 89, "description": "Learn how to use a bamboo steamer basket with this guide from wikiHow: https://www.wikihow.com/Use-a-Bamboo-Steamer-Basket\n\n0:00 Filling and Stacking\n0:33 Steaming the Food\n1:05 Cleaning\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "q8cPVPH3EMI.mp4", "subtitles": "and thereand there and thereand there"}, {"title": "How to Use a Beauty Blender", "id": "nad7urHpcYI", "url": "https://www.youtube.com/embed/nad7urHpcYI", "uploader": "Guidecentral English", "views": 291, "duration": 34, "description": "Learn how to use a beauty blender with this guide from wikiHow: https://www.wikihow.com/Use-a-Beauty-Blender\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "nad7urHpcYI.mp4", "subtitles": "to use a Beautyblender start by moistening the sponge with water to prevent it from soaking up too much of the product you are blending tap the sponge into the makeup and then tap the round bottom on your skin to apply the makeup you can also use the pointed edge to apply makeup to smaller areas like under the eyes and around the nose after each use wash the sponge with an antibacterial fragrance-free dishwashing soap so it won't grow bacteria after washing and air drying your Beauty Blender it will be ready when you need it nextto use a Beautyblender start by moistening the sponge with water to prevent it from soaking up too much of the product you are blending tap the sponge into the makeup and then tap the round bottom on your skin to apply the makeup you can also use the pointed edge to apply makeup to smaller areas like under the eyes and around the nose after each use wash the sponge with an antibacterial fragrance-free dishwashing soap so it won't grow bacteria after washing and air drying your Beauty Blender it will be ready when you need it next"}, {"title": "How to Use a Paring Knife", "id": "Lm4_4Mp03Oo", "url": "https://www.youtube.com/embed/Lm4_4Mp03Oo?showinfo=0", "uploader": "wikiHow", "views": 975, "duration": 58, "description": "Learn how to use a paring knife with this guide from wikiHow: https://www.wikihow.com/Use-a-Paring-Knife\n\n0:00 Peeling Fruit and Vegetables \n0:25 Removing Stems & Seeds, Dicing, and Deveining Shrimp \n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "Lm4_4Mp03Oo.mp4", "subtitles": ""}, {"title": "How to Use a Honing Rod", "id": "Tu5nk6diWWg", "url": "https://www.youtube.com/embed/Tu5nk6diWWg?showinfo=0", "uploader": "wikiHow", "views": 324, "duration": 42, "description": "Learn how to use a sharpening steel with this guide from wikiHow: https://www.wikihow.com/Use-a-Sharpening-Steel\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "Tu5nk6diWWg.mp4", "subtitles": "I love Hollywood stars ChrisI love Hollywood stars Chris I love Hollywood stars Chrisstages of first Night overall productsstages of first Night overall products stages of first Night overall productssuch as interesting for your firstsuch as interesting for your first such as interesting for your firstperson you are you Nice toss against allperson you are you Nice toss against all person you are you Nice toss against allodds and ends tonight to sleep Wake Wakeodds and ends tonight to sleep Wake Wake odds and ends tonight to sleep Wake WakeMe Up and maintain the first thing youMe Up and maintain the first thing you Me Up and maintain the first thing youwin the beliefs and What you' re awaywin the beliefs and What you' re away win the beliefs and What you' re awaypass in spite of printers Point For Youpass in spite of printers Point For You pass in spite of printers Point For Youor in Thailand Comes to contact us youror in Thailand Comes to contact us your or in Thailand Comes to contact us yourPain exist and professinal slightly morePain exist and professinal slightly more Pain exist and professinal slightly morenice eyes to me for the first on itsnice eyes to me for the first on its nice eyes to me for the first on itssize à"}, {"title": "Do's and Don'ts for Using Coconut Oil on Your Hair | wikiHow Asks a Licensed Cosmetologist", "id": "LrS1z17a4Yk", "url": "https://www.youtube.com/embed/LrS1z17a4Yk?showinfo=0", "uploader": "wikiHow", "views": 91, "duration": 35, "description": "Learn the do's and don't of using coconut oil on your hair with licensed cosmetologist, Courtney Foster. Read more in this wikiHow guide: https://www.wikihow.com/Use-Coconut-Oil-on-Your-Hair-and-Skin\n--- \nCourtney Foster is a Licensed Cosmetologist, Certified Hair Loss Practitioner, and Cosmetology Educator based out of New York City. Courtney runs Courtney Foster Beauty, LLC and her work has been featured on The Wendy Williams Show, Good Morning America, The Today Show, The Late Show with David Letterman, and in East/West Magazine. She received her Cosmetology License from the State of New York after training at the Empire Beauty School - Manhattan.\nLearn more: https://www.courtneyfosterbeauty.com/\n---\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "LrS1z17a4Yk.mp4", "subtitles": ""}, {"title": "How to Use Curry Leaves", "id": "upbjaVNkDaE", "url": "https://www.youtube.com/embed/upbjaVNkDaE?showinfo=0", "uploader": "wikiHow", "views": 22278, "duration": 93, "description": "Learn how to use curry leaves with this guide from wikiHow: https://www.wikihow.com/Use-Curry-Leaves\n\n0:00 Sautéing Curry Leaves\n0:35 Adding Curry Leaves to Different Dishes\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "upbjaVNkDaE.mp4", "subtitles": ""}, {"title": "How to Use Kaffir Lime Leaves", "id": "rEgf4Bm7v9s", "url": "https://www.youtube.com/embed/rEgf4Bm7v9s?showinfo=0", "uploader": "wikiHow", "views": 1445, "duration": 55, "description": "Learn how to use kaffir lime leaves with this guide from wikiHow: https://www.wikihow.com/Use-Kaffir-Lime-Leaves\n\n0:00 Preparing and Storing \n0:34 Using Dried and Powdered Leaves \n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "rEgf4Bm7v9s.mp4", "subtitles": "yeah yeah  [music]"}, {"title": "How to Use Leftover Pancake Batter", "id": "vl0aHhGypzU", "url": "https://www.youtube.com/embed/vl0aHhGypzU?showinfo=0", "uploader": "wikiHow", "views": 872, "duration": 27, "description": "Learn how to use leftover pancake batter with this guide from wikiHow: https://www.wikihow.com/Use-Leftover-Pancake-Batter\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "vl0aHhGypzU.mp4", "subtitles": ""}, {"title": "How to Use Lemon Juice to Lighten Hair", "id": "qrfh6QR8FOE", "url": "https://www.youtube.com/embed/qrfh6QR8FOE?showinfo=0", "uploader": "wikiHow", "views": 14572, "duration": 45, "description": "Learn how to use lemon juice to lighten hair with this guide from wikiHow: https://www.wikihow.com/Use-Lemon-Juice-to-Lighten-Hair\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nPinterest: https://www.pinterest.com/wikihow/\nInstagram: https://www.instagram.com/wikihow/\nTikTok: https://www.tiktok.com/@wikihow\nFacebook: https://www.facebook.com/wikiHow/", "hosted_mp4": "qrfh6QR8FOE.mp4", "subtitles": "to lighten your hair with lemon juice first mix together two parts water and one part lemon juice if you have dry hair you can use three parts lemon juice and one part leave-in conditioner instead pour the mixture into a spray bottle then wet your hair so it's damp but not soaked spritz the lemon juice mixture into your hair then go outside in the sun for one to two hours to activate the citric acid in the lemon juice and lighten your hair make sure you wear sunscreen finally wash your hair with shampoo and conditioner to remove the lemon juice and enjoy your new sunkissed hairto lighten your hair with lemon juice first mix together two parts water and one part lemon juice if you have dry hair you can use three parts lemon juice and one part leave-in conditioner instead pour the mixture into a spray bottle then wet your hair so it's damp but not soaked spritz the lemon juice mixture into your hair then go outside in the sun for one to two hours to activate the citric acid in the lemon juice and lighten your hair make sure you wear sunscreen finally wash your hair with shampoo and conditioner to remove the lemon juice and enjoy your new sunkissed hair"}, {"title": "How to Use Linseed Oil", "id": "Lu2-q743MVU", "url": "https://www.youtube.com/embed/Lu2-q743MVU?showinfo=0", "uploader": "wikiHow", "views": 15258, "duration": 70, "description": "Learn how to use linseed oil with this guide from wikiHow: https://www.wikihow.com/Use-Linseed-Oil\n\n0:00 Finishing Wood\n0:35 Using with Oil Paints\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "Lu2-q743MVU.mp4", "subtitles": ""}, {"title": "Cooking Tips : How to Use Parchment Paper", "id": "Jz4Lr9jGKkk", "url": "https://www.youtube.com/embed/Jz4Lr9jGKkk", "uploader": "cookingguide", "views": 21443, "duration": 18, "description": "Get Kitchen Tips on How to use Parchment Paper. Learn Basic cooking techniques and tips in this video.", "hosted_mp4": "Jz4Lr9jGKkk.mp4", "subtitles": "Parchment paper is used for baking. Placethis on a sheet pan and put your product ontop of this parchment paper and that willkeep it from sticking to the sheet pan. Typicallyit?s preferred over wax paper when bakingbecause it doesn't give off any flavors likewax paper does. And that is parchment paper."}, {"title": "How to Use Rosemary in Cooking", "id": "l8-YAlO7QS8", "url": "https://www.youtube.com/embed/l8-YAlO7QS8", "uploader": "Guidecentral English", "views": 585, "duration": 34, "description": "Learn how to use rosemary in cooking with this guide from wikiHow: https://www.wikihow.com/Use-Rosemary-in-Cooking\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "l8-YAlO7QS8.mp4", "subtitles": "before using rosemary and cooking rinse it and trim off individual sprigs if you want to use the rosemary for a garnish or flavoring keep the sprigs intact however if you plan to use the rosemary in your recipes then pinch the tip of the sprig with one hand and slide your other hand down the stem to strip off individual needles dice the needles until they're fine and sprinkle them on breads baked goods fish and meats youbefore using rosemary and cooking rinse it and trim off individual sprigs if you want to use the rosemary for a garnish or flavoring keep the sprigs intact however if you plan to use the rosemary in your recipes then pinch the tip of the sprig with one hand and slide your other hand down the stem to strip off individual needles dice the needles until they're fine and sprinkle them on breads baked goods fish and meats you"}, {"title": "How to Warm Tortillas", "id": "UopTW4DeNiA", "url": "https://www.youtube.com/embed/UopTW4DeNiA", "uploader": "Guidecentral English", "views": 314, "duration": 30, "description": "Learn how to warm tortillas with this guide from wikiHow: https://www.wikihow.com/Warm-Tortillas\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "UopTW4DeNiA.mp4", "subtitles": "to warm tortillas in the oven lightly sprinkle or spray both sides with water stack five to eight tortillas on top of each other and wrap them in foil then bake them in an oven preheated to 375 degrees fahrenheit for 10 to 15 minutes if you prefer to warm your tortillas in the skillet either moisten them with water or for crispier tortillas brush each side with a little oil or butter then place the tortillas into the skillet one at a time for 30 seconds on each sideto warm tortillas in the oven lightly sprinkle or spray both sides with water stack five to eight tortillas on top of each other and wrap them in foil then bake them in an oven preheated to 375 degrees fahrenheit for 10 to 15 minutes if you prefer to warm your tortillas in the skillet either moisten them with water or for crispier tortillas brush each side with a little oil or butter then place the tortillas into the skillet one at a time for 30 seconds on each side"}, {"title": "How to Zest a Lemon", "id": "lfwIDEWhF8c", "url": "https://www.youtube.com/embed/lfwIDEWhF8c?showinfo=0", "uploader": "wikiHow", "views": 112, "duration": 27, "description": "Learn How to Zest a Lemon with this guide from wikiHow: https://www.wikihow.com/Zest-a-Lemon\n\nFollow our social media channels to find more interesting, easy, and helpful guides!\n\nFacebook: https://www.facebook.com/wikiHow/\nTwitter: https://twitter.com/wikiHow\nInstagram: https://www.instagram.com/wikihow/", "hosted_mp4": "lfwIDEWhF8c.mp4", "subtitles": "to zest the lemon start by cleaning it thoroughly with water and soap then hold a grater over a cutting board at a 45-degree angle and gently run the lemon down it if you don't have a grater you can use a knife or vegetable peeler to cut off the outer yellow peel from the fruit if needed dice up the peel into smaller pieces before adding it to your recipeto zest the lemon start by cleaning it thoroughly with water and soap then hold a grater over a cutting board at a 45-degree angle and gently run the lemon down it if you don't have a grater you can use a knife or vegetable peeler to cut off the outer yellow peel from the fruit if needed dice up the peel into smaller pieces before adding it to your recipe"}]